{"location": {"country": "US", "locality": "United States", "region": "United States", "postal_code": "99999", "street_address": null, "latitude": 39.50355, "longitude": -99.0183}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Site Reliability Engineer", "industry": "Information Technology and Services,Consumer Electronics", "description": "Site Reliability Engineer\nOur client is looking to hire a Site Reliability Engineer to join their team! The SRE will configure, tune, and troubleshoot multi-tiered systems to achieve optimal application performance, stability and availability. In this role, this person will work closely with the software engineers, infrastructure, and network engineers to deploy and maintain our services. This position is fully remote but\ncandidates must be able to work PST hours.\nAdditionally, candidates for this role\nmust be eligible to work W2 (we are unable to work C2C at this time).\nThe Right Candidate For This Role Will\nHave a hands-on, get the job done, attitude.\nBe a self-starter who can troubleshoot from start to finish with minimal supervision.\nHave the flexibility to deal with rapidly changing needs\nBe able to balance multiple projects and assignments.\nRequirements\n5+ years of experience as an SRE in a large, fast-paced production environment\nMust have at least 3 years of experience building and managing AWS infrastructure using Terraform\nMust be able to demonstrate deep knowledge of the following AWS Managed Services: EKS, ECS, MSK\nMust have strong Python skills (the ability to write simple, and complex automation scripts from scratch as well as modify existing ones).\nMust have excellent troubleshooting skills\nMust have excellent communication skills and be able to work cross-functionally\nPlus Skills\nExperience with Kubernetes (will help with troubleshooting)\nUnderstanding of the Linux and system administration at a large scale\nDay-To-Day\nThe primary function of the role is 70% or more:\nSupporting the health of the production systems:\nDaily, looking at all the monitoring dashboards to see if there are any problems that need to be taken care of and then prioritizing those\nAs needed, monitoring the infrastructure issues Slack channel from the engineering group and communicate with that team to further understand the problem and resolve it\nThe secondary function of the role is 30% or less:\nWorking on sprint board tasks – Example: Someone comes across a problem, and they currently aren’t monitoring for that. So, the task on the sprint board is “Create a new monitoring system” --- This person would then develop scripts used for environment monitoring and task automation using Python", "employment_type": "CONTRACTOR", "date_posted": "2021-08-20T17:00:51.000Z"}, "company": {"name": "The Select Group", "link": "https://www.linkedin.com/company/the-select-group"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}