{"location": {"country": "US", "locality": "Utica-Rome Area", "region": "Utica-Rome Area", "postal_code": "13501", "street_address": null, "latitude": 43.09009, "longitude": -75.2616}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Business Solution Lead", "industry": "Information Technology and Services,Insurance,Financial Services", "description": "As a member of the Global Center of Competence (CoC), the Business Solution Lead partners with business/functional leaders and working groups to provide strategic leadership and identify pragmatic and innovative automation and digitization solutions. He/She will leverage their process-driven, analytical and technical skills to create and maintain automation solutions. Their role includes coaching business and functional unit leaders across the organization to drive and lead process augmentation and automation initiatives across the enterprise.\nKey Responsibilities\nEngage in Business Solutioning and Stakeholder Management\nPartner with the Product Owner to define core product vision, goals, functionality and requirements\nStand up the practice within the LoB/Function and partner closely with the Transformation Lead to create the framework and governance model\nEstablish a shared vision by building consensus on priorities leading to product execution with the product owner\nCollaborate with highly creative user experience experts, visual designers and engineers to reach the best possible version of a feature or product to bring to market\nCreate and maintain product roadmaps, with the product owner feature backlogs and product documentation\nHelp define and refine working processes in order to maximize efficiency in constantly evolving environments\nDrive Lean Management thinking and start to transition using Agile Development\nPartner with BPR expert to identify automation opportunities, discuss automation approach and framework with designated business and functional product owners by outlining deliverables, timeline, roles/responsibilities to build BPA pipeline\nDesign digital/ business automation solution in partnership with IT and Product Owners while ensuring alignment with the agreed process flow\nCollaborate with internal IT experts to design feasible IT solution, build user stories to support desired automation solution\nSecure approvals for BA resource requirements\nEstablish and participate PI Planning, regular project update meetings\nMonitor pipeline, and inflight initiatives progress.\nSupport business/functional Automation owner to build out communication to ensure proper engagement such as key milestones, in scope processes current and future state, timelines, technology dependencies, roles/responsibilities between business/functional owners, IT, Vendor and Global Automation team\nAct as an escalation to secure engagement and resolution\nAssists the line of business to escalate and resolve project blockers such as issues with business resources, IT and or SI Partner engagement\nMentor and manage several team members\nSupport Process Automation Implementation and Production\nCollaborate with transformation leads, and product owners to align on business objective, drive the automation business solution and planning, consult IT during the development phase, and monitor supervised production for assigned Workstream and/or initiatives.\nSupports the deployment of agile and machine learning capabilities in the LOBs in line with Chubb standards\nEngage the appropriate internal and external (staff augmentation) resources to use process automation best practices to deliver successful solutions.\nAssist the business to Integrate multiple projects across the line of business value chain.\nAssist in the deployment of program and project management standards for effective delivery meeting Time, Quality, Budget, LOB requirements.\nGuide and partner with change management resources (Change Manager & HR) to ensure effective communication and execution of the required organizational and role changes.\nProvide guidance on the post implementation support.\nAssist the LOB to Identify “in unit” roles and time requirements and work with business leaders to identify staff for the assignments\nConduct lessons learnt post deployment on each initiative\nEngage in enhancing Digital / Process Automation framework and monitor adoption across the enterprise\nParticipate as an active member of the Business Process Automation Excellence team, in developing a set of best practice guidelines and training content for use across all PA initiatives.\nContribute to the continuous improvement of automation framework, technologies and knowledge by sharing information, building standards, developing intellectual property and capturing lessons learned.\nProvide direction and guidance to all program staff for assigned units and programs.\nCoach team members on areas of development to increase their knowledge and work performance.\nPreferred Qualifications\nMinimum of 4-6 years transformation experience, ideally within a global corporate footprint\n4 – 6 years digital/business process engineering/business analysis experience in financial services\nSuccessful experience in major automation/digital transformations, with a heavy focus on both top and bottom line improvement\nDemonstrate deep understanding of the different ways of automation – including robotic process automation, intelligence scanning, virtual process management, artificial intelligence/cognitive\nTop tier strategy or execution consulting experience with Digital and Lean or Opex management experience preferred\nExperienced leader, known for building relationships, influencing and successful agreement with senior level executives; build credibility, and work effectively with global matrix groups fostering collaboration and teamwork\nBusiness Value Chain and Opportunity assessment techniques and experience\nDomain knowledge in one or more relevant industries\nStrong knowledge of digital, machine learning, robotics, chatbots, bpm and other newer automation centric technologies\nDigital agency, consulting or entrepreneurial experience\nStrong understanding of user experience, technical & business issues\nEmphasis on user-driven product design and data-driven product refinement\nMaster’s degree or equivalent experience, advanced degree\nPreferred certification as a Green Belt Process Engineer or equivalent qualification\nProject Management certification and Agile experience\nInnovation mindset and savvy business and market acumen\nSharp analytical and problem-solving skills\nExhibit professionalism\nUp-to-date understanding of market trends and keen interest in following emerging technologies.\nEEO Statement\nAt Chubb, we are committed to equal employment opportunity and compliance with all laws and regulations pertaining to it. Our policy is to provide employment, training, compensation, promotion, and other conditions or opportunities of employment, without regard to race, color, religious creed, sex, gender, gender identity, gender expression, sexual orientation, marital status, national origin, ancestry, mental and physical disability, medical condition, genetic information, military and veteran status, age, and pregnancy or any other characteristic protected by law. Performance and qualifications are the only basis upon which we hire, assign, promote, compensate, develop and retain employees. Chubb prohibits all unlawful discrimination, harassment and retaliation against any individual who reports discrimination or harassment.\nWork Locations\nJersey City\nOther Locations\nUSA-New York-New York\nJob\nOperations & Customer Service\nTravel\nNo\nJob Posting\nAug 23, 2021, 3:44:04 PM", "employment_type": "FULL_TIME", "date_posted": "2021-08-24T01:16:32.000Z"}, "company": {"name": "Chubb", "link": "https://ch.linkedin.com/company/chubb"}, "education": {"required_credential": null}, "experience": {"months_of_experience": 48, "seniority_level": "Mid-Level"}}