{
    "job": {
        "title": "Data Engineer",
        "industry": "Information Technology and Services,Management Consulting",
        "description": "Technical Lead      Qualification      Bachelors in science , engineering or equivalent      Responsibility      Project Planning and Setup:     -  Understand the project scope, identify activities/ tasks, task level estimates, schedule, dependencies, risks and provide inputs to Module Lead for review.   \n  -  Provide inputs to testing strategy, configuration, deployment, hardware/software requirement etc.   \n  -  Review plan and provide feedback on gaps, timeline and execution feasibility etc as required in the project.   \n  -  Participate in KT sessions conducted by customer/ other business teams and provide feedback on requirements.         \nRequirement Understanding And Analysis     -  Analyze functional/non functional requirements and seek clarifications for better understanding of requirements.   \n  -  Based on understanding of system upstream & downstream, provide feedback and inputs on gaps in requirements and technical feasibility of requirements.         \nDesign     -  Prepare the LLD/ detailed design documents based on HLD and briefing from Module Lead.   \n  -  Seek inputs from the developers on specific modules as applicable.   \n  -  Consolidate all modules and provide to Module Lead/ Architects/ Designers for review.   \n  -  Suggest changes in design on technical grounds.   \n  -  Develop components inventory for the code to be developed tying it to the nonfunctional requirements.   \n  -  Perform sampling of data to understand the character/ quality of the data (project dependent in the absence of data analyst or designer).   \n  -  Identify tools and technologies to be used in the project as well as reusable objects that could be customized for the project.         \nCoding     -  Follow coding standards and best practices to develop code and check code quality.   \n  -  Share developed code with supervisor for review.   \n  -  Rework on the code based on inputs if required.   \n  -  Perform complex integration.   \n  -  Guide the developers in identifying, preparing and conducting unit test cases and fixing defects based on results.   \n  -  Consolidate the test results and share with supervisor.   \n  -  Provide periodic status update to supervisor and highlight / recommend any changes in design based on challenges faced.   \n  -  Anticipate unreported defects and raise the same to supervisor.   \n  -  Conduct technical troubleshooting.   \n  -  Conduct reviews for codes created by team.         \nTesting Management     -  Develop unit test case for each module.   \n  -  Conduct/ guide conducting of unit and integration testing and fix defects.   \n  -  Review/ approve code to be moved to testing environment.   \n  -  Provide support to the QA team and coordinate for various phases of testing.   \n  -  Address queries raised by QA within defined timelines.   \n  -  Investigate critical defects and establish need for fixing.   \n  -  Raise issues to leads/QA.   \n  -  Report defect status as per project standard process within agreed timelines.   \n  -  Share revised code with supervisor for review.   \n  -  Assist team lead and project manager on estimates around defect fixes.         \nConfiguration Management     -  Maintain versions of the code or consolidate version maintained by the Developers.   \n  -  Provide support as required to the Administrators during configuration, code backups, deployment etc.         \nDeployment     -  Assess and create deployment/ roll back plan.   \n  -  Validate if all the components have been migrated and the right version is checked in.   \n  -  Maintain deployment tracker.   \n  -  Perform sanity checks post deployment to ensure smooth production.   \n  -  Share activity status with supervisor and highlight concerns if any.      \nProject Execution Monitoring & closure (Support to Project Management activities):     -  Monitor work of the developers and share work achieved with them.   \n  -  Provide guidance through SDLC.   \n  -  Provide status of progress to leads.   \n  -  In case of change requests, provide inputs on the plan.         \nService Support And Maintenance      Specific to production and maintenance support:     -  Provide support for 1 week and hand over to production team.   \n  -  Identify if the incoming request is a service request/ defect during the warranty or an incident.   \n  -  If it is code defect in the warranty, highlight to Lead and initiate defect fix process.   \n  -  Post warranty, support in transition to maintenance team.         \nKnowledge Management     -  Post release participate in project review call and discuss points on what went well and what didn't.   \n  -  Create and update knowledge articles (case studies, lessons learnt) in the knowledge management repository.   \n  -  Guide developers in creating such documents.   \n  -  Publish white papers/ blogs/ articles (if required).         \nPeople Management     -  Conduct training through academy or internally within the team.   \n  -  Conduct technical, face to face interviews for internal transfer or external hiring.   \n  -  Provide feedback on Developers form technical /domain standpoint to the module lead.         \nMust Have Skills     - Amazon Web Services      \nEmployee Status : Full Time Employee      Shift : Day Job      Travel : No      Job Posting : Jul 19 2021      About Cognizant      Cognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 194 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @USJobsCognizant.      Cognizant is recognized as a Military Friendly Employer and is a coalition member of the Veteran Jobs Mission. Our Cognizant Veterans Network assists Veterans in building and growing a career at Cognizant that allows them to leverage the leadership, loyalty, integrity, and commitment to excellence instilled in them through participation in military service.      Cognizant is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.      If you have a disability that requires a reasonable accommodation to search for a job opening or submit an application, please email CareersNA2@cognizant.com with your request and contact information.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-20T05:54:23.000Z"
    },
    "company": {
        "name": "Cognizant",
        "link": "https://www.linkedin.com/company/cognizant"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Bellevue",
        "region": "WA",
        "postal_code": "98007",
        "street_address": null,
        "latitude": 47.6137,
        "longitude": -122.19093
    }
}