{
    "job": {
        "title": "Senior Software Engineers (RoR)",
        "industry": "",
        "description": "SENIOR SOFTWARE ENGINEERs (RoR) ZYMR Inc. has an immediate requirement to fulfill for our newest Customer. The project involves working with a fast-growing, tier-1, pre-IPO Silicon Valley Energy startup that was established almost 10 years ago and has raised more than $100M in funding so far.We are looking for experienced Ruby on Rails (Preferred), Django Platform Developers:Responsibilities and DutiesWrite platform code, services, and componentsDesign & develop microservices for componentsResponsible for design and implementation, test automation, and other SDLC activities.Gather and analyze requirements and convert them into concrete technical tasks with effort estimates.Cross-border project experience is a plus.Perform code reviews, test case reviews to meet high-quality standards. Qualifications and Skills6+ years building scalable applications with web frameworks like Ruby on Rails, Django, etc. (RoR preferred)6+ years experience with OOP design and building REST APIsProficient in designing microservices with containerization tools Docker and KubernetesExperience with UI frameworks like Angular or ReactJSStrong background in Data Structures and AlgorithmsExpert with Relational Databases, like MySQL or PostgreSQLExperience with Web Services (REST)Experience working in cloud environments, AWS preferredExperience with SOA & Event-Driven Architecture.Knowledge of Caching and Messaging technologies like Redis, RabbitMQ, Kafka.Experience with Linux development and runtime environmentsExperience with Agile / SCRUM methodology for product development (TDD, CI)Education: Bachelor’s in computer science or equivalent degree4+ years at any leading SaaS firm - experience with the energy domain a big plus.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-20T06:05:56.000Z"
    },
    "company": {
        "name": "Zymr, Inc.",
        "link": "https://www.linkedin.com/company/zymrinc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}