{"location": {"country": "US", "locality": "Emeryville", "region": "Emeryville", "postal_code": "94608", "street_address": null, "latitude": 37.8312, "longitude": -122.28581}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Jr. Software Engineer", "industry": "Automotive", "description": "EverCharge\nprovides advanced electric vehicle charging solutions powered by our SmartPower technology, which allows us to install 15x more stations while eliminating expensive infrastructure additions. In short, we can install more stations for less money, which furthers our mission to enable EV adoption for everyone!\nWe are looking to expand our Customer Support team to include talented, driven\nJr. Software Engineer\ninterested in applying creativity and a broad skill-set toward building an industry-leading car charging system.\nWhat will you be doing?\nYou will work independently on architecture, design, implementation, and testing of new systems in a rapidly evolving environment.\nDevelop components of our charger management dashboard tool in Python.\nDesign and implementation of RESTful services.\nWho are we looking for?\nMust have strong writing skills.\nExtremely proficient in Linux shell.\nGreat engineering skills\nStrong software design fundamentals - object-oriented design experience.\nExperience building solutions on PostgreSQL.\nMust be highly self-motivated and effectively manage time and prioritizes tasks, be proactive and thrive in a busy environment.\nIn exchange for your hard-work and success you will have access to our generous benefits offerings, making our total compensation package pretty outstanding! At EverCharge, you will be offered:\nHealth insurance (100% employer paid option)\nDental\nVision\nHealth, Dental, Vision coverage options for your dependents (employee cost)\nFlexible Spending Account (FSA) option\n401k retirement\n10 paid holidays\nUnlimited/Flexible Paid Time Off\nQuarterly \"Virtual Happy Hour\" and team-building activities.\nEverCharge, Inc. prohibits discrimination and harassment of any type and affords equal employment opportunities to employees and applicants without regard to race, color, religion, sex, sexual orientation, gender identity or expression, pregnancy, age, national origin, disability status, genetic information, protected veteran status, or any other characteristic protected by law.\nNo third-party solicitation. Candidates must apply directly to the job posting.", "employment_type": "FULL_TIME", "date_posted": "2021-08-13T05:22:38.000Z"}, "company": {"name": "EverCharge, Inc.", "link": "https://www.linkedin.com/company/evercharge"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}