{"location": {"country": "US", "locality": "Dover", "region": "Dover", "postal_code": "19901", "street_address": null, "latitude": 39.15883, "longitude": -75.52114}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Senior Software Engineer – Java EE", "industry": "Information Technology and Services,Computer Software,Computer Networking", "description": "Job Title: Senior Software Engineer – Java EE\nLocation: Milwaukee, WI (Onsite from Day 1)\nType: Long Term Contract\nKey Responsibilities\nContribute to software design and architecture, including design reviews\nDevelop high-quality code along with automated unit tests for cloud-based and self-hosted SaaS products\nContribute to integration, system, and performance testing, including test tools\nTake ownership as a highly motivated member of a scrum team\nAssist with troubleshooting customer problems and finding solutions in a timely fashion\nWrite test cases within an automated test framework for development projects\nWork within a Scrum environment to plan and deliver incremental software in defined sprints\nBuild strong partnerships with UX designers, Software Developers, and Product Managers\nDevelop software with Java EE for projects\nProvide technical support to customers on-site\nTrain customers and key-users on installed applications\nMaintain excellent relationships with all internal and external customers through provision of high-quality service\nWork within an Agile environment\nTravel to site during software commissioning phases to ensure that integration testing and site acceptance testing is completed as required\nPerform presentation(s) of complex technical findings and developments to internal and external customers\nDesign database schemas and contribute to database performance tuning\nProvide mentorship and training to software team\nTravel is approximately ~30%\nEducation And Knowledge\nBachelor’s degree in Computer Science, Computer Engineering or Software Engineering\nMaster’s degree in Computer Science, Computer Engineering or Software Engineering Preferred\nTen or more years in software development\nExpert in minimum of 3 object-oriented languages\nExpert knowledge of at least 2 operating systems\nKnowledge and/or experience with concurrency and/or scalability\nExpert knowledge of Relational Databases\nExperience with web-based development for Java applications\nSoftware Methodologies: Agile / Scrum\nPreferred Skills\nExperience with Tomcat.\nExperience with JQuery, Bootstrap/AngularJS, JSF, Hibernate, Git, and Apache Ant.\nExperience with Spring/Struts frameworks, RESTful services.\nExperience working in a large, enterprise environment.\nlogistics industry experience\nYou can apply via: http://jobd.info/?id=vzGmwz\nRecruiter Details\nPraveen Rao\n(302) 214-0551\npraveen_us@falconsmartit.com\nFind all current job openings at our Career Page\nhttps://www.falconsmartit.com/FalconCareer.html\nFollow us on LinkedIn for Job Opportunities\nhttps://www.linkedin.com/company/falconsmartit/", "employment_type": "FULL_TIME", "date_posted": "2021-08-20T22:42:26.000Z"}, "company": {"name": "Falcon Smart IT (FalconSmartIT)", "link": "https://uk.linkedin.com/company/falconsmartit"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 120, "seniority_level": "Lead"}}