{
    "job": {
        "title": "Open Source Intelligence Analyst",
        "industry": "Information Technology and Services,Defense & Space,Computer Software",
        "description": "Job Number: R0113038Open Source Intelligence AnalystThe ChallengeCritical decisions are made every single day in our government and military. What if you could use your analytical skills to help them make informed decisions? With all the information available today, it takes a skilled analyst to know how to find and interpret the best data to give their clients the right answers. As an OSINT analyst, you use your specialized language skills, regional and functional knowledge, and your client engagement skills to develop cutting edge research and analysis methods, intelligence products, and analytic assessments to give your client the actionable skills to support our warfighters, protect our national security, and inform our nation’s leaders.As an OSINT analyst on our team, you’ll help your client understand mission environment. Using your understanding of various collection and analyst platforms, you’ll explore new data sources, build effective queries, and combine information from disparate sources. You’ll validate information and apply client tradecraft as you contribute to assessments for senior policymakers. As the authority on your functional and regional area, your client will look to you for timely, critical recommendations, often under pressure. This is a chance to grow your expertise, develop new skills in OSINT and advanced analytics and share your methodologies with other analysts. We focus on growing as a team to deliver the best support to our customers, so you’ll have resources for mentoring and learning new skills and tools. Join us as we provide the right information at the right time to support the critical needs of our warfighters, nation’s leaders, and policy makers.Empower change with us.You Have3+ years of experience with open source systems, tradecraft, and methodologies to conduct research, collection, or analysisKnowledge of advanced internet-based research, including Boolean logic, advanced research techniques, search engine and databaseresources, and resource validationActive TS/SCI clearanceBA or BS degree in International Relations or Security StudiesNice If You HaveExperience as a strategic all-source analyst, data scientist, or research assistantExperience with collaborating in multi-functional analytic teamsMA or MS degreeOSINT CertificationClearanceApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; TS/SCI clearance is required.Build Your CareerAt Booz Allen, we know the power of analytics and intelligence. When you join Booz Allen, we’ll help you develop the career you want.Challenging projects – Whether training analysts on military equipment through VR technology; developing a simulation capability to allow teams to rehearse missions together; or integrating RFID tags into mobile devices to enable data access within a geo parameter, you’ll get to solve some of the world’s toughest problemsMeaningful work – Use your skills to empower change. Your work will keep citizens and warfighters safe and well both at home and abroadState-of-the-art technology – Broaden your intelligence capabilities with digital forensics, telematics, precision navigation, secure mobile operations, and advanced analyticsNew skills – In-house experts and partnerships with tech leaders, like Nvidia and Splunk, mean you can get practical experience with advanced GPU technologies, cyber security, and data scienceRoom to grow – You’ll be inspired to grow your career while making your ideas a reality thanks to new opportunities across the U.S. and abroad, encouraging mentors, and collaborative colleaguesWe’re an EOE that empowers our people—no matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, veteran status, or other protected characteristic—to fearlessly drive change.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-20T06:11:52.000Z"
    },
    "company": {
        "name": "Booz Allen Hamilton",
        "link": "https://www.linkedin.com/company/booz-allen-hamilton"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Washington",
        "region": "DC",
        "postal_code": "20398",
        "street_address": null,
        "latitude": 38.892063,
        "longitude": -77.01991
    }
}