{"location": {"country": "US", "locality": "San Francisco", "region": "San Francisco", "postal_code": "94121", "street_address": null, "latitude": 37.78008, "longitude": -122.42016}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Director of Engineering, Autolist", "industry": "Marketing and Advertising,Computer Software,Internet", "description": "About Autolist\nFor most people, shopping for a vehicle is an experience we'd rather forget. Navigating a sea of endless options, spending hours, and the dealership and negotiating toe-to-toe with a dealer who does all this every day leaves automotive shoppers feeling exhausted and overwhelmed while hopeful, but not sure, they got a vehicle in good condition for a fair price.\nAutolist is on a mission to rewire the automotive industry by making it easier for everyone to find and get a vehicle they love! We are creating an automotive shopping experience for every stage of the automotive life cycle - buying, selling, owning - and we're well on our way. As an independent brand and subsidiary of CarGurus (NASDAQ: CARG) we're a startup within the worldwide category leader in automotive shopping helping millions of monthly users via our award-winning apps and web shopping platforms. Our efforts to streamline the automotive shopping experience is supported by a strong passion to empower people with the knowledge and experience they need for everything automotive, a dedication to equity, inclusion, and belonging, and world-class benefits.\nWhat You'll Do\nAs the\nDirector of Engineering Manager\nat Autolist you will provide managerial and technical leadership in a lean, fast-paced, data-driven environment. You will be deeply engaged in the leadership of the company, our culture, product strategy, technical strategy, and more. You will work alongside our engineers and managers to deliver great products and support the full development lifecycle discovering, designing, developing, testing, deploying, maintaining, observing, and improving our software.\nYou will own the success of our engineers in developing their careers as well as executing on products. You will be hands-on and collaborative with fellow engineers, analysts, designers, product, and business partners as you solve exciting problems with real impact at scale.\nThis role will report to the General Manager of Autolist and be a member of the Autolist Leadership Team.\nResponsibilities\nManage a growing organization with 3+ engineering managers and 15+ engineers\nLead recruiting efforts to thoughtfully grow the team\nMentor and motivate the engineering team, contributing to the career development of others\nLead the technical strategy and setting of standards, technical vision, and culture\nSupport the teams to prioritize and scope engineering investments\nAssist in the delivery and maintenance of products: write code, perform code reviews, and define best practices\nEliminate roadblocks, and make sure each team member has everything to achieve their full potential\nActively drive the development of the Autolist culture\nPartner with product, business, and design teams to implement disruptive consumer features\nTake an active role in the day to day operations of the engineering team\nOwn goals, deadlines, and be a partner in company-wide strategic planning\nKeep the team focused on the highest-impact tasks and projects\nProvide an open and friendly line of communication for engineers to voice their success and concerns\nMake sure the engineers' experience at Autolist is a positive one\nServe as a link between engineering, the executive team, and HR, to help the engineers be successful\nInspire engineers to follow and refine best practices\nWhat Success Looks Like\nSuccess of Engineering direct reports\nTimely and impactful delivery of products and projects\nAchievement of company goals and objectives\nThe growth and career development of Autolist engineers\nCommunicating with General Manager, engineering managers, and other related executives, and HR, early and often about engineers' successes and concerns\nDeveloper Happiness\nEnsuring our technology is built in a way that supports achieving our product and business goals in a timely manner, without putting an impractical burden on future development efforts.\nWho You Are\nResults-oriented, proven technical leader\n10+ years of software development experience\n4+ years of management experience\n2+ years managing engineering managers\nExpertise with both dynamic/interpreted (Javascript, Ruby, Python) and compiled (java, kotlin) languages\nExperience with a modern Javascript framework like Next.js, React, Redux\nPolyglot engineer comfortable with full stack web development\nStrong understanding of Postgres or similar relational databases\nStrong understanding of Elasticsearch\nExperience maintaining Cloud infrastructure (AWS, GCP, or equivalent) and familiarity with DevOps tools (Terraform, AWS CloudFormation, Ansible)\nExpertise in maintaining Kubernetes clusters\nUnderstanding of how to build high-performance web applications\nAble to conceptualize, develop, test, and release product\nDrawn to and thrive in a fast-paced environment that pushes high-quality code continuously\nAble to work independently, as well as collaboratively\nNote: The requirements listed on this job description are guidelines not hard and fast rules. To excel in this role you will not need to satisfy or meet every requirement listed. If you have the transferable skills and want the opportunity to be considered – please apply!\nBonus\nHave worked in a pair-programming environment\nAn interest in exploring code design and architecture\nHave used test-driven development (TDD) extensively\nExperience building consumer-facing applications\nExperience of working with the auto industry\nPractical experience of a range of agile development methodologies\nExperience building metasearch products\nSecurity chops (JWT, HMAC, CSP, cryptography)\nPerformance chops (CWV, CRP, PWA, LnP)\nAndroid and/or iOS experience\nM.S. or PhD in Computer Science or related field\nEqual Opportunity Statement\nAutolist is an equal opportunity employer. We believe that everyone should receive equal consideration and treatment. Recruitment, hiring, placements, transfers, and promotions will happen based on qualifications for the positions being filled regardless of sex, gender identity, race, religious creed, color, national origin ancestry, age, physical disability, pregnancy, mental disability, or medical condition.\nCheck out this link to learn more about our engineering team: https://www.autolist.com/engineering", "employment_type": "FULL_TIME", "date_posted": "2021-08-27T05:25:15.000Z"}, "company": {"name": "CarGurus", "link": "https://www.linkedin.com/company/cargurus"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 120, "seniority_level": "Lead"}}