{
    "job": {
        "title": "Principal Software Engineer (Ecommerce)",
        "industry": "Internet",
        "description": "This direct hire role will be focused on ecommerce retail applications utilizing technologies including React JS, Elixir and Kafka, among others. Successful candidate will need to have experience architecting and building out a related ecommerce application environment. This person can be based anywhere in the United States but work schedule is Pacific time zone. The client's HQ location is in the Bay area in California.As a Principal Software Engineer, you’ll spend about 40% of your time on application architecture, mentoring, thought leadership, and guiding teams around the company as they establish or update best practices for software development. You’ll participate in guild (community of practice) meetings, architecture review sessions, organize training for engineers, and otherwise help ensure that we maintain a cohesive and modern technology vision while still empowering teams to move fast. You’ll partner with senior technical leadership to establish north stars of our technology vision. You’ll represent the company at conferences and other speaking engagements from time to time. The other 60% of your time, you’ll dive in and actively develop that future! You’ll typically start the work on some of our most challenging projects, laying out the foundational architecture and actively contributing code. In most cases, you’ll bring in other engineers from around the company as these initiatives grow, eventually handing it off to Staff Engineers as you go on to tackle the next challenge.Some upcoming projects you’ll be involved in:Upgrades to our inventory & catalog system as we transition from a single-SKU model to allow for depth and variantsAssisting with the strategy as we continue to break apart our existing ruby on rails monolith into servicesPreparation and design for future international expansionImprovements to our payout processesWhat You Get To Do Every DayPropose and build technical architecture and solutions to move our business forwardAdvise and collaborate with senior engineering leadership on technical vision and strategy across a multi-year timeframeBuild a deep understanding of The RealReal’s business model, opportunities, and challengesProvide technical direction and mentorship for engineers across the organizationDrive build vs buy evaluations, including research and initial assessment with vendorsAssist in coordinating cross-team engineering efforts and determining technical requirementsReview technical architecture proposals and pull requests and provide constructive feedbackProduce high-quality, performant, testable code, and systemsDocument architecture and processes, and uplevel them across the companyRepresent the company at conferences and other events, helping us to build brand awareness and attract talentWhat You Bring To The Role10+ years of professional web application/full-stack development experience2+ years leading a high-performance engineering team or organization, in a fast-paced environmentFluency with any of React JS, Elixir, Erlang, or another object-oriented or functional programming languageStrong understanding of distributed systems and architectureStrong understanding of web technologies: HTML5, Javascript, CSS/SASS, REST, JSONStrong understanding of web-app performance fundamentals and related dev toolsStrong database fundamentals and experience with MySql or PostgreSQL; AWS Dynamo DB a plusExperience using async message queues such as Kafka or KinesisMastery of Git and Github workflowsExperience with Microservices architectureBachelor of Computer Science degree or equivalent experienceExperience building E-commerce, Operations, and Logistics applicationsNice to HavesExperience with Headless E-commerce APIsExperience working with machine learning or related technologiesExperience with iOS/Android and mobile developmentExperience with GraphQLExperience with Docker and KubernetesJob Type: Full-timePay: $175,000.00 - $200,000.00 base per year, plus bonus, plus equity",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-21T01:54:36.000Z"
    },
    "company": {
        "name": "TriSearch",
        "link": "https://www.linkedin.com/company/tri-search"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}