{"location": {"country": "US", "locality": "Green Bank", "region": "Green Bank", "postal_code": "24944", "street_address": null, "latitude": 38.4192, "longitude": -79.83102}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer II-IV  (Open Rank)", "industry": "Government Relations", "description": "SOFTWARE ENGINEER II-IV (OPEN RANK)\nPOSITION SUMMARY\nWe are seeking an experienced software engineer to join the\nGreen Bank Observatory (GBO)\nSoftware Development Division (SDD). The division’s primary focus is maintaining and upgrading the subsystems supporting the operation of the Robert C. Byrd Green Bank Telescope. The major subsystems include: telescope monitor and control, telescope scheduling, data reduction, and data archiving. The team also develops new software to meet challenges posed by new observing paradigms and state of the art instrumentation.  Job classification and compensation will be commensurate with education and experience. The position is based at the GBO in Green Bank WV. Requests for occasional telework may be considered.\nIn addition to competitive pay, GBO provides excellent paid time off benefits (vacation and sick leave). Medical, dental and vision plans are effective first day of employment. GBO’s retirement benefit contributes an amount equal to 10 percent of a qualified participant’s base pay. No contribution is required of the employee; we also offer an optional supplemental, tax-deferred plan for employee retirement contributions.\nESSENTIAL DUTIES AND RESPONSIBILITIES\nUsing prescribed methods, researches, conducts or coordinates detailed phases of software engineering work as assigned. Performs work that involves conventional software engineering practices.  The successful candidate will collaborate with members of the Software, Electronics and Science Divisions to contribute to full life cycle development of systems-oriented applications supporting GBO operations. Opportunities exist to develop software in other radio astronomy-related domains including embedded systems, FPGA systems, and machine learning.\nDesigns, develops, implements, and supports mission critical software applications and mechanical control systems with minimal supervision.\nParticipates in documentation, installation, testing, maintenance support and further development of software subsystems within established standards.\nWorks with other software engineers, electronics engineers, and scientists to identify and solve problems.\nAssists in preparing costs and time analyses of projects. Makes recommendations for procedures, equipment purchases, and other improvements.\nProactive compliance with Observatory and government safety policies and procedures in own work area is expected.\nOther duties as assigned.\nPosition Requirements:\nMinimum Education:\nBachelor’s degree in computer science, electrical engineering, or related field.\nPreferred Education:\nAn advanced degree is highly desired.  Scientific degree or background in astronomy is also desirable.\nMinimum Experience:\nThree to five years previous related work experience is required. Candidates with over five years of related experience developing and supporting complex applications may be considered for a Software Engineer IV position.\nRequires the use of PCs, workstations, and software packages. Must be familiar with standard software engineering concepts, practices and procedures through academic training and formal work experience.  Requires strong interpersonal and communications skills.\nRequired Technical Experience:\n- Object-oriented design and development with C++.\n- Experience with software engineering for mechanical control systems.\n- Python application development.\n- Digital signal processing\n- Experience implementing and integrating algorithms on Graphical Processing Units (GPUs) using CUDA or an equivalent.\n- Linux application and device driver development; good knowledge of systems level and real-time Linux.\n- Real-time computing principles with application to real-time Linux extensions or frameworks (e.g. RTAI or Xenomai).\n- Software architecture\n- Computer architecture including multi-threading and multi-core, memory management, and hardware interfaces.\n- Networking and socket programming (e.g., ZMQ, RPC, sockets, etc.).\n- Experience debugging medium-to-high complexity software/hardware systems.\n- Ability to clearly convey technical information to developers, engineers and scientists, interact with peers in a positive and respectful way and calmly resolve conflicts.\nDesired Technical Experience:\n- Experience developing software architectures\n- Bash or other scripting languages\n- C#\n- Embedded and real-time systems\n- Version control software\n- Agile methodology\n- Unit testing and continuous integration\nJob title and compensation will be commensurate with education and experience.\nApplication Instructions:\nApply online at the Associated University Inc. / Green Bank Observatory Careers page; upload CV/Resume and letter of interest.\nAUI is an equal opportunity employer (M/F/D/V)\nPM20", "employment_type": "FULL_TIME", "date_posted": "2021-08-17T07:32:17.000Z"}, "company": {"name": "National Radio Astronomy Observatory", "link": "https://www.linkedin.com/company/national-radio-astronomy-observatory"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}