{"location": {"country": "US", "locality": "Pleasanton", "region": "Pleasanton", "postal_code": "94588", "street_address": null, "latitude": 37.658436, "longitude": -121.877}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Analyst (Growth)", "industry": "", "description": "About Cheetah\nRestaurants and small businesses account for hundreds of billions of dollars in annual\npurchasing, yet most of it happens offline. From the humblest NYC slice and a cup of joe to\nmuseum-quality lattes (and yes, avocado toast), each order represents a long paper trail and a\nseries of truck deliveries.\nWith a rapidly growing market presence, Cheetah is already streamlining the daily workflow of\nhundreds of restaurants and small business owners. Using Cheetah’s services, they manage\nmillions of dollars in monthly purchasing, while Cheetah eliminates the burden of costly sales\nreps and inflexible, inefficient distribution centers. Partnering with the largest suppliers in the\nUS, Cheetah is bringing the Silicon Valley user experience to an industry that hasn’t evolved in\ndecades. In the process, we’re helping to reintroduce the small business owner to the small\nfarmer, global supply chains to familiar faces, and delivery and logistics workers to increased\nmobility and new opportunities.\nAt Cheetah, a relentless executive team has set out to change this reality, armed with deep\nindustry and entrepreneurial experience, personal conviction, and $70M in funding from\nEclipse, Floodgate, and the early backers of Facebook, Lyft and Airbnb.\nUnencumbered by the old-school business models and practices, Cheetah has introduced\nunprecedented transparency in pricing and inventory to the SMB marketplace. In doing so,\nCheetah allows the people who form the backbone of local economies to focus on what they\nlove: cooking great food and providing excellent service. From the convenience of their phones,\nbusiness owners can now order whatever they need, discover new, rare or seasonal specialty\nproducts, and prioritize their customers. No more rushing to unload your double-parked van, or waiting anxiously for a truck to show up with your weekly allotment of boxes.\nData Analyst (Growth)\nCheetah is looking for a data analyst with experience in market growth and customer\nbehavior analytics. This function is vital to the long-term success of the company and\nenables Cheetah to meet the needs of existing customers while also\nidentifying/prioritizing new markets and cuisines. In this role, you will dive into data\nranging from event-based app usage to item-level order details and extract behavioral\npatterns. You’ll define core growth KPIs (e.g. retention, basket penetration, etc.) and\nset up tools to track them. You’ll work closely with a range of stakeholders, from\nMarketing/Sales to Procurement to executive management.\nResponsibilities\nDefine and collect relevant data to perform further analyses on growth opportunities.\nApply data and analytic skills to help understand how customers use our products – e.g. learning how to extract deep interests and tendencies from event streams.\nDrive cohort analyses to understand customer behavior and identify opportunities for improving our product(s), customer retention and churn.\nWork with the sales team to identify and prioritize customer leads in light of market location and cuisine, and work with the supply chain team to ensure we have sufficient inventory for new customers.\nWork with the executive team on seeding markets for expansion, identifying the key targets / geographies.\nCollaborate with data and business intelligence teams to develop reports and visualization dashboards.\nBuild financial models to project key business metrics - traffic, conversion, engagement - and develop KPIs to track performance.\nQualifications\n3+ years of professional experience in business or product analytics, or comparable position, handling large, complex, human behavior data sets.\nProven track record in solving business problems using data-driven and scientific methods.\nExperience using SQL to access and analyze data. Strong data visualization and Python/R skills are a plus.\nUnderstanding of statistics, e.g., hypothesis testing, etc.\nStrong speaking, writing, and presentation skills, as well as the ability to persuade, inspire, and motivate others.\nMust have the ability to summarize key insights for both technical and non-technical audiences.\nBenefits and Perks\nFlexible working schedule / location\nCompany happy hours, team building events, and intramural sports teams\nUnlimited paid time off\nComprehensive medical/dental/vision insurance and commuter benefits\n401(k) plan and flexible spending benefits\nThe opportunity to work alongside a visionary team during Cheetah’s rapid growth!", "employment_type": "FULL_TIME", "date_posted": "2021-08-20T22:36:14.000Z"}, "company": {"name": "Cheetah", "link": "https://www.linkedin.com/company/gocheetah"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}