{
    "job": {
        "title": "Embedded Software Engineer",
        "industry": "Computer Software",
        "description": "Embedded Software EngineerREQ-119091&amp;nbsp;EngineeringPalo Alto, CA, United States      About Yo Labs:Technology has changed daily life in a way no one could have imagined.&amp;nbsp;It’s made us more productive, capable and connected.&amp;nbsp;But it has come at a cost.&amp;nbsp;We’re productive, but overwhelmed.&amp;nbsp;Capable but paralyzed by too many choices.&amp;nbsp;Connected, but only if social media counts.&amp;nbsp;Living this way creates a void in our daily lives.&amp;nbsp;Yo Labs is here to change that.&amp;nbsp;Our team is committed to alleviating the mental load that our modern world has created by putting human connection back into technology and caretaking at the heart of everything we create.   What You’ll Get to Do:You will work in a small team of device software engineers to build new IoT enabled devices. You are expected to be a hands-on tech lead with demonstrable experience in leading small teams (or large complexity components) who excel in a dynamic, fast-moving, and agile environment building high quality, high performance and scalable software. You will be expected to work equally between design, hands-on development, and providing mentorship to other developers within the organization. You should have experience leading the development of embedded device software on RTOS or Linux class devices. This engineer should have deep experience with all aspects of embedded platform software including boot loaders, kernels and several related device drivers. This engineering tech lead also requires a solid understanding of embedded security, IP networking protocols and will be expected to implement rapid prototypes on a variety of hardware. An understanding of factory processes and related security would be a plus. You should also have a demonstrable track record of working closely with mobile apps, services and PM teams with high quality products that have already launched.  - Build robust and scalable embedded device side software with trusted security   \n  - Independently plan software milestones and release schedules   \n  - Design, develop, test, deploy and maintain device IoT software in the field   \n  - Collaborate with other engineering teams, PM and UX teams   \n  - Tech Lead, may coordinate a small team of engineers while mentoring others   \n   What You’ll Bring:Education & Experience:  - Preferably &amp;gt; 10 years experience building embedded software with C, C++, Java, Python   \n  - Evidence of architectural or design influence on embedded platform design   \n  - Demonstrable, high quality, feature rich product launches   \n  - Track record of working successfully with cross-functional teams   \n  - Proven track record of shipping high quality products in volume   \n  - Excellent communication and collaboration skills   \n  - Excellent problem solving and analytical thinking skills   \n   What We Offer:  - Competitive compensation package   \n  - Comprehensive benefits   \n  - Pet Insurance   \n  - Paid Parental Care Leave   \n  - Flexible Work Program   \n  - Volunteer time Off   \n  - Total Well Being Program",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-22T01:38:26.000Z"
    },
    "company": {
        "name": "Yo Labs",
        "link": "https://www.linkedin.com/company/yo-labs"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": "Senior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Palo Alto",
        "region": "CA",
        "postal_code": "94310",
        "street_address": null,
        "latitude": 37.445103,
        "longitude": -122.16036
    }
}