{"location": {"country": "US", "locality": "Los Angeles", "region": "Los Angeles", "postal_code": "90101", "street_address": null, "latitude": 34.05224, "longitude": -118.24335}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Remote - Sr. Frontend Software Engineer (Angular)", "industry": "Computer Software", "description": "If you are a Remote - Sr. Frontend Software Engineer (Angular) with experience, please read on!\nFounded by the same folks behind Cameo and Twitter, our founders were medical students looking for a more unconventional study method. They created an online learning platform that helps medical students study and learn in a more engaging and fun way! Since 2012, we have experienced steady growth and are well-funded, but we aren't done yet. That's where you come in...\nWe are looking to continue our growth this year by adding members to our Frontend, Backend, and Data Engineering Team. A company that tries to break the norm and add excitement to learning, we offer an amazing company culture, full benefits, work-from-home office, career growth opportunities, and competitive compensation. If you are a strong Frontend Engineer with Angular experience and enjoy working on web applications that help our users learn in a more exciting way, this is the position for you!\nWhat You Will Be Doing\nThis position will be focused on creating a comprehensive and feature-rich web application utilizing Angular.\nDesign, build, and scale sophisticated web components and interfaces\nCreate and develop technical designs for features and overall web application\nCollaborate with other departments (UI, UX, Product, etc.)\nWrite Unite, Integration, and E2E tests while advocating Test-Driven Development\nWhat You Need for this Position\nBachelor's Degree Preferred\n3+ Years of professional experience using Angular on web applications\nExperience with HTML, CSS, and JQuery,\nExperience with Unit Testing and Test-Driven development (TDD)\nOur Tech Stack is a combination of Java, Ruby, Angular, and SQL\nWhat's In It for You\nGreat company culture\nWork from home!\nAmazing/Generous compensation package\nGenerous PTO\n401(k)\nFull Benefits\nMore!\nIf you're interested, please email Justin.Johnson@cybercoders.com\nEmail Your Resume In Word To\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nNitu.Gulati-Pauly@CyberCoders.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : JJ5-1638074 -- in the email subject line for your application to be considered.***\nNitu Gulati-Pauly - VP of Recruiting - CyberCoders\nApplicants must be authorized to work in the U.S.\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\nYour Right to Work\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\nCyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.", "employment_type": "FULL_TIME", "date_posted": "2021-08-25T17:35:42.000Z"}, "company": {"name": "CyberCoders", "link": "https://www.linkedin.com/company/cybercoders"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}