{"location": {"country": "US", "locality": "San Francisco", "region": "San Francisco", "postal_code": "94121", "street_address": null, "latitude": 37.78008, "longitude": -122.42016}, "salary": {"currency": "USD", "min_value": 116000, "max_value": 198000, "unit": "YEAR"}, "job": {"title": "Data Scientist, International Payments", "industry": "Computer Software,Internet,Financial Services", "description": "Company Description\nSquare builds common business tools in unconventional ways so more people can start, run, and grow their businesses. When Square started, it was difficult and expensive (or just plain impossible) for some businesses to take credit cards. Square made credit card payments possible for all by turning a mobile phone into a credit card reader. Since then Square has been building an entire business toolkit of both hardware and software products including Square Capital, Square Terminal, Square Payroll, and more. We’re working to find new and better ways to help businesses succeed on their own terms—and we’re looking for people like you to help shape tomorrow at Square.\nJob Description\nThe Payments Product team manages Square's flagship product. We are stewards of Square's largest product, making it possible for any seller to easily take a credit card payments. Our product drives awareness of the Square brand, is Square's first touch-point with most of our sellers, and fuels the economics of the broader Square ecosystem. Our sellers have evolving needs and expectations, and it is our job to understand who they are and how we can best help them.\nPayments Product's International Team will launch and grow our payments business in all international markets. We are focused on customizing and localizing our payments offering to tailor the needs and customs of each market. You will work with both our product and go-to-market (GTM) teams to help them make data-based decisions, while reporting into a Senior Manager on the Data Science team. You and your team will prioritize and set product and GTM road maps. Sound like you? Read on.\nYou Will\nPartner with Square's product, engineering, design, marketing, and finance teams to make decisions using a diverse set of tactics, including statistics, quantitative reasoning, and machine learning.\nIndependently research questions related to our most important product experiences and produce recommendations for peers and leadership.\nDesign, run, and analyze experiments with the goal of optimizing acquisition, activation, and retention measurements\nCommunicate analysis and decisions to peers and leadership in verbal, visual, and written media.\nBuild self-service data tools that allow us to monitor the health and performance of our primary business.\nDemonstrate data best practices and be an advocate for a data-driven culture across Square.\nYou Have\nQualifications\nA degree in Mathematics, Statistics, Computer Science, Economics, or a related quantitative field\n3+ years industry experience in data science roles (with either a growth or product focus)\nExperience designing and analyzing A/B experiments\nFamiliarity with ETL development and best practices\nExperience communicating analysis and decisions to peers and leadership in verbal, visual, and written media\nExperience working embedded within a growth or product team\n[Bonus] Experience applying both data-backed heuristics and machine-learning techniques to solve personalization and recommendation problems\n[Bonus] Experience in the payments or FinTech space\nTechnologies We Use And Teach\nSQL (Snowflake, BigQuery), Airflow, and Looker\nGoogle Cloud Platform and AWS\nPython and R\nMachine learning and statistical modeling frameworks\nAdditional Information\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Square is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, veteran status, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible.\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, assessing candidates in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.\nPerks\nAt Square, we want you to be well and thrive. Our global benefits package includes:\nHealthcare coverage\nRetirement Plans\nEmployee Stock Purchase Program\nWellness perks\nPaid parental leave\nPaid time off\nLearning and Development resources\nSquare, Inc. (NYSE: SQ) builds tools to empower businesses and individuals to participate in the economy. Sellers use Square to reach buyers online and in person, manage their business, and access financing. Individuals use Cash App to spend, send, store, and invest money. And TIDAL is a global music and entertainment platform that expands Square's purpose of economic empowerment to artists. Square, Inc. has offices in the United States, Canada, Japan, Australia, Ireland, Spain, Norway, and the UK.", "employment_type": "INTERN", "date_posted": "2021-08-24T18:24:26.000Z"}, "company": {"name": "Square", "link": "https://www.linkedin.com/company/joinsquare"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}