{"location": {"country": "US", "locality": "Reston", "region": "Reston", "postal_code": "22096", "street_address": null, "latitude": 38.960186, "longitude": -77.3545}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer", "industry": "Information Technology and Services,Computer Software,Financial Services", "description": "Projects The Candidate Will Be Working On\nProvide support for production AWS cloud environments for a state government customer.\nIdeal Background\nHealthcare is a plus, but the ideal background is several years experience working in AWS supporting production workloads.\nTeam And Team Size\nCurrent team is 8 members with a mixture of people being on and offshore. All the team members are DevOps engineers that are supporting the production environments.\nTop Responsibilities\nWork closely with the product support teams to be able to troubleshoot production issues.\nBe able to deploy new releases or hotfixes to a Linux environment\nAble to create new automation jobs to assist with common tasks.\nBe able to manage an Oracle database so that new scripts can be run against it as well as perform ad-hoc queries\nAbility to manage users/role on AD, Oracle Database, Operating System\nAbility to triage infrastructure issues on Prod.\nSupport all production services (o EC2, EBS, S3, EFS, Cloudfront, WAF, ALB, SecretsManager,Cloudtrail, Cloudwatch, DynamoDb, Redis, SQS, SES, SNS, IAM, Inspector, Gaurdduty, Workspaces, Certificate Manager, DIrectory Services, Lambda, AWS Batch, Step Function, VPC, SG, NACL, Disaster Recovery, KMS, Oracle)\nSkills/attributes Required\nLinux hands on, comfortable with command line (3+ years)\nAWS management (3+ years)\nOracle (2+ years)\nSkills/attributes Preferred\nThe more experience with AWS setting up and managing services the better.\nWorking Time\nAbility to work night shifts would be ideal.\nInterview Process\nHow many rounds? 2 - 1 technical, 1 manager\nVideo, phone, or in person? Video/phone\nHow technical will the interviews be? Very", "employment_type": "FULL_TIME", "date_posted": "2021-08-03T00:01:13.000Z"}, "company": {"name": "Horizontal Talent", "link": "https://www.linkedin.com/company/horizontal-talent"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}