{"location": {"country": "US", "locality": "New York City Metropolitan Area", "region": "New York City Metropolitan Area", "postal_code": "10021", "street_address": null, "latitude": 40.748295, "longitude": -73.98556}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Machine Learning Engineer", "industry": "Computer Software,Consumer Services,Information Technology and Services", "description": "About the job\nWe are a hyper-growth eCommerce start-up with a mission to bring a smile to people's faces by connecting them to products that bring nourishment, love, memories, connection, nostalgia, and comfort. We've recently closed our Series C funding for $110M and are looking to scale our AI & Data practice.\nWe are looking for a top Machine Learning Engineer to join our team in New York. You will be joining a small team of experienced ML engineers and have the opportunity to learn and have a significant impact on mission critical projects. The team is building deep learning models for RecSystems, Personalization, and Search functionality.\nCore Responsibilities\nCollaborate with cross-functional teams of data scientists, data engineers, software engineers, and machine learning engineers.\nResearch and implement best-in-class ML approaches to e-commerce problems.\nDevelop a deep subject matter expertise of how our marketplace functions across the entire user journey\nOwn and iterate upon our various recommendation , personalization, and search engines.\nOversee end-to-end model lifecycle development\nDeploy ML models into production\nDrive meaningful ROI and impact upon our full funnel acquisition and retention\nBasic Qualifications\nB.S. in a quantitative field i.e. Computer Science, Engineering, Physics, Mathematics, etc.\n1-5 years of experience building production level Machine Learning models\nExcellent programming and debugging skills in Python\nExperience with deep learning frameworks & libraries i.e. PyTorch, Tensorflow, etc.\nStrong ML background in at least one of the following areas: NLP, Search, recommendation, personalization, ranking/relevance, etc.\nNice to Have:\nAdvanced Degree in a quantitative field (M.S. / Ph.D)\nDirect E-Commerce Experience", "employment_type": "FULL_TIME", "date_posted": "2021-08-17T15:10:54.000Z"}, "company": {"name": "Alldus", "link": "https://ie.linkedin.com/company/alldus"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 12, "seniority_level": "Junior"}}