{"location": {"country": "US", "locality": "United States", "region": "United States", "postal_code": "99999", "street_address": null, "latitude": 39.50355, "longitude": -99.0183}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "zOS RACF Programmer*", "industry": "Information Technology and Services", "description": "Description\nThe Opportunity: VSO is seeking a zOS logical security programmer to provide logical security support on an existing zOS environment with 3-5 years experience with RACF, CA-ACF2, CA-TopSecret, Global Security Settings, SSL and Digital Certificate, risk assessment.\nQualifications:\nFor Logical Security:\nExtensive z/OS System Security knowledge (i.e. RACF, CA-ACF2, CA-TopSecret, Global Security Settings, SSL and Digital Certificate, risk assessment, business continuity/DR, etc.)\n3 plus years with hands on zOS Logical Security support (Skill Level 3-4 on a 0-4 scale) (this does NOT include UserID Administration support)\nComprehensive knowledge of IBM policies: GSD331, ISeC, CSD and ITCS104 requirements to provide guidance to z/OS System Support teams, Business Controls and the customer\nIn-depth knowledge of various system and sub-system products: used to evaluate and implement Software/Application security (i.e.: z/OS, CICS, DB2, IMS, MQSeries, Omegamon, JES2, CA7/OPC, CA1/RMM, etc.),\nz/OS System and Sub-System knowledge (i.e.: JCL, SDSF, JES2/3, FTP,…) – Must be able to create/update/run Jobs in support of security changes and monitoring\nBroad data analysis and report writing skills – Tools: RACFRW, ETF/A, zSecure, VRA, JCL, SAS, etc. Coding skills: REXX, Clist, CARLa,…o Robust Problem Determination and Problem Resolution skills – understands the steps required to investigate the core issue and determine a secure resolution,o Experience with managing (open/close) Problem and Change tickets within the variety of IPC tools\nAbove average Oral/Written Communication skills – Is able to consult on and present security concepts to management and clients\nWorking knowledge of MS-Word and MS-Excel,o Self Starter that requires minimal oversight - Able to multitask, set priorities, and lead projects and meetings,o Able to provide 24/7 On-Call and after hours support for Sev1/2 problems and upgrades.\nNICE TO HAVE: MVS system support / programming skills and UserID Administration type skills\nFor Health Checking:\nExtensive z/OS System Security knowledge (i.e. RACF, CA-ACF2, CA-TopSecret, Global Security Settings, etc.)\nComprehensive knowledge of IBM policies: GSD331, ISeC, CSD and ITCS104 requirements to provide guidance to z/OS System Support teams, Business Controls and the customer\nIn-depth knowledge of various system and sub-system products: used to evaluate Product/Software security (i.e.: z/OS, CICS, DB2, IMS, MQSeries, Omegamon, JES2, CA7/OPC, CA1/RMM, etc.)\nz/OS System and Sub-System knowledge (i.e.: JCL, SDSF, JES2/3, FTP,…) – Must be able to create/update/run Jobs in support of security health checking\nAbove average Oral/Written Communication skills – Is able to consult on and present security concepts to management and clients\nWorking knowledge of MS-Word and MS-Excel\nSelf Starter that requires minimal oversight - Able to multitask and set priorities.\nWhat is Important to Us:\nYou are an excellent communicator in writing and speaking.\nYou have the ability to work independently but also value teamwork.\nYour problem-solving skills are excellent.\nYou are looking for a job where performance appraisals occur regularly, and you look forward to advancing your career.\nYou seek a community of virtue-centered co-workers and clients.\nWhat we offer you:\nAs part of the VSO company, you will be part of a virtue-centered team who value their work and teammates.\nThis is a no-jerk zone\n. We provide ongoing learning and development opportunities to foster continuous growth. We offer competitive salaries, health benefits, and flexible work arrangements.\nMore About VSO\n: VSO is a hybrid cloud and managed services consulting firm. Much of VSO’s success can be attributed to our deep partnerships with IT services industry leaders such as AWS, IBM, Microsoft and others. VSO leverages numerous other partner relationships so as to provide our customers with optimal support. Additionally, we take pride in taking care of our employees. We offer a wide variety of benefits for eligible employees related to health, retirement, professional development, and more! For more information, please visit our website at\nhttps://vso-inc.com/careers", "employment_type": "FULL_TIME", "date_posted": "2021-08-18T22:07:32.000Z"}, "company": {"name": "Virtual Service Operations", "link": "https://www.linkedin.com/company/virtual-service-operations"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}