{"location": {"country": "US", "locality": "United States", "region": "United States", "postal_code": "99999", "street_address": null, "latitude": 39.50355, "longitude": -99.0183}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Fullstack Software Engineer", "industry": "Internet,Financial Services,Consumer Services", "description": "At Starship, we’re working hard to create the healthy future we all deserve by transforming the way people pay for healthcare. We’re passionate about empowering our customers to take greater control of their financial health and personal wellness, building a better tomorrow through superior technology and user experience.\nLaunched in 2018, our team of engineers, designers, and strategists are redefining the $65 billion health saving industry by building innovative solutions for saving, spending, and investing for healthcare. We’re bringing together exceptional talent from various disciplines and industries to shape the future of health savings and improve the lives of our customers.\nAs Software Engineer, you’ll work alongside our Senior Engineering Manager to take our product to the next level by tightening integration and enhancing compliance with industry standards. In this role, you’d work on architecting, designing, and implementing a system where delivering secure information in real time is essential.\nWe seek out engineers who are hard-skilled software pros but also thinkers and tinkerers who find creative solutions for complex problems and challenge the status quo. We love automation, code review, and continuous integration, and you should too. At Starship, we’re constantly iterating and improving our products to provide our members with the best experience possible.\nWhat you’ll be doing\nDesigning scalable and resilient data pipelines and handle exponential member growth with confidence\nContributing to an event driven software stack to keep auditors happy\nDesigning data models and workflows to make use of health financial data\nCollaborating with engineers and product managers to make sure we're building the right solutions for the right problems\nDeveloping new user-facing features\nBuilding reusable code and libraries for future use\nEnsuring the technical feasibility of UI/UX designs\nOptimizing application for maximum speed and scalability\nThoughtful communication through code and design review\nStriving to build great experiences, and putting users ahead of technology\nCollaborating with engineers and product managers to make sure we're building the right solutions for the right problems\nImproving our current tech-stack, found here https://stackshare.io/starship/starship\nWhat you'll bring to the team\nA willingness to work in a fast-paced startup environment\nAbility to dive into complex systems and understand how they work\nExperience in implementing testable business logic that is secure and easy to maintain\nExperience with React, React Native, Javascript/Typescript, and Node.js\nExperience in building and consuming various API endpoints (GraphQL) and working on payments features or companies\nFamiliarity with message brokers and event streams—e.g., AWS SNS, SQS, Azure ServiceBus, or similar\nExperience working in high security environments—e.g., payments, healthcare\nExperience in building both web and app products\niOS and Android experience is a plus\nMotion experience is a plus\nYou work with a sense of empathy for others, both end users and your fellow engineers\nWhat Starship offers\nWelcoming, diverse, and interesting colleagues from all walks of life\nCompetitive compensation packages, including equity\nComprehensive benefits package, including medical, dental, and vision insurance\nOf course, the best HSA!\nFlexible schedules and time off\nNew equipment so you can do your best work", "employment_type": "FULL_TIME", "date_posted": "2021-08-05T14:23:34.000Z"}, "company": {"name": "Starship", "link": "https://www.linkedin.com/company/starshiphsa"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}