{"location": {"country": "US", "locality": "Los Angeles", "region": "Los Angeles", "postal_code": "90101", "street_address": null, "latitude": 34.05224, "longitude": -118.24335}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Engineer", "industry": "Marketing and Advertising,Online Media,Internet", "description": "A high growth Series D+ enterprise software client is seeking a\nData Engineer\nto build Python ETL processes to communicate highly complex data trends to stakeholders in a way that’s easy to understand. You will also be responsible to create data models and pipelines for research, reporting, and machine learning.\nResponsibilities\nBuild complex algorithms that provide unique insights into client's data.\nUse agile software development processes to make improvements to back-end systems.\nDevelop models of comprehensive user flows throughout the system by using front-end and back-end data sources to enable powerful data analysis.\nBuild data pipelines that clean, transform and aggregate data from disparate sources.\nWork with data to solve business problems, build and maintain the infrastructure to improve processes.\nWork closely with the data science and business intelligence teams to streamline the workflows, add value to the client's product offering, and build out customer lifecycle and retention models.\nRequirements\nBachelor’s degree in computer science, information technology, engineering, or related discipline.\nPrevious experience with Python, SQL, and data visualization/exploration tools.\nFamiliarity with the AWS ecosystem specifically RedShift and RDS.\nPreferably with experience building or maintaining ETL processes\nExcellent communication skills, ability to explain technical concepts to non-technical stakeholders.\nCollaborative working style in a dynamic, research-oriented team with concurrent projects.\nAbout Hire Digital\nHire Digital helps enterprises and growth companies build and enhance their digital capabilities with a world-class network of digital marketers, developers, and designers. We have enabled companies like Philips, 3M, Roche, AXA, Unilever, and many more to reduce overheads and boost efficiency.\nPowered by JazzHR\n3j97TNBAeW", "employment_type": "FULL_TIME", "date_posted": "2021-08-17T07:09:35.000Z"}, "company": {"name": "Hire Digital", "link": "https://www.linkedin.com/company/hiredigitalco"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}