{"location": {"country": "US", "locality": "San Diego County", "region": "San Diego County", "postal_code": "92101", "street_address": null, "latitude": 32.71576, "longitude": -117.16382}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Machine Learning Engineer", "industry": "Information Technology and Services,Computer Software", "description": "Machine Learning Research Engineer\nOverview\nWe are looking for an experienced Machine Learning Research Engineer to join our fast-growing technology team. This role will require you to help with design, implement and commercialize driver monitoring and driver assistance algorithms. You will have access to very large datasets and will get to deploy new algorithms/models into thousands of vehicles.\nResponsibilities\nDesign and commercialize algorithms characterizing driving behavior\nDesign, implement and track key metrics; and architect data-driven solutions\nImprove machine learning infrastructure for scalable training and inference\nInnovate and develop proof of concept solutions showcasing novel capabilities\nRequirements\nMasters or PhD with 3+ years’ experience in Computer Science, Electrical Engineering or a related area\nExcellent programming skills- Python (required) and C++ (desired)\nResearch or industry experience with machine learning models\nAbility to take abstract product concepts and turn them into reality\nAbility to innovate on cutting-edge problems without documented solutions\nExperience with successfully applying machine learning to solve a real-world problem\nExperience with conducting successful statistical experiments\nDesired Skills\nExperience with image, video and time-series data\nExperience with road scene understanding (objects, lanes, interactions, signs, etc.)\nExperience with person/driver scene understanding (pose, distracted, eye status etc.)\nExperience with Predictive analytics\nPublications in top conferences (CVPR/NeurIPs/ICML/ICLR)\nWe are committed to an inclusive and diverse team. Netradyne is an equal opportunity employer. We do not discriminate based on race, color, ethnicity, ancestry, national origin, religion, sex, gender, gender identity, gender expression, sexual orientation, age, disability, veteran status, genetic information, marital status or any legally protected status.", "employment_type": "FULL_TIME", "date_posted": "2021-06-30T17:15:51.000Z"}, "company": {"name": "Netradyne", "link": "https://www.linkedin.com/company/netradyne"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}