{"location": {"country": "US", "locality": "Grand Prairie", "region": "Grand Prairie", "postal_code": "75054", "street_address": null, "latitude": 32.745495, "longitude": -97.00353}, "salary": {"currency": "USD", "min_value": 84500, "max_value": 137000, "unit": "YEAR"}, "job": {"title": "Senior Software Engineer", "industry": "Information Technology and Services,Defense &amp; Space,Computer Software", "description": "Role And Responsibilities\nJob Title: Senior Specialist, Software Engineering\nJob Code: AS20201811-53339\nJob Location: Arlington, TX\nEssential Duties And Responsibilities\nApply computer science, engineering, and mathematical analysis concepts and principles in the development of software for the target application\nWork closely with cross functional members of the engineering organization to develop and evaluate interfaces between hardware and software, and operational performance requirements and design of the overall system\nSupport and participate in all phases of the software development life cycle, including requirements analysis, design, implementation, integration, and test of embedded software for real-time control of simulated and stimulated avionics equipment\nDevelop software test procedures, software programs, and related documentation\nEnsure software and quality company processes and standards are met\nPerform system-level integration and troubleshooting\nParticipate in peer reviews, identify, track and repair defects\nUtilize a variety of software languages (i.e., C++, C) on Windows, Linux, and embedded real time operating systems (VxWorks, Linux, QNX, Integrity, Windows CE, and others for Motorola, Intel, TI, and custom processor designs)\nProvide weekly earned value, schedule, and technical status reports to leadership\nQualifications And Education Requirements\nMust be able to obtain a DOD security clearance\nBachelor’s degree in Computer Science, Computer Engineering, Software Engineering, Mathematics, or related field\nProfessional experience with Linux Operating Systems, FORTRAN, Ada, and C++ are required\nPrevious simulation or Avionics experience required, training system simulation experience preferred\nKnowledgeable with MIL-STD 1553 interfaces\nManagement of software baselines, including branching, merging, building, maintaining, and installing software\nExcellent demonstrated technical writing, presentation, and communication skills\nAbility to effectively work across disciplines and achieve consistent quality results\nDemonstrated creativity and problem-solving skills\nFlexibility to support occasional overtime, weekend work, shift work and site travel\nGeneral computer skills including use of Microsoft Office products\nAdaptable as business environment changes resulting in responsibility and technology changes\nPreferred Skills\nPrefer 5 plus years of Real-Time development experience\nSimulation or stimulation experience with any CNI subsystems such as: ARC-201, ARC-210, ARC-231, HSD-440, VDL-4000 VHF Data Link, IDM-304, TTR-921 TCAS, AN/ARN-153 TACAN, AN/ARN-147 VOR/ILS/MB Multi-Mode Receiver, AN/ARN-149 Low Frequency ADF Receiver, AN/APG-209(G) Radar Altimeter, AHC-3000A, H764G EGI, AN/APX-118(V) IFF Transponder\nExperience with Object Oriented Design and Programming preferred\nClearCase, ClearQuest configuration management tool experience a plus\nKnowledge of different testing methodologies (e.g., White/Gray/Black box testing)\nOther Duties\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for their job. Duties, responsibilities, and activities may change at any time with or without notice.\nCAE USA Inc. is an EOE/AA employer and gives consideration for employment to all qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status. If you’d like more information about your EEO rights as an applicant under the law, please click here\nEEO is the Law poster\n.\nPAY TRANSPARENCY NONDISCRIMINATION PROVISION\nThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information.\nPosition Type\nRegular\nCAE thanks all applicants for their interest. However, only those whose background and experience match the requirements of the role will be contacted.\nEqual Employment Opportunity\nAt CAE, everyone is welcome to contribute to our success. With no exception.\nAs captured in our overarching value \"One CAE\", we’re proud to work as one passionate, boundaryless and inclusive team.\nAt CAE, all employees are welcome regardless of race, nationality, colour, religion, sex, gender identity or expression, sexual orientation, disability or age.\nThe masculine form may be used in this job description solely for ease of reading, but refers to men, women and the gender diverse.", "employment_type": "FULL_TIME", "date_posted": "2021-07-15T21:47:53.000Z"}, "company": {"name": "CAE", "link": "https://ca.linkedin.com/company/cae"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}