{
    "job": {
        "title": "QA Software Testing Engineer",
        "industry": "Computer Software,Computer &amp; Network Security,Information Technology and Services",
        "description": "THE POSITION: QA Software Testing EngineerAs The Shade Store continues our aggressive growth, it has become ever more apparent that we need to continue to grow this very important team. We’re committed to building an excellent team of collaborators and innovators. Our team is ambitious and passionate; the environment is close-knit, fast paced and fun. We are a company that values doers over talkers and mentors over managers. If you work well with people and most importantly have the technical skill set to help support the business in the functions described below -- then we would love to hear from you.   The position will report directly to the Director of Project Management and will be part of the IT team responsible for developing and improving our website, showroom and corporate applications for The Shade Store. The role requires strong technical skills, and good communication skills for collaboration with the rest of the development team, IT Software Management and Security teams.   RESPONSIBILITIES:  - Work directly with the development team to test and validate the operation of all code development   \n  - Manage UAT, Regression and Unit testing in QA and with developers / end users   \n  - Work with the security team to validate all new development meets our security standards   \n  - Communicate with the development team on issues and bugs that must be corrected before the code is put into production   \n  - Maintain documentation of best practices for the QA process and for the developers to avoid repeating the same issues multiple times   \n  - Introduce, develop, implement, maintain testing automation where it adds value   \n  - Remain current on software test automation technology   \n  - Contribute in all phases of the development life-cycle   \n  - Follow industry best practices   \n  - Document all QA activities in accordance with the company best practices   \n  - Perform other duties as they arise   \n   POSITION REQUIREMENTS:  - Bachelor’s degree in Computer Science, Engineering or a related subject, or equivalent experience   \n  - A minimum 5-8 years of solid experience in QA for a team of PHP/LAMP stack developers in a professional environment using object oriented and MVC design   \n  - Significant experience with Form Testing (e.g., Smoke, Regression Testing) is required   \n  - Has owned the full responsibility for leading UAT, Regression and Unit testing for an organization   \n  - Has worked with and implemented (hands on) with automated testing software   \n  - Demonstrated knowledge of modern SDLC, Agile/Scrum, Kanban etc.   \n  - Understanding of GIT / CI pipeline workflow   \n  - Extensive PHP (7.3+) experience with MySQL and Apache   \n  - Extensive MYSQL (5.6+) experience with workbench or equivalent   \n  - Familiarity with one or more PHP frameworks (Symfony)   \n  - Strong understanding of front-end JavaScript, jQuery as well as other libraries or frameworks and CSS/Sass knowledge    \n  - Passion for deploying high quality and performance applications and a desire to develop new bold ideas   \n  - Ability to organize and manage multiple tasks and priorities   \n  - Sharp attention to detail   \n  - Strong communication skills with the ability to cross collaborate amongst internal departments   \n  - Comfortable using a Mac or Windows device   \n  - Self-motivated and willing to \"do what it takes\" to get the job done   \n   NICE TO HAVES:  - Understanding of virtual machines   \n  - Experience with AWS, Docker, Ansible   \n  - PCI Experience a plus   \n   ABOUT THE SHADE STORE®At The Shade Store, we have handcrafted the finest Shades, Blinds and Drapery for 75 years. We believe designing beautiful custom window treatments should be an effortless experience, so we offer outstanding services to help our customers every step of the way, from inspiration to installation. We are always looking for friendly, passionate people to help us deliver the finest custom window treatment experience to our customers. Our team is growing and expanding, and there has never been a more exciting time to be part of it.   WHY WORK AT THE SHADE STORE®We set out to create a company culture that is enjoyable, rewarding, and where there is continuous upward mobility and growth opportunity. If you work hard, give the company your all, use good judgment, and have a positive attitude – then the sky’s the limit. In return, there are numerous perks and benefits including:     - Full time highly competitive salary   \n  - Medical Benefits   \n  - 401k Available and we match up to 4% of your contributions   \n  - $100k Life Insurance & Short-Term Disability Coverage provided at no charge   \n  - Partake in many charities and local events   \n  - And many more…..   \n   If you're looking to be part of a growing family of enthusiastic and hard-working individuals, we'd love to hear from you!   ABOUT US: Visit our website at&amp;nbsp;https://www.theshadestore.com/corporate-info/careers&amp;nbsp;to learn more about The Shade Store and our career opportunities.   THE SHADE STORE offer is contingent upon:   - Successful completion of reference checks   \n  - Proof of legal authorization to work in the United States for The Shade Store, which will be confirmed by E-Verify within three business days of your hire date   \n   The Shade Store provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T17:38:23.000Z"
    },
    "company": {
        "name": "The Shade Store",
        "link": "https://www.linkedin.com/company/the-shade-store"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Port Chester",
        "region": "NY",
        "postal_code": "10573",
        "street_address": null,
        "latitude": 41.00155,
        "longitude": -73.66583
    }
}