{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Company OverviewOur founding team has extensive experience in building, researching, and selling machine learning products and came together in search of a product that could leverage these skills for positive impact. Now, we’ve set out to build software that works to address the generation defining issue of economic inequality in the face of climate change.  We are running head first at the $150B+ coverage gap that faces the insurance industry as increasingly frequent and severe weather events challenge the status quo.The problems we wrestle with every day are… Re-thinking the first principles of state of the art predictive and optimization mechanismsDoing so in a multi-cloud infrastructure environment with significant security constraintsEnabling a lightweight, low-latency, and consumable UX despite the complexity The team is looking for talented, driven, and, above all, caring individuals to join us in that journey.   RequirementsDemonstrated interest in engineering for impact2+ years of hands-on industry experience in full stack / data engineeringEvent backbone and job pool platforms (Kafka, etc)Willingness to get hands dirty across a broad variety of internal and client software2+ years of experience with React, Python (Django + Flask) and Node.jsDemonstrated ability to pick up new technologies quickly and learn on the flyNice-To-HavesUndergraduate or Graduate work in a related fieldExperience with ML or optimization",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-29T22:56:02.000Z"
    },
    "company": {
        "name": "Federato",
        "link": "https://www.linkedin.com/company/federato"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}