{"location": {"country": "US", "locality": "Phoenix", "region": "Phoenix", "postal_code": "85009", "street_address": null, "latitude": 33.448204, "longitude": -112.072586}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Analyst", "industry": "", "description": "About Mobinity Global:\nMobinity Global is transforming the way recruiting is done in the digital age. We work with a number of top tier companies, tech startups, freelance companies, Industry professionals and subject matter experts for projects, internships, jobs and freelance work.\nIf you meet the below\neligibility criteria\n, please apply and our recruitment team will contact you through LinkedIn to get you started. We plan to build a strong connection with all of our applicants so that we can facilitate both our employment partners and potential employers now as well as in the future.\nEligibility Criteria:\nYour year of graduation is 2020 or later.\n(Masters Candidates can also apply)\nYou have a bachelor's degree in business/ economics/ finance/ Computer Science / Statistics major from a USA university.\nYou have an aspiration to work for companies such as Dell, Citadel, Qualtrics, PNC, Venture for America, RippleMatch, SAP, Robinhood etc.\nDescription:\nApply your knowledge of data analysis to real-world modelling, analysis, and report with our experienced analyst team.\nData Analyst Duties and Responsibilities:\nUsing advanced computerized models to extract the data needed\nRemoving corrupted data\nPerforming initial analysis to assess the quality of the data\nPerforming further analysis to determine the meaning of the data\nPerforming final analysis to provide additional data screening\nPreparing reports based on analysis and presenting them to management\nRequirements:\nA high level of mathematical ability\nProgramming languages, such as SQL, Oracle and Python\nThe ability to analyze, model and interpret data\nProblem-solving skills\nA methodical and logical approach\nThe ability to plan work and meet deadlines\nAccuracy and attention to detail\nInterpersonal skills\nTeamworking skills\nWritten and verbal communication skills\nBenefits:\nShadowing, mentoring, and training opportunities.\nHands-on application of finance principles in a fast-paced work environment\nOpportunity to attend weekly meetings and occasional networking events\nCompensation available\nApply NOW and we'll get you started to explore your best matches!", "employment_type": "INTERN", "date_posted": "2021-10-18T06:05:38.000Z"}, "company": {"name": "Mobinity Global", "link": "https://www.linkedin.com/company/mobinity-global"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}