{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Software Engineer Mid Level or Senior EngineerRemote, USA/Canada, Full-TimeHow can you apply your technical expertise to help clients transform data into new business value?4 Mile Analytics is a full-service consultancy with expertise in strategy, data analytics, data engineering, data visualization, software development, UX design, and project/product management. We believe in the power of data to form compelling narratives that drive innovation. Our guiding principle is to help our clients move up the chain of analytic maturity.Our developers have contributed code to projects that have transformed the world’s largest companies. We focus on pragmatic solutions to our clients’ most complex data problems. Every day presents fresh opportunities to develop your technical, leadership, and business skills.We pride ourselves on an inclusive, values driven culture that achieves a healthy work life balance. We value in our teammates:Curious minds who are inclined to ask, “Why?”Strong problem-solvers who are comfortable in unfamiliar situations, and can view challenges through multiple perspectivesDriven to develop technical skills for oneself and team-matesAbility to connect with clients and colleagues of different backgrounds and communication styles, through empathy and clear verbal, visual, and written communicationEquates professional achievement with happy end-usersYou’ll work on the following:A wide variety of engineering projects including data visualization, web services, data engineering, web-portals, SDKs, and integrations — in numerous languages, frameworks, and cloudsApply continuous delivery practices to deliver high-quality software and value as early as possible.Work in collaborative teams to build new customer experiencesParticipate in the entire cycle of software consulting and delivery from ideation to deploymentWhat we’re looking for:2-5 (for mid level) and 5+ (for senior)  years of experience in Front End UI development using Angular, React or another modern Javascript framework2-5 (for mid level) and 5+ (for senior) years of experience with 2 or more back-end development languages such as Java, NodeJS, Python or RubyAbility to lead the delivery of major features and moderately complex projectsAbility to mentor and guide junior developersFamiliarity with at least one cloud environment (AWS, GCP, Azure)Experience with database fundamentalsAbility to write high-quality, well-tested code and comfort with Object-Oriented or functional programming patternsPast experience quickly learning new languages and frameworksFamiliarity with Agile methods, such as Scrum and/or KanbanDesire to influence others, advocate for technical excellence, while remaining flexibleAbility to work with a high degree of autonomy and self-directionWhat We Offer:4 Mile offers full-time employees the following compensation packageCompetitive salaryUnlimited PTO3% company contributions to a 401KExcellent health-care benefits for you and your family membersInternet or coworking subsidies and equipment to help you make a good workspaceSnack allowancePermanently remote Company retreats",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-29T16:31:38.000Z"
    },
    "company": {
        "name": "4 Mile Analytics",
        "link": "https://www.linkedin.com/company/4mile"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "California",
        "region": "United States",
        "postal_code": "93266",
        "street_address": null,
        "latitude": 37.254673,
        "longitude": -119.61728
    }
}