{"location": {"country": "US", "locality": "Los Gatos", "region": "Los Gatos", "postal_code": "95030", "street_address": null, "latitude": 37.22134, "longitude": -121.97964}, "salary": {"currency": "USD", "min_value": 84500, "max_value": 177000, "unit": "YEAR"}, "job": {"title": "Software Engineer", "industry": "Information Technology and Services,Computer Software,Financial Services", "description": "Do you want to work for an Emmy® Award-winning company? At Audible Magic we are building the most revolutionary media recognition technology and rights management solutions for the global music, movie and television industry. Our customers and partners include some of the largest and most recognized brands in the industry. We win awards because we keep driving to provide better solutions for our customers, solutions that meet the needs of the ever-changing music and entertainment industry. At Audible Magic we believe our customers are paramount, and our reputation and integrity are the foundation of our business.\nResponsibilities\nManage entire sections of our platform by taking projects from idea to implementation\nCollaborate closely with our design teams on implementing new features and workflows\nBuild highly reliable and scalable cloud-based applications\nClearly communicate status and open issues to team leads and managers\nAbility to learn on the job and implement new technologies\nAdvocate and evangelist of the micro services architecture and REST API vision\nDevelop and maintain the external developer portal containing reference implementations, swagger-based testing interfaces and articles\nDrive the containerizing effort of the API artifacts\nRequirements\nSuperior communication chops, both verbal and written, including excellent technical writing and interpersonal skills\n3+ years of relevant software engineering experience.\nAGILE or iterative development experience\nAbility to write unit tests (TDD practices) for back-end and front-end services\nWork effectively under stress, independently, and within a team\nA devil for the details, able to work well under deadlines in a changing environment and perform multiple tasks effectively and concurrently\nPreferred Experience\n3+ years of Object-Oriented Programming (.NET or java)\n2+ years of Database experience (SQL and NoSQL databases)\n1+ years of NodeJS experience\nBasic experience building RESTful web services\nBasic experience working with Message Queue Systems\nBasic experience working with XML and JSON formats\nAdded Bonus\nExperience with AWS or similar cloud computing environments\nExperience building and managing automated build/test/deployment\nExperience working with Docker\nExperience working with Oracle Databases\nMicroservice architectures knowledge\nRobust knowledge of API software design patterns\nEducation\nMust have a bachelor’s degree (masters’ preferred) in Computer Science, Applied Mathematics, Engineering, or any other technology related field. An equivalent of this educational requirement in working experience is also acceptable.", "employment_type": "FULL_TIME", "date_posted": "2021-07-14T02:37:27.000Z"}, "company": {"name": "Audible Magic", "link": "https://www.linkedin.com/company/audible-magic"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}