{
    "job": {
        "title": "Junior Software Engineer",
        "industry": "",
        "description": "Why would you want this role?This is an amazing opportunity for a highly motivated engineer to be a part of the pi-lit® engineering team that produces some of the most exciting technology in the transportation and autonomous vehicle industry. pi-lit® products are used around the world! Continuing our mission to improve safety on every mile of roadway.&amp;nbsp;What we value?Our company is driven by three core principles: respect, integrity, and innovation.&amp;nbsp;Is this you?We are looking for an experienced full-stack engineer interested in collaborating with a highly motivated and talented team. As a software engineer, you will be responsible for designing, maintaining, and testing both web and server projects. You will work closely with the engineering and sales team to define and help develop applications that solve our customer’s problems. You will enjoy the benefits of having direct involvement in the full cycle development of software and productization of solutions that will be used both nationally and internationally.You should excel in working with large-scale applications, frameworks and have outstanding communication and leadership skills.&amp;nbsp;&amp;nbsp;&amp;nbsp;Responsibilities  - Writing clean, high-quality, high-performance, maintainable code   \n  - Develop and support firmware and software including applications, database integration, interfaces, and new functionality enhancements   \n  - Coordinate cross-functionally to insure project meets business objectives and compliance standards   \n  - Support test and deployment of new products and features   \n  - Participate in code reviews   \n   Minimum Qualifications  - Bachelor's degree in computer science, engineering, math or science discipline; Master's degree preferred.   \n  - Strong experience in embedded C, C++, Python programming   \n  - Technical training   \n  - Linux & scripting languages   \n  - Experience with software debugging   \n  - Experience with code management repositories   \n  - Strong communication and written skills",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-27T23:39:27.000Z"
    },
    "company": {
        "name": "pi-lit® Technology",
        "link": "https://www.linkedin.com/company/pilitroads"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": "Junior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Irvine",
        "region": "CA",
        "postal_code": "92717",
        "street_address": null,
        "latitude": 33.68591,
        "longitude": -117.82472
    }
}