{
    "job": {
        "title": "Software Engineer I - Rotational Program",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Company DescriptionExperian is the world’s leading global information services company, unlocking the power of data to create more opportunities for consumers, businesses and society. We are thrilled to share that FORTUNE has named Experian one of The 100 Best Companies to Work For. In addition, for the last five years we’ve been name in the 100 World’s Most Innovative Companies by Forbes Magazine.Job DescriptionExperian is looking for a Software Engineer I to join our Experian Xcelerator program (EX). This is a rotation program, and you will spend two years learning everything there is to know about Experian’s cutting-edge technology. We are seeking recent Computer Science graduates looking for their first job as a Software Engineer. This is a full-time opportunity and your career at Experian will extend beyond the two-year rotation.This position is remote to start, but you will need to be in our Austin, TX office at the end of the yearIn the EX program, you will have the opportunity to develop your skills through diverse assignments across our business. This 24-month program is a fast track to developing your technical expertise while setting you up for success in a global organization.Here’s What You Can Expect To Do In This ProgramWe’ll be conducting interviews in July and this position will have a start date in mid-August.Complete four 6-month technical rotations across our business groupsGet hands-on experience with the latest technical environments, programming languages and developmentCollaborate with Product Management, Design and Innovation teamsReceive 1:1 mentorship from Senior Engineers and a Career Development CoachQualificationsGraduated in Spring 2021 with a BS or MS degree in Computer Science, Computer Engineering or equivalent field Knowledge in one or more programming and scripting language such as Java, JavaScript, C#, T-SQL, HTML, PHP, Python or RubyExperience with frameworks such as ASP.NET, React, Redux, Angular, Spring or HibernateExposure to various databases such as Oracle, SQL, Cassandra and MongoDBAn interest in learning test automation, machine learning, DevOps or AWSStrong communication and collaboration skills, curious, critical thinking and analytical mindAdditional InformationAll your information will be kept confidential according to EEO guidelines.Experian is proud to be an Equal Opportunity and Affirmative Action employer. Our goal is to create a thriving, inclusive and diverse team where people love their work and love working together. We believe that diversity, equity and inclusion is essential to our purpose of creating a better tomorrow. We value the uniqueness of every individual and want you to bring your whole, authentic self to work. For us, this is The Power of YOU and it ensures that we live what we believe.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-23T06:39:29.000Z"
    },
    "company": {
        "name": "Experian",
        "link": "https://www.linkedin.com/company/experian"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}