{
    "job": {
        "title": "Front-End Software Engineer",
        "industry": "Computer Hardware",
        "description": "IntroductionSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.Your Role and ResponsibilitiesIBM’s Digital Workplace Engineering team is focused on engineering tools and applications IBMers need to be effective. Through a family of apps and services, we’re building an environment that is constantly iterating, solving problems, and working together to push the limits on productivity and collaboration. We are well-positioned to deliver the next chapter of the digital workplace, leveraging expertise in cloud, security, and scale.Modern digital workplaces are fragmented and full of unnecessary friction. As a Frontend Engineer, you will actively be transforming the digital workplace by delivering products, like an enterprise digital assistant, which reduces unnecessary touchpoints and create a much more cohesive experience.Must have the ability to work in the US without current or future need for IBM sponsorship.Responsibilities Crafting beautiful and high performing web applications Understanding user needs and exploring user-centered designs Leveraging modern tools and techniques to develop clean, efficient, and reusable code Excelling at problem identification and executionRequired Technical and Professional Expertise4 plus years of experience with JavaScript, TypeScript, Node.js, or equivalent language and technologiesExperience working with Angular, React, or VueJsPractical experience in using APIs, web services, and microservicesExperience working with relational and non-relational databasesPreferred Technical And Professional ExpertiseBS in Computer Science or equivalent experienceExperience working with VueJSKnowledge of SQL/NoSQL database principles and usageExperience working with chatbots, virtual assistants, intelligent personal assistant, cloud-based voice service, dialog agents or similarAbout Business UnitIBM’s Digital Workplace Engineering team is focused on engineering tools and applications IBMers need to be effective. Through a family of apps and services, we’re building an environment which is constantly iterating, solving problems, and working together to push the limits on productivity and collaboration. We are well-positioned to deliver the next chapter of the digital workplace, leveraging expertise in cloud, security, and scale.Your Life @ IBMWhat matters to you when you’re looking for your next career challenge?Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.Impact. Inclusion. Infinite Experiences. Do your best work ever.About IBMIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.Location StatementBenefitsIn addition to a competitive benefits program consisting of medical and life insurance, retirement plans, and time off, eligible employees may also have access toIBM offers a wide range of resources for eligible IBMers to thrive both inside and outside of work.12 weeks of paid parental bonding leave. Family care options are also available to support eligible employees during COVID-19.World-class training and educational resources on our personalized, AI-driven learning platform. IBM's learning culture supports your restless attitude to grow your skills and build the depth and scale of knowledge needed to achieve your career goals.Well-being programs to support mental and physical health.Financial programs that empower you to plan, save, and manage your money (including expert financial counseling, 401(k), IBM stock discount, etc.).Select educational reimbursement opportunities.Diverse and inclusive employee resource groups where you can network and connect with IBMers across the globe.Giving and volunteer programs to benefit charitable organizations and local communities.Discounts on retail products, services, and experiences.We consider qualified applicants with criminal histories, consistent with applicable law.IBM will not be providing visa sponsorship for this position now or in the future. Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship.Being You @ IBMIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-21T00:00:00.000Z"
    },
    "company": {
        "name": "IBM",
        "link": "https://www.linkedin.com/company/ibm"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}