{"location": {"country": "US", "locality": "Farmington Hills", "region": "Farmington Hills", "postal_code": "48321", "street_address": null, "latitude": 42.484673, "longitude": -83.35918}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "HR Data Analyst", "industry": "Financial Services,Health, Wellness and Fitness,Hospital &amp; Health Care", "description": "About Centria Healthcare\nFounded in 2009 and headquartered in Farmington Hills, Michigan, Centria Healthcare is a leading provider of home-based catastrophic injury and rehabilitation care, private duty nursing, and supportive living services. Centria Healthcare Autism Services is the largest provider of Applied Behavior Analysis (ABA) for children with Autism Spectrum Disorder (ASD) across the state of Michigan, with services in other states.\nPosition Overview\nThe HR Analyst is responsible for partnering with leaders and human resources partners to help drive employee engagement and retention through reporting and analytics. The HR Analyst will use industry best practices and innovations to support the engagement efforts across the organization.\nResponsibilities\nThe ideal candidate must be able to perform the following essential job functions with or without reasonable accommodations.\nResponsible for supporting the execution of the employee engagement strategy through qualitative and quantitative research and reporting\nAnalyzes and recognizes patterns in employee data to help leaders identify risks and opportunities\nIdentify trends and patterns through the analysis of survey data\nProvide data-driven recommendations to enhance employee engagement across Centria\nIdentify issues and trends within written feedback/comments by reviewing and categorizing feedback by topic, sentiment, etc.\nConstructs concise presentations and/or reporting, including tracking of employee engagement progress\nCollaborate with the human resources on the interpretation and analysis of people data to improve engagement and performance\nResearch industry standards relative to healthcare and conduct/report on benchmarks, best practices, and trends in employee engagement for remote and internal team members\nWork to enhance and create opportunities based upon analytics to continuously improve employee satisfaction, engagement and engagement\nBuild relationships and collaborate across the teams to provide high levels of internal customer service\nMaintain a high level of confidentiality related to engagement reports, employee feedback, management performance and action plans\nCommencement and/or commencement related activities may be required\nLearn new software and assist with implementation of a new survey software system\nCreate and track KPIs relative to human capital\nAutomate current analytic processes using forms and/or macro’s to efficiently process data\nAssist with ad hoc analysis requests\nOther duties as assigned\nRequired Skills, Qualifications, And Knowledge\nBachelor’s degree in Human Resources or related field\nAt least one year of experience in an analyst capacity, human resources or related field\nExperience with qualitative and quantitative data analysis\nAbility to extract, organize and analyze data sets\nStrong research and analytical skills and the ability to visually present data in a consumable format\nPreferred Qualifications\nExpert level Excel skills and strong knowledge of Word and PowerPoint\nKnowledge of and experience with Engagement software system(s)\nAbility to utilize Power BI for data visualization and dashboards\nUnderstanding of statistical modeling (e.g., Pearson’s Correlation Coefficient)\nExperience with predictive analytics relative to human capital\nCentria’s office hours are Monday through Friday from 8:30am-6:00pm. Additional time may be required to complete above work or meet company objectives.\nPhysical Requirements\nWhile performing the duties of this job, physical requirements such as bending, reaching and lifting of up to 50 pounds may be required. This role will require sitting a majority of the day as well as walking as standing when needed. This role will require close visual activity on multiple computer screens or monitors and the ability to analyze data and figures on a screen.\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, Veteran status, or disability status. This job description is not intended to be an exhaustive list of qualifications, skills, efforts, duties, responsibilities, or working conditions associated with the position. Centria reserves the right to amend this job description at any time, with or without written notice.", "employment_type": "FULL_TIME", "date_posted": "2021-07-20T06:08:51.000Z"}, "company": {"name": "Centria Healthcare", "link": "https://www.linkedin.com/company/centria-healthcare"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 12, "seniority_level": "Junior"}}