{"location": {"country": "US", "locality": "Stamford", "region": "Stamford", "postal_code": "06928", "street_address": null, "latitude": 41.051926, "longitude": -73.539474}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Remote Senior Software Engineer (EC2, Docker, Rancher)", "industry": "Information Technology and Services,Computer Software,Financial Services", "description": "If you are a Senior Software Engineer coming from a background including AWS (EC2), Docker & Rancher - please read on!\nThis will be a full time role offering a generous base salary + 5-10% performance bonus + amazing (full) benefits!\nWe have offices located in Stamford, CT and Dana Point, CA. This role will be REMOTE.\nOur team is about 70 people in size (We've been steadily growing since our inception 13 years ago!)\nWe are a profitable, web-based financial research and media company providing information centering around investment.\nWhat You Will Be Doing\nDevelop products and services, build and maintain software in support of all our digital media offerings including web, mobile, video and audio\nMaintain, modify, and update web and backend applications\nDesign and create engineering specs, prototypes, and features for web-based applications\nCollaborate with developers, product managers and other participants in the development of solutions\nGather requirements and development specs\nWhat You Need for this Position\nDocker\nRancher\nRuby on Rails preferred (Python, Java or similar will also work in lieu of)\nAWS (EC2)\nHeroku\nInfrastructure\nWhat's In It for You\nOption for REMOTE work or on-site in Stamford, CT or Dana Point, CA\nWe have a VERY high retention rate and support career growth!\nContinuous Learning: we'll fund you attending conferences (when they're open again)\nYou'll be reporting to and learning from a prestigious MIT grad that is well known in the industry\nSo, if you are a Senior Software Engineer (EC2, Docker, Rancher) looking for fully remote, please apply today!\nEmail Your Resume In Word To\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nBobby.June@Optello.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : BJ1-1633211 -- in the email subject line for your application to be considered.***\nBobby June - Recruiting Manager - Optello\nApplicants must be authorized to work in the U.S.\nOptello is proud to be an Equal Opportunity Employer\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\nYour Right to Work\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.", "employment_type": "FULL_TIME", "date_posted": "2021-08-17T23:26:03.000Z"}, "company": {"name": "Optello", "link": "https://www.linkedin.com/company/optello-us"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}