{"location": {"country": "US", "locality": "Huntington Beach", "region": "Huntington Beach", "postal_code": "92605", "street_address": null, "latitude": 33.659775, "longitude": -117.99931}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Scientist - Python/Machine Learning", "industry": "Defense &amp; Space", "description": "Work with the best in the industry on underwater vehicles!\nThis Jobot Job is hosted by Tori Bender\nAre you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.\nA Bit About Us\nOur client is changing the world through the development of ocean-based vehicles. They are transforming the way ocean data is collected and distributed worldwide, allowing scientists, engineers, and governments access to insights that were previously unobtainable.\nYou’ll be a part of a team taking on earth’s last frontier!\nWhy join us?\n100% of benefits are covered for employees.\nEquity\nJob Details\nYour role\nBuild Machine Learning models for various data sets\nDesign and implement reports and quality visualizations of accuracy\nProduce documentation and presentations\nWork alongside other engineers to build an end-to-end data processing pipeline\nSkills Required\nProficiency in various machine learning models (SVM, KNN, and CNN)\nDetailed understanding of Python and associated learning libraries\nKnowledge and use of databases\nExperience with producing real-world ML results\nWhat we’d like to see\nShow us evidence of your exceptional ability. Go ahead, brag!\nIndustry Experience in Machine learning\nIndependent project that demonstrates software proficiencies\nNice to have\nMaster's Degree, or equivalent experience, in a STEM field\nITAR Requirements\nTo conform to U.S. Government space technology export regulations, the applicant must be a U.S. citizen, lawful permanent resident of the U.S., protected individual as defined by ITAR (22 CFR\n120.15) or eligible to obtain the required authorizations from the U.S. Department of State.\nInterested in hearing more? Easy Apply now by clicking the \"Apply\" button.", "employment_type": "FULL_TIME", "date_posted": "2021-07-13T11:55:16.000Z"}, "company": {"name": "Jobot", "link": "https://www.linkedin.com/company/jobot"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}