{"location": {"country": "US", "locality": "Miamisburg", "region": "Miamisburg", "postal_code": "45342", "street_address": null, "latitude": 39.641254, "longitude": -84.27778}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Test Engineer", "industry": "Electrical/Electronic Manufacturing,Construction,Computer Software", "description": "Aeroseal is hiring a Software Test Engineer!\nThe Software Test Engineer will be primarily responsible for testing of, and developing test tools for, new and existing Aeroseal software applications on Windows, Linux, and web platforms. Secondarily, this role will be responsible for supporting and/or developing products and business processes; providing IT support to users of various Aeroseal technologies; writing software manuals, training material, and other software and support documentation.\nWhat You'll Do\nWork within a defined Product Development Process to:\nDevelop DFMEA and DVP documents for the design.\nAssist Manufacturing and Quality Engineering as they develop Process, Process FMEA, Production test tools, Control Plans, Quality plan and metrics\nTest as per the design DVP and document results with clear, concise reports.\nWork within a defined Product Development Process to:\nContribute to Product/System Requirements Documents\nDocument all product-related specifications in an executable and testable format.\nDesign software according to these requirements and document for later maintenance.\nRecognize, analyze, and document risks associated with executed design.\nTest software under revision control.\nActively participate in distribution of software to customers and support, as necessary.\nResearch new tools, methods, techniques, etc., to advance the state of the art.\nExperience You'll Need\nMinimum 4-year degree in Computer Science, or equivalent demonstrated experience\nGraduate or Postgraduate degree in Software Engineering, Computer Science, or Computer Engineering\nProficiency in object-oriented software design and implementation (experience with VB.net, C#, C++ and/or Java a plus)\nProficiency in web design a plus (Web frameworks e.g.React, Angular, jQuery, HTTP & Python)\nLinux experience a plus\nExperience with both MongoDB & relational databases a plus\nExperience with communications protocols a plus\nTechnical Writing\nWho are we? A fast-growing company with award-winning technology that has created new products that are disrupting the HVAC industry.\nYes, we have fun company amenities including a ping pong table, popcorn machine and company happy hours. Our team members play as hard as they work. But it takes more than amenities to be a great place to work.\nHow is Aeroseal different?\nWe Are\nRestless with curiosity and always asking if there's a better way\nPassionate about serving our dealers and customers\nConstantly learning, because we understand we must try new approaches to get new and better outcomes.\nThere is more to our culture of innovation. But we also have a sense of urgency, so we won't list them all here.\nWhat's the rush? Well, our company has an ambitious mission.\nAeroseal wants to make a lasting impact on people and the world around us, improving people's lives and making the world a better place in which to live. And we need your help to make it happen.\nJob Posted by ApplicantPro", "employment_type": "FULL_TIME", "date_posted": "2021-07-14T00:00:00.000Z"}, "company": {"name": "Aeroseal", "link": "https://www.linkedin.com/company/aeroseal-llc"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}