{"location": {"country": "US", "locality": "Plymouth", "region": "Plymouth", "postal_code": "48170", "street_address": null, "latitude": 42.370724, "longitude": -83.46905}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Sr. Wireless Software Engineer", "industry": "Electrical/Electronic Manufacturing,Computer Software,Automotive", "description": "Description\nIndefinite U.S. work authorized required for employment. Future sponsorship for work authorization unavailable at this time\nPurpose Of Position\nThe candidate will exhibit in-depth experience for software design and coding in wireless framework (RIL/Telephony (Android), Ofono (Linux)). The candidate will be engaged in entire software design phase including requirement review, software design review, writing detail design specification, coding, analysis of customer defects, and intensive design level unit testing. The candidate will attend vehicle quality events, field testing, on-site customer support as well. The candidate must have good communication and project management skills as he will have to manage certification for all Americas (North and South America) including 3 rd party certification companies management such as BTI, Umlaut, etc.\nEducational/Experience Requirements\nA minimum 3 years of hands-on Java/J2EE, Java script, C, C++ programming experience.\nMinimum of 3 years of software development experience in Android or Linux OS environments.\nMust have software design and coding experience at all areas from the following domains. – Radio Interface Layer (RIL)/Telephony, Ofono.\nMust be familiar with wireless monitoring tools such as QXDM, and wireless equipment such as R&S’s CMW-500 and Anritsu MD-8475A including analysis of QXDM logs.\nMust have good project management and communication skills.\nStrong hands-on skills on Software debugging.\nShould be familiar with software version control tools.\nBS degree in Computer Science, Computer Engineering, or Electronics/Electrical Engineering\nPreferred Qualifications:\nExperience in developing automotive multimedia/infotainment software highly desired\nExperience in wireless modem or device certification for wireless carriers (Verizon, AT&T, Bell etc)\nExperience with Android, iOS, Linux platform based SW development\nExperience with GIT, JIRA, Eclipse IDE\nProject management and presentation skills.\nMS degree in Computer Science, Computer Engineering, or Electronics/Electrical Engineering\nJob Responsibilities\nCreation of software requirement, design documents.\nCreation of system test plans based on specifications and standards\nDefine test cases and conduct designer level and product level testing.\nManage small projects and technical resources, including planning, estimating and follow through\nWorks with the customer to further define requirements and to resolve issues\nCommunicate effectively with customers to improve overall system performance\nResponsible for communication with customer on design definition\nResponsible for project management and project review with customer\nEngage in all stage of software design and implementation activities for RIL/Telephony(Android) and Ofono(Linux).\nDevice certification activities for all North and South America\nParticipate in design review and code inspection meeting\nParticipate in vehicle quality events.", "employment_type": "FULL_TIME", "date_posted": "2021-08-25T17:44:52.000Z"}, "company": {"name": "Hyundai Mobis North America", "link": "https://www.linkedin.com/company/mobis-north-america"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}