{"location": {"country": "US", "locality": "Pasadena", "region": "Pasadena", "postal_code": "91122", "street_address": null, "latitude": 34.14955, "longitude": -118.14145}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Sr. Photonic Design Automation Engineer - PDK - 100% REMOTE", "industry": "Semiconductors", "description": "If you are a Sr. Photonic Design Automation Engineer with Process Development Kit (PDK) experience, please read on!\nJob Title:\nSr. Photonic Design Automation Engineer - PDK\nJob Location:\nPasadena, CA - 100% REMOTE\nOur company's core technology platform was developed with a total focus on high volume manufacture of highly integrated optical/electronic devices. Our large waveguide photonics platform offers multiple benefits over conventional solutions. These benefits include higher density waveguide circuit design, better manufacturing tolerance, superior optical power handling, and a more efficient interface from the photonics IC to the physical domain.\nOur company's technology simplifies the manufacturing, assembly, and test process while maximizing the power efficiency of the optical system.\nOver half of our team holds advanced technical degrees (M.Sc and PhD) and it includes world recognized experts in photonics process development, photonics device design and modeling, high speed CMOS mixed signal circuits, optical circuit switching, optical sensing and measurement systems, and network systems architecture. Our business leaders have amassed a spectacular track record including in multiple photonics start-ups with impressive investor returns, in growing high volume optical manufacturing at scale, and in forging market-leading communications semiconductor product lines. Together, the team is driving a vision for pervasive silicon photonics across a broad range of high volume applications.\nTop Reasons to Work with Us\nCompetitive Base Salary plus bonus\nComprehensive Benefits package including equity!\nThe chance to join a rapidly growing well funded late-stage Silicon Photonics start-up with huge upside potential!\nWhat You Will Be Doing\nThe Senior Photonics Design Automation Engineer is responsible for implementing tools and workflows which accelerate the development of our full suite of products. This will include and not be limited to: develop, maintain, test and release proprietary Silicon Photonics Process Development Kits (PDKs), improve and lead software development best practices, such as issue tracking, and support development of physical verification scripts and infrastructure. The Senior Photonics Design Automation Engineer will be expected to interact with software vendors and customers as necessary to push development of the toolchain and meet customer deliverables.\nDevelops and validates all collaterals in the Silicon Photonics PDK for the full design flow;\nDevelops and maintains symbols, pcells, callbacks, technology files, etc;\nInterprets and accurately translates design rules and other documentation into PDK environment;\nCreates scripts that perform complex functions;\nImproves and enforces software development best practices;\nApplies formal release and version control best practices to PDKs;\nWorks closely with process, design/device, modeling and layout engineers to deliver highest quality PDKs;\nWorks with vendors of Silicon Photonic design and simulation as well as EDA tools to improve the state of the industry and meet company goals;\nWorks with external customers to understand and meet deliverables.\nCompetencies for Role: Positive Attitude, Efficient, Flexibility/Adaptability, Organized, Strong Communication Skills.\nOrganizational Values: Customers, Results, Excellence, Innovation, Teamwork.\nWhat You Need for this Position\nPreferred\nMust have a BS degree (MS or PhD preferred) in Computer Science, Engineering, or similar with 2+ years industry experience in the following\nDeveloping software in a collaborative environment\nSilicon Photonics Process Development Kit (PDK)\nPhotonic Design Automation\nScripting (C++, Perl, Tcl, Python, Java etc.)\nEDA/EPDA Tools such as Synopsys Custom Compiler, Cadence Virtuoso, OptoDesigner, OptSim Circuit, IC Validator; Mentor Calibre; and/or KLayout required\nExperience developing and maintaining Symbols, PCells, Callbacks, Technology Files etc.\nFamiliarity with ClioSoft, GIT or other revision control systems and best practices\nFamiliarity with issue tracking systems such as JIRA\nFamiliarity or interest in Silicon Photonics is preferred\nExperience with Windows and Linux shell scripting is preferred\nFamiliarity with RF or analog circuit design and verification is a plus\nWhat's In It for You\nCompetitive Compensation\nFlexible work environment, flex hours and day - work 100% REMOTE even post-Covid!\nOur Equity offering is extremely competitive, we are looking for candidates who are interested in taking a vested interest in our success, and we are more than willing to share the rewards of that success with them!\nWe offer a stimulating and innovative work environment\nSo, if you are a Sr. Photonic Design Automation Engineer with Process Development Kit (PDK) experience, please apply today! or send an updated copy of your resume to\nMike.Vandenbergh@CyberCoders.com\nfor immediate consideration!\nEmail Your Resume In Word To\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nMike.Vandenbergh@CyberCoders.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : MV1-1600200 -- in the email subject line for your application to be considered.***\nMike Vandenbergh - Lead Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\nYour Right to Work\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\nCyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.", "employment_type": "FULL_TIME", "date_posted": "2021-07-31T07:16:09.000Z"}, "company": {"name": "CyberCoders", "link": "https://www.linkedin.com/company/cybercoders"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}