{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "THIS IS A REMOTE POSITIONAt SailPoint, we do things differently. We understand that a fun-loving work environment can be highly motivating and productive. When smart people work on intriguing problems, and they enjoy coming to work each day, they accomplish great things together.  With that philosophy, we’ve assembled the best identity team in the world that is passionate about the power of identity.As the fastest-growing, independent identity and access management (IAM) provider, SailPoint helps hundreds of global organizations securely and effectively deliver and manage user access from any device to data and applications residing in the data center, on mobile devices, and in the cloud.The company’s innovative product portfolio offers customers an integrated set of core services including identity governance, provisioning, and access management delivered on-premises or from the cloud (IAM-as-a-service).The Cloud Governance team in SailPoint is seeking well-rounded backend or full stack engineers who are passionate about building and delivering reliable, scalable microservices for enterprise-grade, multi-tenant SaaS products.  You will be part of a growing agile team that is building modern components and services to power the next generation of Cloud Governance suite of applications. You’ll work in a team that is passionate about continuous improvement and agility in a fast-paced environment. Besides working on a tech stack that includes Go, Python, ReactJS, GraphDB, SQL and NoSQL datastores, Messaging technologies, Docker and Kubernetes, you’ll prototype new design ideas, adopt new technologies and drive them to adoption and deployment in production.ResponsibilitiesDesign, implement and deliver efficient, maintainable, robust microservices.Adopt an iterative approach to designing and implementing features based on product requirements.Work in an agile environment to collaborate with peers on designs, technical refinements, code reviews, testing and customer issues.Design, develop/ adopt testing frameworks and implement test plans to improve code quality and facilitate continuous delivery.Devise monitoring capabilities to analyze various aspects of application performance and provide robust end-user experienceRequirements5+ years of professional software development experience with progressively increasing responsibilitiesSolid understanding of object oriented principles/ design patterns with relevant experience in Go/ Java/ C++.Experience building microservices and knowledge of microservice design patterns.Experience in implementing and using RESTful APIs for an API-first application architectureExperience in using SQL or NoSQL databases in a multi-tenant SaaS applicationGreat communication skillsPreferredFront-end programming experience with ReactJS.Experience with AWS/ AzureExperience with Continuous Delivery/ Continuous IntegrationExperience with messaging technologies and event-driven designExperience with Docker, Kubernetes, ArgoCDCompensation and benefitsExperience a Small-company Atmosphere with Big-company BenefitsCompetitive pay, 401(k) with match and comprehensive medical, dental and vision plansRecharge your batteries with a flexible vacation policy and paid holidaysFantastic career growth opportunities in a fast-paced, high-growth environment.Enjoy a healthy work-life balance with flexible hours, family-friendly company events and charitable workSailPoint is an equal opportunity employer and we welcome everyone to our team.  All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-30T05:06:51.000Z"
    },
    "company": {
        "name": "SailPoint",
        "link": "https://www.linkedin.com/company/sailpoint-technologies"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}