{"location": {"country": "US", "locality": "Salem", "region": "Salem", "postal_code": "97311", "street_address": null, "latitude": 44.939014, "longitude": -123.03931}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer", "industry": "Government Administration,Information Services,Information Technology and Services", "description": "We are looking to recruit a Software Engineer\nThe Role\nTo review, analyze, and modify programming systems including encoding, testing, debugging, and installing application systems to support the needs of the Department.\nThe Ideal Candidate\nWill consult with users to identify current operating procedures and to clarify program objectives.\nMust be familiar with a variety of the field's concepts, practices, and procedures, have extensive experience and judgment to plan and accomplish goals.\nWill be required to perform tasks which include:\nAssisting with issues and remaining development related to the WebSphere Liberty 9 / Power BI Release\nAssisting with Redesign the Provider Liability Account (PLA) interface and redesign the recovery of the Personal Support Worker (PSW) PLA.\nSupporting the enhancement of the Provider page, PSW page and Electronic Visit Verification (EVV) to help track required training for PSWs\nFacilitating the creation of capability for CMEs to upload claims for Rationed Fee for Service (RFFS) billing\nFacilitating the transfer of the concepts and enhancements to existing team members to enable them to provide ongoing support\nProviding consultation to senior leadership and helping with items in the Backlog to include Critical Priority Bugs and Enhancements\nSkill and Experience:\nExperience with eXPRS application\nExpert-level knowledge and experience with WebSphere Liberty 9 and Java 11\nExpert understanding of IBM DB2 UDB systems and concepts\nProficient with Eclipse IDE Liberty 9 Plug In, Git source control concepts\nExcellent communication skills\nHighly skilled Java developer\nQualification:\nBachelor's degree in Computer Science or Information Technology or related field.\n6+years of equivalent experience in the field or a related area.", "employment_type": "CONTRACTOR", "date_posted": "2021-08-16T15:51:19.000Z"}, "company": {"name": "GeekSeatUSA", "link": "https://www.linkedin.com/company/geekseatusa"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 72, "seniority_level": "Senior"}}