{"location": {"country": "US", "locality": "Austin", "region": "Austin", "postal_code": "78746", "street_address": null, "latitude": 30.264978, "longitude": -97.7466}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Machine Learning Data Engineer", "industry": "Internet", "description": "Expected compensation: $90.00 - $110.00 per hour\nHireArt is helping Toyota Research Institute (TRI) find a Machine Learning Data Engineer to contribute to state-of-the-art machine learning data infrastructure and relevant software specific to data management, data analysis, and data mining at unparalleled scale. In this role, you'll implement robust software and data pipelines for a tremendous amount of data, and analyze large scale data for the practical scenarios of autonomous driving. Last but not least, you will deploy your algorithms and systems to explore the meaningful scenarios in TRI's data sea and beyond.\nThe ideal candidate will possess the basic requirements outlined below as well as 2+ years of experience within the autonomous vehicle industry.\nAs a Machine Learning Data Engineer, You Will\nAddress large scale challenges in the machine learning development cycle, especially around cloud and data engineering.\nManipulate high-volume, high-dimensionality, structured data from driving logs for training and testing deep networks.\nBuild a robust data platform that enables ML practitioners to build and maintain their own data pipelines and datasets.\nStay up to date on the state-of-the-art in Deep Learning ideas and software, in collaboration with other divisions in the company.\nSolve challenging problems with cutting edge design and algorithms.\nWork in a multidisciplinary team and collaborate with other teams across the company.\nRequirements\nExperience as a statistical, machine learning, and/or data engineer and a degree in Computer Science, Math, Physics or related field\nBachelor's Degree with 4+ years of experience\nMaster's Degree with 2+ years of experience\nPhD with 1+ year of experience\nSolid proficiency in Python\nStrong software engineering practices with machine learning experience in a production setting\nProficient in SQL and Git\nExperience with pipeline orchestration tooling (e.g. Airflow, AWS Step Function, Metaflow, KubeFlow, etc).\nExperience with AWS, Azure or GCP\nClear grasp on basic Linear Algebra, Optimization, Statistics, and Algorithms\nNice-to-have Experience\nExperience with data analysis, data, munging and relative machine learning skills\nExperience with building end-to-end ML workflows (Data Mining → Data Preparation → Modeling)\nStrong knowledge of ML dataset management (data + annotations) and exposure to dataset versioning tools such as DVC\nExperience with ML data annotation pipeline, RESTful APIs, Apache Spark\nExposure to perception, prediction, and/or planning stacks for robotics/AVs\nExperience in AV or Automotive industry\nCommitment:\nThis is a full-time (40 hours per week), on-going contract position staffed via HireArt and based in Los Altos, CA. This position can be fully remote and is open to U.S.-based candidates who are able to work during PST business hours. Candidates local to Los Altos, CA are encouraged to apply.\nHireArt values diversity and is an Equal Opportunity Employer. We are interested in every qualified candidate who is eligible to work in the United States. Unfortunately, we are not able to sponsor visas or employ corp-to-corp.\nTRI provides Equal Employment Opportunity without regard to the applicant's race, color, creed, gender, gender identity or expression, sexual orientation, national origin, age, physical or mental disability, medical condition, religion, marital status, genetic information, veteran status, or any other status protected under federal, state or local laws.", "employment_type": "FULL_TIME", "date_posted": "2021-07-29T11:13:32.000Z"}, "company": {"name": "Toyota Research Institute", "link": "https://www.linkedin.com/company/toyota-research-institute"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 48, "seniority_level": "Mid-Level"}}