{"location": {"country": "US", "locality": "San Diego", "region": "San Diego", "postal_code": "92161", "street_address": null, "latitude": 32.71576, "longitude": -117.16382}, "salary": {"currency": "USD", "min_value": 66900, "max_value": 123000, "unit": "YEAR"}, "job": {"title": "Software Test Engineer", "industry": "Information Technology and Services,Defense &amp; Space,Computer Software", "description": "Job Description\nMetron's ORCA division in San Diego, CA is seeking software testers to contribute to the design and development of a family of large-scale defense and homeland security simulations. The successful candidate will be responsible for testing and evaluating ORCA’s applications and systems.\nResponsibilities\nDesigning, executing, and debugging test plans of applications based on software requirements and technical specifications\nCreating test cases and validating results against functional requirements\nDetecting and identifying software failures so that defects may be discovered and corrected\nDocumenting results and generating historical analysis of applications’ state and stability\nDocumenting anomalies and defects in a maintained issue tracking database\nDeploying, operating, and maintaining application test instances and/or networks\nEnsuring compliance with general software development, testing, and maintenance best practices\nEnsuring data integrity standards\nParticipating in application planning meetings\nEvaluating software ease of usability and error handling procedures\nProviding application instructions for users\nDesired Qualifications\nBachelors Degree in Computer Science, Electrical Engineering or other related field\nMinimum 1 year of experience\nMust possess excellent written and verbal skills to communication with development team\nMust be able to work independently as well as in a team environment\nStrong knowledge of quality assurance methodologies, test plans, and debugging is required\nPrevious test automation experience is a plus\nUS CITIZENSHIP REQUIRED, position will require background investigation to authorize access to classified information\nPosition Location: Liberty Station, San Diego, CA\nAll qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or protected veteran status. Metron takes affirmative action in support of its policy to employ and advance in employment individuals who are minorities, women, protected veterans, and individuals with disabilities.\nVEVRAA Federal Contractor", "employment_type": "FULL_TIME", "date_posted": "2021-06-18T01:21:21.000Z"}, "company": {"name": "Metron, Inc.", "link": "https://www.linkedin.com/company/metron-inc-"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 12, "seniority_level": "Junior"}}