{
    "job": {
        "title": "Principal Software Engineer (Python)",
        "industry": "Broadcast Media",
        "description": "If you are a Principal Software Engineer (Python) with experience, please read on!What You Will Be DoingKey ResponsibilitiesDefine technical architecture & roadmap to realize itDeliver features on a cadence within an agile frameworkWrite code across all areas of the productDefine quality & process standardsSupport definition of user storiesWorking with product team, estimate time & resources needed to achieve goalsWhat You Need for this PositionBS in Computer Science or equivalent10+ years experience in software engineering5+ years experience with Python, including one web framework & pandas/numpy1+ years experience with React1+ years research or industry experience building ML modelsExpertise with multiple data storage platforms/architecturesExpertise in AWSStrong Unix/Linux fundamentalsNice to have: MS in Computer Science or equivalent-Nice to have: Exposure to ad tech concepts & terminology-What's In It for YouCompetitive salaryCollaborative and creative atmosphere, with inspired leadershipCareer advancement opportunitiesRecognition and reward for outstanding performance, with high bonus potentialGreat medical, dental & vision Insurance packagesCompetitive 401K with company match to plan for the long termUnlimited paid-time-offTransportation benefits & cell phone reimbursementCasual dress all day, every daySo, if you are a Principal Software Engineer (Python) with experience, please apply today!Email Your Resume In Word ToLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:Shiv.Warrier@CyberCoders.comPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : SW3-1637254 -- in the email subject line for your application to be considered.***Shiv Warrier - Sr. Executive Recruiter - CyberCodersApplicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity EmployerAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:17:56.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Alexandria",
        "region": "VA",
        "postal_code": "22336",
        "street_address": null,
        "latitude": 38.804665,
        "longitude": -77.04362
    }
}