{
    "job": {
        "title": "Embedded Engineer (Wireless/Low Power)",
        "industry": "Semiconductors",
        "description": "Job Title: Embedded Engineer   Salary Range: $140k-$175k/yr   Location: Campbell, CA   Requirements: C/C++, Wireless (BT/WiFi/Zigbee), IoT, Low Power, Semiconductor      Based in the Bay area, we are a hot IoT startup in the semiconductor industry. Due to growth, we are actively seeking to hire an Embedded Engineer to join our team in Campbell, CA. The ideal candidate will have expertise with C/C++, Wireless Technologies, and Semiconductors. Additional experience with IoT and Low Power solutions are a plus. If this sounds like you, please apply now or send your resume to shiv.warrier@cybercoders.com!      What You Will Be Doing     - Design and create software and firmware running on on-chip processors or associated host processors to enable ultra-low power wireless solutions for IoT applications   \n  - Develop products from prototype through customer deployment   \n  - Create specifications from high-level application requirements   \n  - Define software interfaces and environments   \n  - Program efficient and testable code   \n  - Develop software verification strategy and quality assurance procedures   \n  - Document and maintain software functionality      \nWhat You Need for this Position      Requirements     - Proficiency in embedded software development using C/C++   \n  - Good understanding of microcontrollers and real-time operating systems   \n  - Strong analytical skills, self-driven with a can-do attitude   \n  - BS in Computer Science or equivalent required, MS preferred      \nNice To Have     - Experience in embedded software programming for low power systems   \n  - Familiarity with Semiconductor software development process and tools   \n  - ARM architecture embedded device drivers/boot loaders   \n  - Interfaces such as UART, SPI, I2C, QSPI   \n  - Wireless protocols, such as Bluetooth, and SoC platform architectures   \n  - Audio profiles and streaming protocols      \nWhat's In It for You     - Base   \n  - Equity   \n  - Full Benefits   \n  - Opportunity for growth      \nSo, if you are a Embedded Engineer with experience, please apply today!      Email Your Resume In Word To      Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:      Shiv.Warrier@CyberCoders.com     - Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : SW3-1635733 -- in the email subject line for your application to be considered.***      \nShiv Warrier - Sr. Executive Recruiter - CyberCoders      Applicants must be authorized to work in the U.S.      CyberCoders, Inc is proud to be an Equal Opportunity Employer      All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.      Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:18:01.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Campbell",
        "region": "CA",
        "postal_code": "95009",
        "street_address": null,
        "latitude": 37.28766,
        "longitude": -121.94243
    }
}