{
    "job": {
        "title": "Sr. Software Developer (.NET)",
        "industry": "Consumer Goods",
        "description": "Headquartered in Arizona, we are a leading irrigation product development company that caters to residential and commercial customers all over the world. Currently, we are looking to expand our team in San Diego, CA and are looking for a strong Sr. Software Engineer with experience in .NET, C#, ASP.NET MVC, WinForms, and Web Development.What You Will Be DoingThe Senior Software Engineer will be responsible for the design and implementation of a multi-user Web-based software product.Design of software for central control of networked irrigation systems in geographically diverse areasDesign and development of advanced irrigation control algorithms and methodsDevelopment of virtualized cloud systems for centralizing control of multiple irrigation sites located around the worldDevelopment of both cloud-based systems and customer hosted systems using Windows IISDevelopment of .NET business objects to fulfill product requirements and Unit Tests to validate the business logicWork with the Quality Assurance group to identify and fix defectsWhat You Need for this PositionMust-Have SkillsBSCS, BSEE, or equivalent from an accredited universityProficient with C#, .NET, ASP.NET MVC, and Windows Forms5+ years of software engineering experience including experience with Web development, Windows user interface implementation, service development, and Internet communication technologiesDemonstrated on-time delivery of commercial software systemsStable work historyNice-to-have'sAngular 2+WCF, SOA, and SQL ServerExperience with PerforceNUnit or other Unit Testing experienceCloud Development experienceExperience with writing Windows code for communication interfaces with embedded firmware systemsWhat's In It for YouCompetitive Salary (DOE)BonusExcellent benefits package 401K w/ matchPTOPaid HolidaysSo, if you are a Sr. Software Engineer with .NET/C# expertise, please apply today!Email Your Resume In Word ToLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:Ashley.Upchurch@CyberCoders.comPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : RH1-1602634 -- in the email subject line for your application to be considered.***Ashley Upchurch - Lead Recruiter - CyberCodersApplicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity EmployerAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:18:31.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}