{
    "job": {
        "title": "Principal Software Engineer",
        "industry": "Financial Services,Information Technology and Services,Information Services",
        "description": "Job DescriptionThe RoleWe are seeking a Principal Software Engineer to work within a team of software engineers, analysts and product managers to develop high quality applications servicing the financial industry. You will have the opportunity to work within the Fidelity Charitable Giving Marketplace, a group that focuses on developing engaging experiences that deliver valuable services to our customers. You will be responsible for ensuring that we deliver an appealing and modern high-quality product to our customers. You would provide leadership, structure, and knowledge to our development team.Our team operates much like a start-up within Fidelity, to develop capabilities for users/participants to donate time, expertise and money to non-profit organizations.Our team has built a culture that encourages thoughtful conversations, significant dialog, deep collaboration and mutual respect towards a common goal. Team members are empowered and encouraged to share their thoughts, be themselves and bring their outstanding perspectives into the mix as we grow. We use a variety of technologies that either use your current skills or build a platform for continuing to grow by learning new technologies.The Expertise And Skills You BringBachelor’s or Master’s degree in Computer Science or a related technology field7+ years of software development experience on business critical, enterprise-wide applicationsProven experience in designing, developing, and maintaining high-volume transactional systemsProven experience in developing cloud native applications in AWS/AzureActively participates in formal reviews of architecture, design, and codePublishes clear, concise, and detailed design documentationProvides support for software releases into production environmentsProven experience with Agile and Scrum MethodologiesHands on experience with building RESTful Web Services/APIsPassion for continuous integration and continuous deliveryKnowledge of JavaScript frameworks and libraries such as Angular, RXJS, Redux patternsSophisticated developing skills in Javascript backend frameworks such as Express or NestExperience with DevOps, Continuous Integration and Continuous Delivery using AWSProven experience developing software utilizing relational databases (MySQL)Experience with Source Control Systems such as GITAn understanding of Micro-services Architecture, domain driven design patterns, and CQRSAbility to develop technical artifacts based on analysis of business and systems requirementsStrong organizational skills coupled with effective written and verbal communication skillsExcellent collaboration skills to work with multiple teams in the organizationProduce high-quality code, with high test coverage, following Fidelity processes, standards, and methodologiesExtensive experience with developing, documenting, and enforcing code patterns.You will ensure the end-to-end delivery of requirements or user stories meets the needs and expectations of our business partnersThe Value You DeliverWork with a multi-functional team to understand project objectives, use cases and systems design requirements.Development of original and creative/innovative technical solutions.Delivery of high-quality code, with high test coverage, following Fidelity standard processes and methodologiesYou look beyond individual business requirements considering the overall solutionYou are a collaborative teammate who can work independently across local and distributed teamsYou share your knowledge across the team.Actively expands and enforces development patterns across the application.Provide leadership and mentorship to the entire team.CertificationsCompany OverviewAt Fidelity Investments, our customers are at the heart of everything we do. As a privately held company with a rich 75-year history, our mission has remained the same since our founding: to strengthen the financial well-being of our clients. We help people invest and plan for their future. We assist companies and non-profit organizations in delivering benefits to their employees. And we provide institutions and independent advisors with investment and technology solutions to help invest their own clients’ money.Join UsAt Fidelity, you’ll find endless opportunities to build a meaningful career that positively impacts peoples’ lives, including yours. You can take advantage of flexible benefits that support you through every stage of your career, empowering you to thrive at work and at home. And you don’t need a finance background to succeed at Fidelity—we offer a range of opportunities for learning and growth so you can build the career you’ve always imagined. We welcome associates from different backgrounds and with different perspectives to help us innovate and make a difference for our customers and our communities.We invite you to Find Your Fidelity at fidelitycareers.com.Fidelity Investments is an equal opportunity employer. We believe that the most effective way to attract, develop and retain a diverse workforce is to build an enduring culture of inclusion and belonging.Fidelity will reasonably accommodate applicants with disabilities who need adjustments to participate in the application or interview process. To initiate a request for an accommodation, contact the HR Leave of Absence/Accommodation Team by sending an email to accommodations @fmr.com, or by calling 800-835-5099, prompt 2, option 2.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:27:08.000Z"
    },
    "company": {
        "name": "Fidelity Investments",
        "link": "https://www.linkedin.com/company/fidelity-investments"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Durham",
        "region": "NC",
        "postal_code": "27717",
        "street_address": null,
        "latitude": 35.99695,
        "longitude": -78.899025
    }
}