{"location": {"country": "US", "locality": "Grapevine", "region": "Grapevine", "postal_code": "76051", "street_address": null, "latitude": 32.93656, "longitude": -97.0867}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Analyst, ICQA", "industry": "Information Technology and Services,Retail,Financial Services", "description": "Description\nESSENTIAL JOB DUTIES AND RESPONSIBILITIES*\nEffectively identify and communicate analytical findings and trends to drive business changes that improve the customer experience and journey.\nData validation, mining, and discovery.\nPerform ad-hoc analysis and provide business leaders actionable insights as needed.\nWrite SQL queries.\nCreation of reports and dashboards utilizing Excel and Power Bi.\nCollaborate with the BI team to support reporting efforts for the ICQA team.\nIdentify and define KPIs.\nBASIC AND PREFERRED QUALIFICATIONS (EDUCATION And/or EXPERIENCE)\nBachelor’s degree in Computer Science, IT, Information Systems, Math, Statistics, or quantitative discipline with 2+ years of professional experience in Analytics/Business Intelligence.\nExperience in inventory control or fulfillment centers a plus.\nExperience working with complex data in large corporate environment a plus.\nA self-starter mentality and ability to operate within a fast-paced and ambiguous environment.\nData visualization tools such as Power BI, Tableau, and SQL.\nProficiency in SQL query building and report writing.\nStrong SQL knowledge including but not limited to; complex queries, CTEs, temp tables, stored procedures, cursors.\nAdvanced in MS Excel including VLOOKUPs, pivot tables, charts, Power Query, index matches", "employment_type": "FULL_TIME", "date_posted": "2021-08-31T00:00:51.000Z"}, "company": {"name": "GameStop", "link": "https://www.linkedin.com/company/gamestop"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}