{"location": {"country": "US", "locality": "Chicago", "region": "Chicago", "postal_code": "60654", "street_address": null, "latitude": 41.88323, "longitude": -87.6324}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Freelance Data Scientist ", "industry": "Marketing and Advertising", "description": "Data Scientist\ncloserlook is looking for an analytics professional with strong quantitative abilities, effective communication skills and an understanding of how statistics drives marketing optimization to join our rapidly expanding Analytics practice. We work in closer partnership with agency competencies (e.g. strategy, creative, account management) and with our pharmaceutical clients to measure cross-channel marketing effectiveness and fuel data-driven strategic and creative optimization. Our deliverables include:\nCross-Channel Marketing Effectiveness & ROICRM & Sales Audience Targeting\nCreative Optimization\nCross-Channel Marketing Strategy\nMeasurement and Reporting\nModeling and Segmentation\nAnalytic Software Solutions\nResponsibilities:\nDevelop predictive models that increase the efficiency and effectiveness of Client database-driven CRM initiatives.\nDevelop advanced analytic techniques such as ROI calculations, KPI forecasting and database segmentation\nRecommend and execute modeling and advanced analytic techniques that enhance client marketing intelligence\nPerform data preparation, model design, and model maintenance.\nDevelop and foster agency partnerships that fuel client value\nRequirements:\nDegree in statistics or quantitative field (e.g. engineering, computer science, math, economics, social sciences).\nComprehensive understanding of statistical techniques (linear and logistic regression, clustering, natural language process, etc.) used for modeling, segmentation, text mining and in-depth quantitative analysis.\nTechnical Knowledge: Proficient coding skills (Python, R, SQL, etc), and experience working in a Unix environment. Proficiency in database management and large datasets: create, edit, update, join, append and query data from columnar and big data platforms.\nA minimum of 1-3 years’ experience in analytics, data-science, data-driven strategy, quantitative research, and/or management consulting work\nGood understanding of cloud computing and infrastructure concepts\nExperience with one or more big data tools and technologies like Snowflake, Databricks, S3, Hadoop, Spark\nExperience working with NLP applications is a plus\nStrong communication and presentation skills\nInnovative, entrepreneurial thinker who can both develop and implement new analytic capabilities\nExperience with CRM and database marketing techniques, tools, and processes is a plus\nAgency and Client Management experience is a plus\nABOUT CLOSERLOOK, INC.\ncloserlook is a new type of marketing agency that helps biopharma brands make a difference in the lives of patients and those who care for them.\nWe focus on what matters most—the combination of better patient outcomes and bigger business impact.\nLearn more at closerlook.com\nEQUITY FOR ALL: AT THE HEART OF WHAT MATTERS\nAt closerlook, equity for all is a core value that’s at the heart of what matters. We believe in building a diverse and inclusive culture across race, age, gender identity, sexual orientation, religion, mental health, and physical ability. We celebrate our differences and champion diverse thinking to drive innovation — in a safe environment so everyone can be their authentic selves. By valuing and promoting our different backgrounds, perspectives, and experiences as strengths, we are positioned to best serve patients, healthcare professionals, and the communities around us.", "employment_type": "TEMPORARY", "date_posted": "2021-08-16T21:09:31.000Z"}, "company": {"name": "closerlook (A Member of Fishawack Health)", "link": "https://www.linkedin.com/company/closerlook-inc-"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 12, "seniority_level": "Junior"}}