{"location": {"country": "US", "locality": "New York", "region": "New York", "postal_code": "10132", "street_address": null, "latitude": 40.713047, "longitude": -74.00723}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer", "industry": "", "description": "Mid-level Software Engineer at Def Method\nNew York, NY\nAbout Def Method\nAt Def Method we believe in the integrity of our engineering, the utility of our products, and the solutions we provide for our customers. As consultants, we apply XP, agile, and user-centered design principles to help our customers large and small bring their products to life.\nValue prop of this role\nAt Def Method, you get to work on a variety of projects, solve coding challenges and work with a team of language-agnostic experts who'll have your back. You'll promote diversity, inclusion, and understanding within your team. We know you're not just hands on a keyboard. You have ideas and we'll want to hear them.\nWhat You'll Bring\nProactive and enthusiastic commitment to customer best interests and ongoing process improvement\nGeneralist flexibility to adapt to customer environments and bring consultative expertise\nEffective communication with the Def Method team and with customers, and willingness to give and receive growth-oriented feedback\n3+ years experience working with JavaScript, Ruby, Python, Java, or C#\nDesire to learn and work with a range of technologies (for example, Go, Swift, Kotlin, and Clojure)\nKnowledge of and experience with agile software development principles and associated practices (including test-driven development, pair programming, design patterns, and refactoring)\nStrengths in web development or native mobile development, with a desire to expand personal range\nHow You'll Spend Your Time\nMaking software in small teams with active customer involvement\nCollaborating with engineers, product managers, designers, and stakeholders\nHelping team members and the company as a whole improve through your input\nLearning from and with colleagues as we seek to make the best software we can\nWhy we love working here\nGreat pay and benefits — comprehensive health, dental, vision, 401(k) matching, paid parental leave, even life insurance!\nGenerous vacation and 1 month of paid time off for professional development\nVery minimal travel, if ever\nWe're community-centric and find ways to give back\nRemote first work culture\nWe promote diversity, inclusion, and understanding within our team. We constantly strive to build a company as diverse as the city we live in and the customers we support.\nThis position may be performed remotely if approved by the Company from anywhere except the State of Colorado.", "employment_type": "FULL_TIME", "date_posted": "2021-08-12T18:19:53.000Z"}, "company": {"name": "Def Method", "link": "https://www.linkedin.com/company/def-method"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}