{"location": {"country": "US", "locality": "Irvine", "region": "Irvine", "postal_code": "92717", "street_address": null, "latitude": 33.68591, "longitude": -117.82472}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Embedded Software Engineer for Medical Device - C, Startup", "industry": "Biotechnology", "description": "If you are an Embedded Software Engineer for Medical Device with experience, please read on!\nBased in Irvine, CA, we are an exciting new startup in the respiratory illness medical device space. We have a team of industry leaders and SME's on our board and it is time to bring on an Embedded Software Engineer with 5+ years of experience and strong programming in C and medical device. This is a very exciting time for us and we look forward to meeting you.\nTop Reasons to Work with Us\n--actively interviewing!--apply today!!--\nWhat You Will Be Doing\nResponsible for embedded software development in medical device.\nGenerate software requirement and verification protocol based on product requirement.\nSoftware architecture development, software implementation and verification.\nWorking with cross-functional team in medical device development and verification. Transfer design to manufacture facility.\nGenerate development record complying with medical device software regulatory requirement.\nWhat You Need for this Position\n5+ years of the experience in the following:\nC Programming\nMedical Devices\nSTM32 development and RTOS\nPrototype fabrication - conceptual design/release\nDesign - testing - documentation\nEmbedded software application development\nRespiratory Medical Device a plus\nBachelor's Degree in CS or Engineering\nWhat's In It for You\nCompetitive base salary - $130,000 - $160,000 DOE\nMedical/ dental/vision insurance\nFlexible Time Off\n....and more perks! (equity, bonus, etc.)\nSo, if you are an Embedded Software Engineer for Medical Device with experience, please apply today!\nEmail Your Resume In Word To\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nKaty.Bruce@CyberCoders.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : KB2-1643081 -- in the email subject line for your application to be considered.***\nKaty Bruce - Sr. Executive Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\nYour Right to Work\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.", "employment_type": "FULL_TIME", "date_posted": "2021-08-25T17:42:22.000Z"}, "company": {"name": "CyberCoders", "link": "https://www.linkedin.com/company/cybercoders"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}