{"location": {"country": "US", "locality": "Pleasanton", "region": "Pleasanton", "postal_code": "94588", "street_address": null, "latitude": 37.658436, "longitude": -121.877}, "salary": {"currency": "USD", "min_value": 105000, "max_value": 150000, "unit": "YEAR"}, "job": {"title": "Software Engineer - Omni-Channel Engagement", "industry": "Computer Software,Human Resources,Information Technology and Services", "description": "Do what you love. Love what you do.\nAt Workday, we help the world’s largest organizations adapt to what’s next by bringing finance, HR, and planning into a single enterprise cloud. We work hard, and we’re serious about what we do. But we like to have fun, too. We put people first, celebrate diversity, drive innovation, and do good in the communities where we live and work.\nAbout the Team\nWe are responsible for delivering tens of billions of messages annually via multiple channels (Email, SMS, Mobile Push, ..). Our team is building the next generation Communication platform to deliver the right message to the right person at the right time, to the channels that can get the most engagement value.\nAbout the Role\nDo you want to get into the details as needed to work directly with developers writing code and/or to spike concepts and ideas? Do you believe that mentoring is an important contribution to the long-term success of the team?\nYou will distill and adapt complex, nuanced technical / architectural concepts for audiences ranging from new college hires to senior management and think about the operational and security side of the software and don't simply believe that software in production is someone else's problem.\nCraft and build REST APIs, highly scalable collaboration platform and features\nCollaborate in a small team using your engineering background to get work done !\nExert your independence and ability to learn unfamiliar technology\nBuild and maintain robust and quality code and reliable automated tests\nAbout You\nWhat we are looking for:\nBachelor's Degree or higher, preferably Computer Science/Engineering major.\nYou have experience owning production systems\nExperience developing cloud software services and an understanding of design for scalability, performance and reliability, and tradeoffs therein\nExtensive experience developing distributed and concurrent systems; secure, fault tolerant, highly available, recoverable, consistent, scalable, and predictable and the tradeoffs therein\nQualifications\n2+ Years of development in object oriented design (Java)\nPrevious experience developing in an Agile/Scrum environment\nA love for learning and a passion for helping others !\nReact and NodeJS experience a plus\nWorkday is an Equal Opportunity Employer including individuals with disabilities and protected veterans.", "employment_type": "FULL_TIME", "date_posted": "2021-08-20T00:00:54.000Z"}, "company": {"name": "Workday", "link": "https://www.linkedin.com/company/workday"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}