{"location": {"country": "US", "locality": "New York", "region": "New York", "postal_code": "10132", "street_address": null, "latitude": 40.713047, "longitude": -74.00723}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Executive Assistant to the C-Suite", "industry": "Computer Software", "description": "Materialize is the streaming SQL database company that makes it easy for any developer or analyst to understand streaming data, answer complex questions and build intelligent applications using standard technology. Whether it's delivering personalized experiences, accurately identifying fraud, building predictive AI, or discovering new business opportunities, the ability to run complex queries on multiple streams of data and keep their answers up to date is critical to making better decisions about the changing world around us.\nWho We Are:\nThe Materialize team includes engineers who were early employees of Cockroach Labs, Datadog, Dropbox, Pure Storage, and YouTube. Our work builds on top of Timely Dataflow and Differential Dataflow, both created by our co-founder Frank McSherry, a world-leading computer scientist with decades of award-winning research in all aspects of data.\nInvestors:\nKleiner Perkins and Lightspeed Venture Partners. Additional investors include executives from Cockroach Labs, Datadog, and Rubrik.\nPosition\nExecutive Assistant to the C-Suite:\nArjun Narayan, Co-Founder and CEO\nFrank McSherry, Co-Founder and Chief Scientist\nCuong Do, VP of Engineering\nLocation\nNew York, NY\nCompensation\nBase + Equity\nWhat You'll Do\nEA responsibilities to the C-Suite include a wide variety of tasks that facilitate Materialize leadership's ability to effectively lead the organization:\nManage, coordinate, and prioritize all meetings on executive calendars including but not limited to 1:1s, team meetings, offsites, board meetings, customer meetings, and speaking engagements.\nPartner with the executive team in reading and routing emails, drafting letters and documents.\nAssist executive team with administrative tasks like expense reporting and keeping up with compliance requirements.\nEnsure the executive team is prepared for upcoming meetings, presentations, and projects by gathering materials necessary from internal and external team members.\nEnsure legal documents are reviewed by the appropriate party and signed by executives in a timely manner.\nArrange and execute C-Suite team building, offsites, and social events/lunches.\nPlan and coordinate executive travel.\nWork cross-functionally to ensure communication is efficient and clear between executive team members and internal and external teams.\nSpecial projects as assigned.\nWho You Are\nYou have 3-5 years of experience in an Executive Assistant role.\nYou may have experience working at an early-stage startup, on a growing team, or in a fast-paced work environment.\nYou are highly motivated and passionate about our company.\nYou are organized, with strong attention to detail.\nYou are proactive, able to work independently, and prioritize tasks with minimal supervision.\nYou have terrific written and verbal communication skills, enabling you to communicate with high-level executives and investors.\nYou are flexible, with an appreciation for the challenges of supporting an evolving team with varied personalities.\nYou can multitask, handling multiple assignments from multiple executives at any given time while anticipating the needs of others.\nYou are able to operate with discretion when dealing with confidential information.\nWhat We Offer\nCompetitive medical, vision, and dental insurance coverage\nCommuter Benefits\nDisability, Life and AD&D Insurance\nTuition reimbursement\n401(k)\nCiti Bike Membership\nVacation and Sick Leave\nCharity Match Program\nWe understand it takes a diverse team of highly intelligent, passionate, curious, and creative people to develop the exceptional product we are building. Our dynamic team has incredible perspectives to share, just as we know you do, and we take great pride in being an equal opportunity employer.", "employment_type": "FULL_TIME", "date_posted": "2021-07-30T05:18:18.000Z"}, "company": {"name": "Materialize", "link": "https://www.linkedin.com/company/materializeinc"}, "education": {"required_credential": "associate degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}