{
    "job": {
        "title": "Data Analyst",
        "industry": "Information Technology and Services",
        "description": "Technical Business / Data&amp;nbsp;AnalystFull Time - NO C2C   We are looking for a Med 4 - 5 years of experienced and versatile Technical Business / Data Analyst to improve our information technology systems. To ensure success as a Technical Business Analyst, you should demonstrate experience and creativity in data analysis and data-oriented system development. Outstanding Technical Business / Data Analysts combine their IT expertise with in-depth business knowledge.   Technical Business Analyst Responsibilities:  - Performing system and data analyses on software programs, databases, data pipelines, applications, and web services.   \n  - Design test plans, scenarios, and scripts in order to conduct quality assurance testing.   \n  - Develop user stories and maintaining the backlog in an Agile environment   \n  - Develop automation scripts and reporting systems.   \n  - Translate business requirements into technical requirements, including SQL queries.   \n  - Working with both business and technical resources, often acting as a liaison   \n  - Efficiently integrating new systems, programs, and applications with business operations and services.   \n  - Determining system efficiency and functionality by liaising with all stakeholders.   \n  - Analyzing and improving the performance of data-oriented services.   \n  - Ensuring end-user proficiency with new systems, programs, and applications across departments.   \n  - Promoting system efficiency and security by integrating performance metrics and encryption.   \n  - Implementing new advancements in the field of system and enterprise architecture.   \n   Technical Business Analyst Requirements:  - Must have experience working within the financial/banking industries or manufacturing/supply chain industries   \n  - A Bachelor's Degree in Computer Science, Information Technology, Information Systems or similar field.   \n  - 4 years of directly related experience in database management systems, data analysis, data pipelines, and data-oriented quality assurance testing.   \n  - Extensive experience in all phases of the software development life cycle (SDLC).   \n  - Advanced knowledge of programming languages like SQL and system integration solutions.   \n  - Experience working with data analysis on cloud platforms like Azure and AWS   \n  - Experience with database technologies such as NoSQL, Cosmos DB, MongoDB.   \n  - Nice to have – knowledge / exposure to Azure services like – Logic Apps, Service Bus, Azure Data Factory, Azure Data Catalog and Storage Explorer   \n  - Exceptional written and oral communication skills.   \n  - Expert level skills with MS Excel and PowerPoint   \n  - Ability to facilitate internal, team and client meetings to achieve their objectives.   \n  - Ability to keep up with IT advancements.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T03:15:01.000Z"
    },
    "company": {
        "name": "WorldLink US",
        "link": "https://www.linkedin.com/company/worldlink-inc."
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Texas",
        "region": "United States",
        "postal_code": "76522",
        "street_address": null,
        "latitude": 31.463793,
        "longitude": -99.333275
    }
}