{
    "job": {
        "title": "Fullstack Engineer - Financial Services - Consulting - Manager (Open Location)",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all.FULLSTACK ENGINEER - FINANCIAL SERVICES - CONSULTING - MANAGER (OPEN LOCATION) - HOBOKEN (PRIMARY), NYC, PHILADELPHIA, MCLEAN, ATLANTA, CHICAGO, CHARLOTTE, DALLAS, PHOENIXEY is the only professional services firm with a separate business unit (“FSO”) that is dedicated to the financial services marketplace. Our FSO teams have been at the forefront of every event that has reshaped and redefined the financial services industry. If you have a passion for rallying together to solve the most complex challenges in the financial services industry, come join our dynamic FSO team! The opportunity   The Digital & Emerging Technology team works collaboratively with clients to transform their business through disruptive innovation enablement and transformational design solutions. The team supports our clients in modernizing systems, processes and products to enhance business and customer-facing platforms and services to support high performance in a rapidly changing and competitive environment. Our team helps clients sustain competitive advantage and profitability by developing technology strategies, products, and solutions to stay ahead of the rapid pace of change and disruption and supporting the execution of complex transformations.We are looking for Fullstack Engineers who have worked with modern software solutions including node.js, REST APIs, and cloud-based Solutions. While our teams primary focus is within the financial services industries, you will have opportunities to support other sectors including healthcare, automotive, high-tech, and media.  Your Key ResponsibilitiesThe goal is to support our clients to transform their business through technology. As a Fullstack Engineer you will be responsible for analyzing, designing, developing, integrating, testing, and deploying new and existing software application programs. You will deliver high quality systems with focus on reliability and excellent customer experience.Skills And Attributes For SuccessAbility to multitask and work in a fast-paced, collaborative team environment Ability to travel in accordance with client and other job requirements Excellent written and oral communication skills; writing, publishing and conference-level presentation skills a plus To qualify for the role you must have Bachelor’s degree in Computer Science or other related field A minimum of 5 years’ experience in technology or a similar role Advanced knowledge of Java 1.7 and above. Python is a plus. Intermediate knowledge of a Java framework (preferably Spring) Experience in designing, building and consuming RESTful APIs Hands-on experience building applications/platforms with cloud native/Microservices architecture. Includes experience with IaaS, PaaS, container deployment. Proficiency in Angular 2, React.JS, TypeScript, Node.JS, Redux, Flux and related frameworks Experience with modern collaborative development tools (e.g. Git, CI/CD pipelines) Comfortable working in an Agile and TDD environment Design & architecture large business critical systems Ideally, you’ll also have Experience with the following technologies:Java Javascript Kafka/RabbitMQ ElasticSearch Akka/Scala AngularJS/ReactJS Hadoop/Spark/Flume Mongo/Cassandra/Any NoSQL DB What We Look For  We’re interested in highly motivated talented individuals with a strong willingness to think outside of the box.  You can expect plenty of autonomy in this role, so you’ll need the motivation to take initiative and seek out opportunities to improve our current relationships and expand our business in the evolving market.  If you’re serious about consulting and ready to take on some of our clients’ most complex issues, this role is for you.What We OfferWe offer a competitive compensation package where you’ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you’ll decide how much vacation time you need based on your own personal circumstances. You’ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being. Continuous learning: You’ll develop the mindset and skills to navigate whatever comes next. Success as defined by you: We’ll provide the tools and flexibility, so you can make a meaningful impact, your way. Transformative leadership: We’ll give you the insights, coaching and confidence to be the leader the world needs. Diverse and inclusive culture: You’ll be embraced for who you are and empowered to use your voice to help others find theirs.If you can demonstrate that you meet the criteria above, please contact us as soon as possible.The exceptional EY experience. It’s yours to build.EY | Building a better working worldEY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.Enabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.Working across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.EY is an equal opportunity, affirmative action employer providing equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, national origin, protected veteran status, disability status, or any other legally protected basis, in accordance with applicable law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T03:07:51.000Z"
    },
    "company": {
        "name": "EY",
        "link": "https://uk.linkedin.com/company/ernstandyoung"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60607",
        "street_address": null,
        "latitude": 41.87659,
        "longitude": -87.653305
    }
}