{"location": {"country": "US", "locality": "Livermore", "region": "Livermore", "postal_code": "94551", "street_address": null, "latitude": 37.675915, "longitude": -121.758865}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Sr. Software Engineer - Embedded", "industry": "Electrical/Electronic Manufacturing", "description": "Do you want to design software for electric vehicles? If so, and you enjoy working with a great, small team of engineers, we may have the job for you!\nWe are looking for a Senior Embedded Software Engineer to architect, design, code and debug real-time embedded firmware for electric motor controllers/inverters.\nWhat you’ll do:\nWork with motor control engineers to realize effective and efficient real-time software and control algorithms.\nFollow software development cycles, including software requirements capture and verification of software to these requirements.\nParticipate in the preparation of development specifications.\nDesign, setup and run tests to ensure the design meets specifications.\nDebug systems from prototypes, development, and customer returns.\nProvide support to continuation engineering and other Curtis engineering teams.\nParticipate in software design, electrical schematic and project reviews.\nWork within a small design team to complete assigned objectives.\nCollaborate with Curtis engineering sites around the world.\nWe are interested in hearing from you if you possess the following:\nBachelor’s degree plus 5+ years of experience in embedded, real-time software.\nExpert in real-time software programming using high level languages.\nExpert user of emulators, in-circuit testing and software debugging tools/techniques.\nExperience with serial communication protocols using CAN, for example CANopen, J1939, UDS, etc.\nKnowledge of real-time operating systems and task schedulers.\nNice to have:\nKnowledge of control and feedback systems for power and motor control.\nKnowledge of electronic circuits and implementation.\nExperience with Model-based design (MBD).\nExcellent interpersonal skills.\nEffective verbal and written communication skills.", "employment_type": "FULL_TIME", "date_posted": "2021-08-25T17:34:02.000Z"}, "company": {"name": "Curtis Instruments, Inc.", "link": "https://www.linkedin.com/company/curtis-instruments"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}