{"location": {"country": "US", "locality": "Alexandria", "region": "Alexandria", "postal_code": "22336", "street_address": null, "latitude": 38.804665, "longitude": -77.04362}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Full Stack Software Engineer - 100% Remote", "industry": "Financial Services", "description": "Title: Full Stack Software Engineer\nLocation: 100% Remote\nFull time/Direct Hire\nWhat We're Looking For\nWe are looking for someone who takes pride in the craft and wants to be part of a team of talented engineers working to further Till's growth. You'll partner with engineering teams, product managers, analysts, and customer success to design, build, and maintain our technology platform.\nResponsibilities\nOwn one or multiple projects from start to finish and be guided by the support of a dedicated manager, mentor or lead engineer\nParticipate in daily team processes and learn all aspects of the software development lifecycle\nTrack data that will allow us to better understand how we can improve our products\nLearn about the business and engineering practices\nIncrementally increased the quality and reliability of our payment processing system\nAbout You\nExcellent written and verbal communication and interpersonal skills, able to effectively collaborate with technical and business partners\nHave the ability to learn quickly\nEnjoy working independently and as part of a team\nPossess the ability to solve real-time technology problems\nAre a self-starter and possess strong sense of self-motivation\nAre selfless. Ideas don't have to originate from you in order for you to commit to a path forward\nValue ownership and autonomy\nFluency in at least one non-Bash programming language such as Python, Ruby, Go, JavaScript / Node.js, Java, C#, or C/C\nExperience with (or a willingness to learn) at least one major front end development framework React, Vue, Angular)\nExperience with at least one cloud platform such as AWS, Azure, or GCP\nBonus Points\nExperience with CloudFormation or Terraform\nFamiliarity with at least one CI / CD tool such as Harness, GitHub Actions, Spinnaker, Jenkins, or CircleCI\nExperience with at least one log/metrics/alerting tools such as DataDog, Sumologic, FluentD, Prometheus, ELK, or Splunk\nExperience with DynamoDB, Security Scanning Tools, AWS Multi-Region configuration, Snowflake\nOur Tech Stack\nExperience with some of these would be helpful. We'll teach you the rest!\nAWS Lambda | DynamoDB | ECS | Docker | SQS | CloudFormation JavaScript | Python\nVue.js\nSnowflake\nBenefits\nHealth insurance with 100% premium covered for employee Flexible/Untracked PTO / sick leave\nChild care and health FSA\nPaid parental leave\n401K\nInterested candidate please send your latest resume at\nsarath@mindsource.com", "employment_type": "FULL_TIME", "date_posted": "2021-08-20T00:31:43.000Z"}, "company": {"name": "MindSource", "link": "https://www.linkedin.com/company/mindsource"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}