{"location": {"country": "US", "locality": "Dripping Springs", "region": "Dripping Springs", "postal_code": "78620", "street_address": null, "latitude": 30.190702, "longitude": -98.087494}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Dripping Springs CFT - Cross Functional Rep - Part-Time", "industry": "Food &amp; Beverages,Food Production,Retail", "description": "Would you rather do something different every day? H-E-B needs energetic and motivated Partners willing to work hard and have fun while providing superior customer service. No matter what background you bring, or where you are in your career, we welcome you to join our community where People come first.\nAs a Cross-Functional Representative, you'll provide general customer service, checking on the front end, and work across multiple departments in packaging, stocking, rotation, production, and sanitation duties.\nOnce you're eligible, you'll become an Owner in the company, so we're looking for commitment, hard work, and focus on quality and Customer service. 'Partner-owned' means our most important resources--People--drive the innovation, growth, and success that make H-E-B The Greatest Omnichannel Retailing Company.\nDo You Have a\nHEART FOR PEOPLE... commitment to provide superior Customer Service?\nHEAD FOR BUSINESS... a strong sense of how what you do affects Customers and our success?\nPASSION FOR RESULTS... initiative to step up and do what needs doing, with an eye for detail?\nWe Are Looking For\na high school diploma; some H-E-B experience\ncustomer service and interpersonal skills\nWhat is the work?\nCustomer Service / Sales / Stocking\nProvides excellent customer service; answers customer questions regarding products, take orders, assists with product selection\nUses suggestive selling techniques to meet customer needs and build department sales\nMay make regular product announcements to inform customers\nWorks a flexible schedule to accommodate shifts of different departments\nPerforms duties in multiple departments, to include technical or perishable areas such as bakery, floral, market, etc.\nPerforms stocking and replenishment, product returns and rotation, product selection, service support, inventory accuracy, and additional duties across total Store, in multiple departments\nBuilds, stocks, and maintains displays and fixtures\nAssists with inventory control; loads, unloads, and moves product\nSlices, packages, labels, rotates, merchandises, culls, and prices product\nGains knowledge of multiple departments; applies understanding of processes / policies\nComplies with Store and department SOPs, policies, and applicable laws\nFor the Service cross functional team, works as a Checker when not performing Cross Functional duties\nFood Safety / Sanitation\nEnsures compliance with departmental / Store SOPs for food safety and sanitation\nProperly operates and maintains all equipment\nCleans / sanitizes sales floor, display cases, prep areas, and equipment\nWhat is your background?\nMinimum age 18 (mandatory)\nHigh school diploma, or equivalent\n6+ months of experience in H-E-B Store operations\nCompletion of Company Orientation and Safety Training\nDo you have what it takes to be a fit as an H-E-B Cross-Functional Representative?\nKnowledge of computer systems (Symbol, ACR, label machine)\nCustomer service and interpersonal skills\nVerbal / written communication and reading skills\nAbility to adapt to performing a wide range of duties across multiple departments\nAbility to work autonomously\nCan you...\nFunction in a fast-paced, retail environment, requiring detailed and precise tasks\nWork with Customers, staying attentive to their needs\nWork flexible schedules to accommodate differing department shifts\nPerform the following, based on your Department\nBakery\nConstantly* reach at waist, grasp\nFrequently stand, walk, reach at shoulder, bend\nOccasionally sit, reach overhead, reach at knee, reach at floor, stoop, squat, crouch, kneel, stair climb, pivot, twist, push / pull with arms, pinch, perform fine motor movements, shoulder abduction\nOccasionally be exposed to wet, cold, hot conditions, loud noise\nDemonstrate the ability to lift 50 lbs, and manage in excess of 70 lbs**\nDairy / Frozen / Grocery / Market\nConstantly* reach at waist, grasp\nFrequently stand, walk\nOccasionally reach overhead, reach at shoulder, reach at knee, reach at floor, bend, stoop, squat, crouch, kneel, stair climb, pivot, twist, push / pull with arms, pinch, perform fine motor movements\nOccasionally be exposed to wet, cold conditions, loud noise\nDAIRY: Demonstrate the ability to lift 40 lbs, and manage in excess of 85 lbs**\nFROZEN: Demonstrate the ability to lift 60 lbs, and manage in excess of 75 lbs**\nGROCERY: Demonstrate the ability to lift 50 lbs, and manage in excess of 80 lbs**\nMARKET: Demonstrate the ability to lift 40 lbs, and manage in excess of 40 lbs**\nDeli\nConstantly* reach at waist, grasp\nFrequently stand, walk, stoop\nOccasionally reach overhead, reach at shoulder, reach at knee, reach at floor, bend, squat, crouch, kneel, stair climb, pivot, twist, push / pull with arms, pinch, perform fine motor movements\nOccasionally be exposed to wet, cold, hot conditions, loud noise\nDemonstrate the ability to lift 55 lbs, and manage in excess of 65 lbs**\nCosmetics / Drugstore / General Merchandise\nConstantly* reach at waist, grasp\nFrequently stand, walk\nOccasionally reach overhead, reach at shoulder, reach at knee, reach at floor, bend, stoop, squat, crouch, kneel, stair climb, pivot, twist, push / pull with arms, pinch, perform fine motor movements\nOccasionally be exposed to wet conditions, loud noise, ambient temperatures\nCOSMETICS: Demonstrate the ability to lift 45 lbs, and manage in excess of 45 lbs**\nDRUGSTORE: Demonstrate the ability to lift 15 lbs, and manage in excess of 15 lbs**\nGM: Demonstrate the ability to lift 50 lbs, and manage in excess of 45 lbs**\nFloral\nConstantly* reach at waist, grasp\nFrequently stand, walk\nFrequently be exposed to cold conditions\nOccasionally reach overhead, reach at shoulder, reach at knee, reach at floor, bend, stoop, squat, crouch, kneel, stair climb, ladder climb, pivot, twist, push / pull with arms, pinch, perform fine motor movements\nOccasionally be exposed to wet, cold, hot conditions, loud noise\nDemonstrate the ability to lift 55 lbs, and manage in excess of 45 lbs**\nGas Station\nConstantly* sit, reach at waist\nFrequently grasp\nOccasionally stand, walk, reach overhead, reach at shoulder, reach at knee, reach at floor, bend, stoop, squat, crouch, kneel, stair climb, pivot, twist, push / pull with arms, pinch, perform fine motor movements\nDemonstrate the ability to lift 40 lbs, and manage in excess of 40 lbs**\nProduce\nConstantly* reach overhead, reach at shoulder, reach at waist, pivot, grasps\nFrequently walk, reach at knee, reach at floor, stoop, squat, twist, push / pull with arms, pinch, perform fine motor movements\nOccasionally stand, bend, crouch, kneel, stair climb\nOccasionally be exposed to wet, cold, hot conditions, loud noise\nDemonstrate the ability to lift 60 lbs, and manage in excess of 75 lbs**\nSeafood\nConstantly* reach at waist\nFrequently stand, walk, pivot, push / pull with arms, grasp\nFrequently be exposed to wet and cold\nOccasionally reach overhead, reach at shoulder, reach at knee, reach at floor, bend, stoop, squat, crouch, kneel, stair climb, twist, pinch, perform fine motor movements, cervical flexion\nOccasionally be exposed to hot conditions, loud noise, ambient temperatures\nDemonstrate the ability to lift 50 lbs, and manage in excess of 25 lbs**\nService\nConstantly* stand, walk, reach at waist, grasp\nOccasionally reach overhead, reach at shoulder, reach at knee, reach at floor, bend, stoop, squat, crouch, kneel, stair climb, pivot, twist, push / pull with arms, pinch, perform fine motor movements\nOccasionally be exposed to cold, hot, loud noises, ambient temperatures, wet conditions\nDemonstrate the ability to lift 50 lbs, and manage in excess of 30 lbs**\nShelf Edge\nConstantly* reach at waist, grasp\nFrequently stand, walk\nOccasionally sit, reach overhead, reach at shoulder, reach at knee, reach at floor, bend, stoop, squat, crouch, kneel, stair climb\nH-E-B Job Title\nCross Functional Rep\nShift\nVariable Hours\nSchedule\nPart-time\nPrimary Location\nUS-TX-Dripping Springs\nUnposting Date\nAug 11, 2021, 11:59:00 PM", "employment_type": "PART_TIME", "date_posted": "2021-08-03T03:25:29.000Z"}, "company": {"name": "H-E-B", "link": "https://www.linkedin.com/company/heb"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 6, "seniority_level": "Junior"}}