{"location": {"country": "US", "locality": "Cincinnati", "region": "Cincinnati", "postal_code": "45202", "street_address": null, "latitude": 39.10685, "longitude": -84.5111}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Sr Cloud Data Engineer", "industry": "Information Technology and Services,Banking,Financial Services", "description": "Make banking a Fifth Third better®\nWe connect great people to great opportunities. Are you ready to take the next step? Discover a career in banking at Fifth Third Bank.\nGeneral Function\nThe data engineer designs and builds platforms, tools, and solutions that help the bank manage, secure, and generate value from its data. The person in this role creates scalable and reusable solutions for gathering, collecting, storing, processing, and serving data on both small and very large (i.e. Big Data) scales. These solutions can include on-premise and cloud-based data platforms, and solutions in any of the following domains ETL, business intelligence, analytics, persistence (relational, NoSQL, data lakes), search, messaging, data warehousing, stream processing, and machine learning. Ideal experience will include experience with Containerization ( Kubernetes ) and hands on work with Snowflake , Kafka, or NiFi.\nResponsible and accountable for risk by openly exchanging ideas and opinions, elevating concerns, and personally following policies and procedures as defined. Accountable for always doing the right thing for customers and colleagues, and ensures that actions and behaviors drive a positive customer experience. While operating within the Bank's risk appetite, achieves results by consistently identifying, assessing, managing, monitoring, and reporting risks of all types.\nEssential Duties And Responsibilities\nResponsible for design, Development, and Support of data solutions, APIs, tools, and processes to enable rapid delivery of business capabilities.\nWork closely with IT application teams, Enterprise architecture, infrastructure, information security, and LOB stakeholders to translate business and technical strategies into data-driven solutions for the Bank.\nAct as a technical Expert addressing problems related to system and application design, performance, integration, security, etc.\nConduct research and Development based on current trends and technologies related to the banking industry, data engineering and architecture, data security, and related topics.\nEvaluate software products and Provide documented recommendations as needed.\nProvide Support and troubleshooting for data platforms. Must be willing to Provide escalated on-call Support for complicated and/or critical incidents.\nParticipate in the planning process for hardware and software.\nPlan and work on internal projects as needed, including legacy system replacement, Monitoring and analytics improvements, tool Development, and technical documentation.\nProvide technical guidance and mentoring for other team members.\nManage and prioritize multiple assignments.\nMinimum Knowledge, Skills And Abilities Required\nBachelor's degree in Computer Science/Information Systems or equivalent combination of education and experience.\nExperience d with Object oriented programming ( Java and/or Python ) and API development ( Rest )\nExperience with build automation and orchestration tools such Jenkins , Teamcity, Bamboo, etc.\nExperience with Terraform , Chef, Ansible and / or Puppet\nExperience with building and maintaining CI/CD pipelines\nDeep understanding of source code versioning systems ( Github strongly preferred)\nHands on experience with Snowflake , Kafka, or NiFi\nExperience with Containerization ( Kubernetes )\nMust be able to communicate ideas both verbally and in writing to management, business and IT sponsors, and technical resources in language that is appropriate for each group.\nSolid conceptual understanding of distributed computing principles.\nAt least 2 years in a hands-on data engineering experience.\nExperience with AWS or Azure Cloud technologies\nHands on experience with Snowflake\nSignificant experience with at least one major RDBMS product.\nWorking knowledge of application and data security concepts, best practices, and common vulnerabilities.\nFinancial industry experience is a plus.\nSr Cloud Data EngineerLOCATION -- Cincinnati, Ohio 45202\nFifth Third Bank, National Association is proud to have an engaged and inclusive culture and to promote and ensure equal employment opportunity in all employment decisions regardless of race, color, gender, national origin, religion, age, disability, sexual orientation, gender identity, military status, veteran status or any other legally protected status.", "employment_type": "FULL_TIME", "date_posted": "2021-08-31T00:40:09.000Z"}, "company": {"name": "Fifth Third Bank", "link": "https://www.linkedin.com/company/fifth-third-bank"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}