{"location": {"country": "US", "locality": "Los Angeles Metropolitan Area", "region": "Los Angeles Metropolitan Area", "postal_code": "90021", "street_address": null, "latitude": 34.073666, "longitude": -118.23985}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer", "industry": "Computer Networking", "description": "CENIC's\nSoftware Engineers\ndesign, build, and implement robust software solutions to advance CENIC’s organizational goals and objectives, including support of the CENIC network. This position provides advanced-level programming expertise for a variety of system integrations, tools development, software support, and troubleshooting activities. The ideal candidate will be responsible for developing high-quality applications. They will also be responsible for designing and implementing testable and scalable code.\nKey Success Factors\nExperience with and strong understanding of object-oriented design principles\nStrong interpersonal skills and ability to work well in a diverse team-oriented environment\nAdept at understanding technical information and learning new concepts\nStrong interest in learning about networking concepts and technologies\nResponsibilities\nDevelop quality software applications\nAnalyze and maintain existing software applications\nDesign highly scalable, testable code\nDocument code consistently throughout the development process\nIdentify, troubleshoot, and resolve problems relating to internal mission-critical software applications\nWork with stakeholders to define requirements and implement software used to instrument, manage, and troubleshoot large-scale diverse networks\nUse robust and secure software development principles: robust exception-handling, input validation, proper application and use of cryptographic algorithms and libraries, proper handling of concurrency issues\nQualifications\n5+ years of full-time software engineering experience\nProficiency in at least one backend server language such as\nJava\n,\nScala\n,\nGo\n, or\nPython\n(we use\nPython\n)\nProduction experience with database systems -\nSQL\nand/or\nNoSQL\n(we use\nPostgres\n,\nElasticSearch\n)\nExperience working in\nAgile\nand\nSCRUM\nmethodologies\nExperience working with\nCI/CD\ntools\nExperience working with package managers such as\nMaven\n,\nPyPI\n, and\nNPM\nExperience working with version control systems (we use\ngit\n)\nExperience working with a major cloud platform (\nAWS\npreferred)\nFamiliarity with\nDocker\nand container orchestration systems\nFamiliarity with\nAPIs\nand\nmicroservices\nAbout CENIC\nJoin the team that\nconnects California to the world\n— advancing education and research statewide by providing the world-class computing network essential for innovation, collaboration, and economic growth. Our organization operates the California Research and Education Network (CalREN), a high-capacity computer network with more than 8,000 miles of optical fiber. The network serves over 20 million users across California, including the vast majority of K-20 students together with educators, researchers, and individuals at other vital public-serving institutions.\nWhy work at CENIC?\nCompany Culture:\nSmall teams and a collaborative environment provide the opportunity to make a large impact in a small organization.\nWorkplace Flexibility:\nWe understand that the world is changing and we're open to remote and hybrid work options.\nCommunity Engagement:\nWe work with research and education institutions in the largest state economy in the United States. The work you do has meaning.\nHealth Benefits:\nWe have generous medical benefits as well as dental, vision, and life insurance.\nPaid Time Off:\nWe offer liberal vacation, holiday, and sick leave.\nInvestment in Your Future:\nCENIC contributes to your 403(b) even if you don't. We also offer matching contributions on top of that.\nApplicants must be currently authorized to work in the United States on a full-time basis.\nLocation\nCENIC has two California offices, the home office in La Mirada and a smaller office in Berkeley. This position is based out of our La Mirada office. Please note due to COVID-19 this position is temporarily remote and not expected to be back in the office until conditions in the state of California improve.", "employment_type": "FULL_TIME", "date_posted": "2021-08-05T16:54:56.000Z"}, "company": {"name": "CENIC", "link": "https://www.linkedin.com/company/cenic"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}