{"location": {"country": "US", "locality": "Denver", "region": "Denver", "postal_code": "80247", "street_address": null, "latitude": 39.738453, "longitude": -104.984856}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "A01 - Software Engineer II - Cleared", "industry": "Information Technology and Services,Computer Software,Computer &amp; Network Security", "description": "We are looking for a\nfully cleared\nassociate software engineer with experience developing web-based UIs.\nRequirements\nTS/SCI with poly required\nA minimum of seven (7) years experience in software engineering/development and/or systems engineering/analysis.\nA Bachelors degree in engineering, computer science, mathematics, or related discipline may be substituted for three (3) years of work experience.\nA Masters degree in any of the above disciplines may be substituted for an additional two (2) years of experience.\nMust possess experience in all phases of software engineering to include requirements analysis, development, testing and integration, maintenance and problem diagnosis/resolution and/or experience in phases of applications systems analysis to include evaluation and design, integration and optimization of complex systems.\nMust have experience with communication applications, database management, use of programming languages and knowledge of storage and retrieval methods.\n7+ years of experience in the following\nUI Frameworks (Kendo, Sencha, JQuery, NodeJS, etc)\nJavaScript\nHTML5/CSS\nJava\nUnix/Linux\nWeb Services\nHas performed new development and Dev Ops\nApache Nifi\nC++\nScripting (Python, Perl)\nDesired Skills\nResponsible for developing applications software for small to highly complex computer systems or portions of large integrated systems and/or for providing analysis and engineering of functional aspects of software and hardware architecture and system support.\nThe candidate will prepare detailed specifications from which software products will be designed and/or candidate will translate documented designs into software products by developing, documenting, testing and debugging code.\nApplications generally deal with utility programs, job control language, macro, subroutines and other control modules.\nCandidate shall be competent to work at the highest level of all phases of software engineering and/or all phases of applications systems analysis with minimal direction or oversight.\nBenefits\nHealth & Life Insurance\nDental Insurance\nDisability Insurance\n401K Retirement Plan with Matching\nTuition Assistance\nVacation and Sick Leave\nHiring Bonuses\nReferral Recruitment Program", "employment_type": "FULL_TIME", "date_posted": "2021-06-26T03:27:33.000Z"}, "company": {"name": "NiSUS Technologies Corporation", "link": "https://www.linkedin.com/company/nisus-technologies-corporation"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 84, "seniority_level": "Senior"}}