{"location": {"country": "US", "locality": "Jersey City", "region": "Jersey City", "postal_code": "07306", "street_address": null, "latitude": 40.717495, "longitude": -74.04411}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Site Reliability Engineer", "industry": "", "description": "Role: Site Reliability Engineer - Kubernetes\nLocation: Dallas or Jersey City,NJ\nDirect hire position\nExp: 6+ YEARS\nMUST BE USC or GC\nSummary\nWe are looking for a Container migration SRE, who understands the enterprise containers in Docker Swarm to advanced Kubernetes platforms (OpenShift, Tanzu) deployments and has prior experience with container migrations and deployments. The container migration SRE will bring in Kubernetes deployment with software engineering SRE standard methodologies. This role will be instrumental in continuing our Container First strategy delivery, bringing expertise with, development, and implementation of container migration projects.\nYour Primary Responsibilities\nLead the container platform ecosystem\nCluster capacity management and provisioning through automation of underlying hosts.\nUnderstanding the infrastructure components (server, network, storage, firewall, load balancer etc) required for Kubernetes platform, Infrastructure As a Code(IaC).\n[Developer Differentiator]\nExperience with a modern application software language; especially a systems programming language (Go, Python)\nUnderstanding of architectural patterns; Microservices are important, but experience with other patterns helpful\nPractitioner of version control; experience with different branching strategies (and understands why GitFlow is not a good choice for CI/CD and enterprise development teams)\nUnderstands and uses unit and functional testing; ideally advocates tests up front (advocates tests for moving faster)\nExperience defining delivery pipelines; demonstrable work in automation and observability (Bonus points for experience using GitOps for deployment)\nUnderstand K8s resiliency patterns (HPA, self-healing)\nUnderstands container image optimization\nQualifications:\nMinimum of 6 years of related experience\nBachelor's degree required\nKubernetes and/or Tanzu or OpenShift Container Platform.\nKubernetes and Python\nExpertise in Tanzu Solutions As A Service Offerings\nExperience delivering infrastructure as code using CI/CD practices\nProven track record of applying technology to tackle business problems.\nExperience with migrate/onboard application onto Kubernetes\nAWS associate certifications or higher preferred\nRedHat certifications in Linux and OpenShift administration preferred", "employment_type": "FULL_TIME", "date_posted": "2021-08-05T15:31:01.000Z"}, "company": {"name": "N9 IT Solutions, Inc.", "link": "https://www.linkedin.com/company/n9-it-solutions"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 72, "seniority_level": "Senior"}}