{"location": {"country": "US", "locality": "San Francisco", "region": "San Francisco", "postal_code": "94121", "street_address": null, "latitude": 37.78008, "longitude": -122.42016}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Enterprise Solutions Engineer", "industry": "Computer Software", "description": "GitHub helps software teams succeed by enabling them to build better software, together. We're looking for experienced Solutions Engineers in the Western US to provide pre- and post-sales support to some of the most technically advanced software organizations in the world. A Solutions Engineer is responsible for the technical relationships with customers and prospects, working as a trusted advisor with customers to remove technical objections and creatively address pain points in a customer's SDLC. Solutions Engineers at GitHub also work internally with sales and product development to identify and communicate solutions which meet customers' ever changing business needs against the capabilities of GitHub's platform.\nWe're extremely passionate about the quality of our work. If you are technically sharp and people oriented, you might be a fit for this role!\nPre-Sales Responsibilities:\nIdentifying customer business requirements and matching them to product features\nBuilding joint customer strategies with enterprise sales, support and field services to encourage product adoption\nProviding live demonstrations of the GitHub Enterprise platform to prospective customers\nAnswering GitHub product questions and helping customers and prospects to take full advantage of the GitHub product\nAnswering GitHub technical questions and helping customers integrate GitHub with their existing development tools and workflows\nBuilding relationships with key decision makers and serving as a customer's technical point of contact\nEducating prospects on product implementation and usage\nLearning about customers' successes and challenges, sharing customer feedback within GitHub, and advocating for customer interests\nMaintaining awareness of internal GitHub initiatives and the developer tools industry, including source control management (SCM), application security, CI/CD, and project planning.\nPost-Sales Responsibilities:\nActing as intermediary between sales and other technical teams to best meet customer needs\nCommunicating customer feedback and perspectives to appropriate teams to be considered in product strategy\nDocumenting technical considerations, collecting existing articles, and contributing to internal knowledgebases as a resource for other teams, customers, and partners\nQualifications:\n3+ years of experience in sales/solutions engineering, technical consulting, or DevSecOps operational roles\nCustomer-facing experience\nRemote work friendly, with ability to travel up to 50% when needed\nTeam-oriented and strong collaboration skills\nPassionate commitment to quality and success\nExcellent verbal and written communication skills\nStrong public speaking ability\nGrowth mindset\nCan quickly identify and solve technical and business challenges related to software delivery\nAbility to relate technical concepts to customers of all technical backgrounds\nKnowledge of Source Control Management (SCM) tools and workflows\nKnowledge of Continuous Integration, Continuous Delivery (CI/CD) architecture, tools and workflows\nComfortable working in a fast-paced and dynamic environment\nMust be legally authorized to work in the United States\nMust be located in the Western US\nPreferred Qualifications:\nIn-depth knowledge of the Software Development Lifecycle (SDLC)\nKnowledge of software composition and security analysis, SAST/DAST tooling\nExperience working in or with large software development teams\nKnowledge of Git and GitHub workflows\nAbility to articulate the value of DevOps and DevSecOps\nKnowledge of DevSecOps patterns and industry trends\nWho We Are:\nGitHub is the developer company. We make it easier for developers to be developers: to work together, to solve challenging problems, and to create the world’s most important technologies. We foster a collaborative community that can come together—as individuals and in teams—to create the future of software and make a difference in the world.\nLeadership Principles:\nCustomer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness\nWhy You Should Join:\nAt GitHub, we constantly strive to create an environment that allows our employees (Hubbers) to do the best work of their lives. We've designed one of the coolest workspaces in San Francisco (HQ), where many Hubbers work, snack, and create daily. The rest of our Hubbers work remotely around the globe. Check out an updated list of where we can hire here: https://github.com/about/careers/remote\nWe are also committed to keeping Hubbers healthy, motivated, focused and creative. We've designed our top-notch benefits program with these goals in mind. In a nutshell, we've built a place where we truly love working, we think you will too.\nGitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!\nPlease note that benefits vary by country. If you have any questions, please don't hesitate to ask your Talent Partner.", "employment_type": "FULL_TIME", "date_posted": "2021-08-31T00:09:04.000Z"}, "company": {"name": "GitHub", "link": "https://www.linkedin.com/company/github"}, "education": {"required_credential": null}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}