{"location": {"country": "US", "locality": "Alpharetta", "region": "Alpharetta", "postal_code": "30022", "street_address": null, "latitude": 34.075615, "longitude": -84.29455}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer", "industry": "Computer Software,Banking,Computer &amp; Network Security", "description": "We are searching for a quality C# developer to develop code and .NET solutions for our business. In this role, you will be required to design, write, and maintain C# coding for our future and ongoing projects. You will also be required to contribute to design and planning sessions as well as formulate approaches for current coding tasks.\nTo ensure success as a C# developer you must have an excellent grasp of C# and the .NET framework, prolific coding abilities, and be able to problem-solve on a daily basis. A top-quality C# developer will be able to perform full-stack development as well as handle the creation, maintenance, and further development of .NET applications and programs.\nC# Developer Responsibilities:\nDeveloping C# .NET solutions for the organization.\nCreating in-house applications using the .NET framework.\nDebugging and maintaining written code.\nDefining and organizing projects on an ongoing basis.\nReporting and resolving issues related to .NET projects.\nIdentifying and handling technical risks and issues.\nWorking in a project team alongside other developers.\nProviding technical support to stakeholders in the organization.\nReporting on project statuses and developments to senior team members.\nParticipating in project meetings with management and other team members.\nC# Developer Requirements:\nA bachelor's degree in computer programming, computer science, or information technology.\nC#, .NET 3.5 (or higher), and Microsoft Visual Studio certification and experience.\nA minimum of 2 years of experience as a C# programmer or developer.\nKnowledge of other coding-languages (PHP, C+, Java, etc).\nAbility to write clean, easy to understand code.\nOutstanding analytical and problem-solving capabilities.\nExcellent written and verbal communication skills.\nAbility to work independently and complete projects with minimal supervision.\nSound understanding of coding and development processes.\nExperience with working in an agile environment.", "employment_type": "CONTRACTOR", "date_posted": "2021-08-20T00:02:51.000Z"}, "company": {"name": "Applied Resource Group", "link": "https://www.linkedin.com/company/applied-resource-group"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}