{"location": {"country": null, "locality": null, "region": null, "postal_code": null, "street_address": null, "latitude": null, "longitude": null}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Machine Learning Engineer", "industry": "Servicii financiare,Software,Tehnologia informației și servicii informatice", "description": "Responsibilities\nImplementation of AI and ML applications in company with the Deutsche Bank IPB Business Organisation.\nUnderstanding and translating business requirements into technical concepts as preparation for AI application development.\nDesigning machine learning systems and self-running artificial intelligence (AI) software to automate predictive models.\nResearch and implement appropriate ML algorithms and tools.\nTurning unstructured data into useful information by e.g. applying NLP.\nAdvanced analytics of business data using modern statistical approaches and analytical systems.\nExecute data science experiments to gain new insights into the available data, which allows generating new business opportunities.\nVisualisation of data using common BI tools.\nAdvanced pre-processing of data as required by the respective AI application.\nDelivery of AI and ML application on modern infrastructure in an international business context.\nTrain and retrain systems when necessary.\nExtend existing ML libraries and frameworks if necessary.\nRollout and document changes and applications according to requlatory requirements.\nMaintain and deliver Bugfixes for existing AI and ML applications.\nProfile Requirements\nBSc in Computer Science or similar field; Master’s degree is a plus.\nProven experience as a Machine Learning Engineer or similar role.\nExtensive knowledge of ML frameworks, libraries, data structures, data modelling, and software architecture.\nIn-depth knowledge of mathematics, statistics, and algorithms.\nAbility to write robust code in Python and if necessary R.\nKnowledge of common Python frameworks in the area of data processing, data science and machine learning e.g. Pandas, Scikit-Learn, Numpy, Tensorflow and others.\nExperience with visualizing data in e.g. Tableau or Qlik Sense.\nExcellent communication skills.\nAbility to work in a team.\nOutstanding analytical and problem-solving skills.\nStructured and intrinsically motivated way of working.\nCapability to work in a fast paced and changing environment.\nOptional\nExperience in the area of cloud computing ideally GCP or similar.\nFirst experience with low code Data Science tools e.g. Kubeflow.\nExperience with specific NLP frameworks e.g. NLTK, Spacy.\nExperience with implementing ML applications in a Hadoop environment.", "employment_type": "FULL_TIME", "date_posted": "2021-08-24T15:36:21.000Z"}, "company": {"name": "Deutsche Bank", "link": "https://de.linkedin.com/company/deutsche-bank"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}