{"location": {"country": "US", "locality": "Seattle", "region": "Seattle", "postal_code": "98133", "street_address": null, "latitude": 47.60323, "longitude": -122.33028}, "salary": {"currency": "USD", "min_value": 80600, "max_value": 165000, "unit": "YEAR"}, "job": {"title": "Software Engineer II, Partner Commerce - HBO Max", "industry": "Consumer Goods,Entertainment,Online Media", "description": "PeopleSoft Requisition Number\nR000040771\nCompany Overview\nWarnerMedia is a leading media and entertainment company that creates and distributes premium and popular content from a diverse array of talented storytellers and journalists to global audiences through its consumer brands including: HBO, HBO Max, Warner Bros., TNT, TBS, truTV, CNN, DC Entertainment, New Line, Cartoon Network, Adult Swim, Turner Classic Movies and others.HBO is one of the most respected and innovative entertainment brands in the world, serving iconic, award-winning programming to 140 million subscribers globally. A subsidiary of WarnerMedia, HBO is the world’s most successful pay TV service with an extensive array of programming that includes some of the most notable titles to be on television, including drama series Succession ® , Watchmen ® , Westworld ® , Big Little Lies ® , Game of Thrones ® , The Sopranos ® , Band of Brothers ® and The Wire ® , as well as comedy series Barry ® , Insecure ® and Sex and the City ® . HBO is committed to retaining and recruiting skilled and motivated employees, placing a priority on qualified team players who contribute to the diversity of their workforce. HBO offers competitive benefits to include medical, dental, vision, a matched 401(k) plan, flexible spending, a commuter benefit program and tuition reimbursement.\nThe Job\nLike to develop features that connect and impact millions of customers? The Partner Commerce team works closely with app stores and other partners to create the best customer experiences for purchasing and managing HBO Max subscriptions. We are dedicated to continuous improvement and are looking for talented engineers to join the team to optimize the journey from awareness to streaming. We’re looking for Engineers that have an interest in the space and a passion for creating great software.\nAs a Software Engineer II on WarnerMedia's Partner Commerce team, you will design, improve, and protect large-scale systems for managing customer subscriptions. You will build industry-leading features across multiple device platforms. You will own and improve features like in app purchases, user messaging, and gift cards. By working on our team, you will make some of the world’s best content accessible to millions of customers, safely and seamlessly. In this role you will join a growing team with many opportunities for you to expand your scope and influence. You will use data and your experience to make smart engineering decisions and own critical areas of a product used by millions of customers. You will get the opportunity to work in multiple areas of the product, both on the client-side and server-side.\nThe Daily\nJoin a growing team with many opportunities for you to expand your skillset.\nGrow your ability to design, implement, and own critical features of a product used by millions of customers.\nDesign, improve, and protect large-scale systems for managing customer subscriptions for HBO Max.\nEvaluate multiple technical approaches and drive consensus with peers.\nUse data to solve real world problems and improve customer experience.\nCollaborate and partner with engineers of all levels.\nWork with designers, product managers, and marketers to optimize the purchase experience.\nHandle operational issues and troubleshoot bugs independently.\nThe Essentials\n3+ years of experience in software engineering building scalable services components for shipped consumer products or platforms.\nBe passionate about software engineering with a strong sense of ownership for the code that you and your team write.\nStrong understanding of Computer Science fundamentals, including algorithms, data structures, and operating systems.\nFluency in a modern programming language (ideally Java, Swift, JavaScript or TypeScript).\nBe a quick learner that can leverage surrounding resources to solve problems.\nSeek self-improvement and adapt to suggestions and feedback.\nHold yourself and your team to high standards while maintaining respectful relationships.\nBe passionate about software engineering with a strong sense of ownership for the code that you and your team write.\nAbility to provide periodic on-call support for critical emergent customer-facing issues.\nExperience creating automated tests as part of the development lifecycle. Passion for test driven development.\nA passion for learning, sharing knowledge, mentoring, and working in a team setting with engineers of varying levels of experience.\nPassion for collaboration, and fun is a must!\nNice to Haves\nBachelor's degree in an engineering or science-related discipline.\nSuccess in designing and building highly available application/systems at scale – and particularly in languages such as NodeJS, Python, GoLang, or Java.\nSuccess in designing and building exciting, highly polished, and dynamic user experiences.\nSolid understanding of how the internet works and operates, particularly in client/server transactions with a keen knowledge of HTTP, DNS, REST, etc.\nDevOps experience, where you've owned and operated the systems you've developed.\nExperience in monitoring and telemetry: Telegraf, Grafana, InfluxDB, and Prometheus.\nExperience creating web, mobile, game console, set-top box and/or TV client application development.\nExperience with a variety of back-end persistence, queuing and networking technologies, especially Kubernetes and AWS.\nExperience with security software engineering, especially for distributed applications.\nExperience with JavaScript, TypeScript, Swift, and/or Java.\nExperience with Git version control.\nThe Perks\nExclusive WarnerMedia events and advance screenings\nPaid time off every year to volunteer for eligible employees\nAccess to well-being tools, resources, and freebies\nAccess to in-house learning and development resources\nPart of the WarnerMedia family of powerhouse brands\nWarner Media, LLC and its subsidiaries are equal opportunity employers. Qualified candidates will receive consideration for employment without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law.", "employment_type": "FULL_TIME", "date_posted": "2021-07-15T18:31:14.000Z"}, "company": {"name": "WarnerMedia", "link": "https://www.linkedin.com/company/warnermedia"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}