{"location": {"country": "US", "locality": "San Jose", "region": "San Jose", "postal_code": "95148", "street_address": null, "latitude": 37.334793, "longitude": -121.888145}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Senior Hardware Test Engineer", "industry": "Medical Devices,Biotechnology,Hospital &amp; Health Care", "description": "Position: Senior Hardware Test Engineer\nLocation: San Jose CA\nDuration: 3-4 Months Contract\nPay Rate: $50/hr - $58/hr (depending on experience)\nRelocation Expenses/ Assistance: NO\nJob Description:\nWe are looking for a Senior R&D Hardware Test Engineer with strong experience in instrumentation measurements both analog and digital.\nKnowledgeable in PCB test standards, FPGA testing and high-speed board test design. Methodologies of calibration and understanding of measurements uncertainty, six sigma and ICT/DFT/FCT.\nThe candidate will work closely with the hardware design teams throughout the product life cycle by defining and specifying test requirements. You will be supporting pre-testing of the Hardware developed by the design teams and supporting the team through product execution, ultimately leading the manufacturing test team to leverage your ATE test platform.\nThe ideal candidate must be responsive, flexible and able to succeed within an open collaborative peer environment across multiple projects simultaneously.\nInterface with the R&D designers and other Hardware Engineers to define the most efficient and accurate measurement for testing the boards functionality.\nDesign the test fixtures.\nAbility to remotely manage computers using SSH or VNC protocol using Git version control.\nWork closely with validation test engineers to insure that the test fixtures would satisfy module automated testing.\nDrive system verification of solutions through ATE/FCT.\nSupport the HW team with sub system bring-up and test fixtures.\nResponsibility for Test definition and calibration of the ATE.\nCollaborate with HW Design Engineers to develop and execute hardware verification test plans.\nBoard level functional testing\nDesign, build and program test systems used in HW testing as well as generate automated reports tracking for test results.\nAnalyze test results and test data to determine if design meets functional and performance specifications.\nExtensive experience in testing of Digital and Analog/Mixed signal circuits\nExperience using RF measurement instruments, high-speed oscilloscopes, signal generators, arbitrary waveform generators.\nAbility to read and interpret PCB schematics and perform basic digital and analog circuit analysis\nExperience designing and analyzing test procedures to minimize measurement error\nKnowledge of industrial controls systems and their communications interfaces and protocols such as Ethernet/IP\nProficiency with measurement automation tools and scripting languages such as, Python, Labview, Labwindows and Matlab.\nExperience with electronic hardware design tools such as Cadence or Mentor Graphics\nFamiliarity and experience working with, Gigabit Ethernet, FPD link, CAN, SPI, I2C, LIN, and RS232.\nMinimum Qualifications:\nBachelor’s degree in Electrical Engineering or similar technical discipline\nMSEE Preferred\nMinimum 5 years of experience as a Test Engineer supporting product introduction.\nDesired Skills:\nAbility to install and configure a Linux distribution on desktop (or embedded) systems.\nFamiliarity with the pre-built high-performance computing (HPC) software stack used in AMD (Xilinx) devices.\nComfortable installing pre-built Linux packages, with the occasional build from source.\nWrite humble high-level test scripts in Python using pre-compiled software to support that aspirations low-level real-time DSP designers.\nICT/ FCT\nFPGA BIST, High speed SERDEs, testing I-BERT\nAnalog measurements (noise, Jitter, oscilloscope, spectrum, DMM)\nADC and DAC testing (noise, dynamic range)\nInstrument and test calibration procedures\nGUM analysis\nSix sigma application DFSS", "employment_type": "CONTRACTOR", "date_posted": "2021-08-31T00:12:21.000Z"}, "company": {"name": "Amerit Consulting", "link": "https://www.linkedin.com/company/amerit-consulting"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}