{"location": {"country": "US", "locality": "Alpharetta", "region": "Alpharetta", "postal_code": "30022", "street_address": null, "latitude": 34.075615, "longitude": -84.29455}, "salary": {"currency": "USD", "min_value": 74200, "max_value": 97200, "unit": "YEAR"}, "job": {"title": "Data Scientist", "industry": "Information Technology and Services", "description": "The Data Scientist will join the LexisNexis Risk Solutions US Connected Car Team developing and supporting the analytics products for the Automotive Original Equipment Manufacturers (\"OEMs\") Market, as well as Telematics data solutions for insurance carriers.\nKEY RESPONSIBILITIES\nDevelop analytics products and statistical models using Telematics Data\nInterpret business plays to recommend (and execute) an analytic plan to supervisor and/or client.\nFollow modeling best practices and provide feedback on ways to enhance current practices.\nProvide technical support and be a resource to internal and external modelers.\nConduct analysis and performance reports in support of existing and new customer sales.\nSummarize and communicate conclusions and solutions to analytic and non-analytic stakeholders.\nWork with Product Management and Technology team closely on product implementation\nOther duties as assigned.\nQUALIFICATIONS\nBachelor’s degree in computer science, mathematics, statistics or quantitative methods (or equivalent years’ experience) . Master's Degree preferred.\n2+ years demonstrated applied modeling and analytics experience in applicable industry.\nTECHNICAL SKILLS\nStrong understanding of statistical methods applied to data analysis\nUser of SAS, R, Python or equivalent analytic software.\nUnderstanding of various statistical methodologies including linear regression, logistic regression, and other advanced analytic techniques.\nFluency with Excel, PowerPoint and Word.\nStrong oral and written communication skills, including the ability to describe analytical results to non-statistical audiences\nExperience processing large data sets.\nExperience matching/merging multiple data sets\nComfortable working in a fast-paced environment.", "employment_type": "FULL_TIME", "date_posted": "2021-08-13T14:29:49.000Z"}, "company": {"name": "LexisNexis Risk Solutions", "link": "https://www.linkedin.com/company/lexisnexis-risk-solutions"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}