{"location": {"country": "US", "locality": "Detroit Metropolitan Area", "region": "Detroit Metropolitan Area", "postal_code": "48215", "street_address": null, "latitude": 42.339054, "longitude": -83.04875}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Machine Learning Engineer", "industry": "Information Technology and Services,Automotive", "description": "Modis is looking for Machine Learning Engineers. Our opportunities are either long-term engagements, contract to hire or permanent placement roles. If you're looking for work in an enterprise level environment with a Fortune 100 company - make sure to apply today!\nRESPONSIBILITIES:\nPlan, Configure, Deploy and Operate a cloud solution\nDeliver Proof of Concepts for new Solutions on Cloud\nWorks well under pressure, independent and meets deadline\nREQUIRED SKILLS:\nHands on/working Knowledge of Google Cloud Platform(GCP)\nExperience Hosting applications on GCP using Compute Engine, App Engine, Kubernetes Engine, Cloud Storage, Big Query etc..\nGood understanding of cloud design considerations and limitations and impact of pricing\nKnowledge of Networking principles and protocols including not limited to Load Balancing, firewall rules\nProficient in scripting languages including Python, yaml.\nKnowledge of Application Monitoring using GCP(Google stackdriver)\nPrior experience working with: container technology, docker files, doscker images, Github, CI/CD concepts\nExperience with infrastructure configuration management tools such as Terraform, Puppet and Chef.\nPREFERRED SKILLS / EXPERIENCE:\nMachine Learning experience\nGCP Stack\nKubeflow\nNLP\nPlatform vision\nMigration to GCP\nUnderstanding or desire to learn end to end Machine Learning technology stack (Tools such as Domino Data Labs, Kubeflow, Kubernetes, SeldonCore, GCP, Jupyter Notebook, Hive, etc).\nAbility to work cross functionally\n1-2+ years of experience developing GCP ML app’s\nADDITIONAL INFORMATION:\nModis offers Visa sponsorship and Green Card services\nPlease feel free to contact Leticia Oliveira for further assistance at leticia.oliveira@modis.com\nEqual Opportunity Employer/Veterans/Disabled\nTo read our Candidate Privacy Information Statement, which explains how we will use your information, please visit https://www.modis.com/en-us/candidate-privacy/\nThe Company will consider qualified applicants with arrest and conviction records.", "employment_type": "FULL_TIME", "date_posted": "2021-08-03T14:06:36.000Z"}, "company": {"name": "Modis", "link": "https://ch.linkedin.com/company/modis"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 12, "seniority_level": "Junior"}}