{"location": {"country": "US", "locality": "Folsom", "region": "Folsom", "postal_code": "95763", "street_address": null, "latitude": 38.681324, "longitude": -121.163734}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Integration Analyst", "industry": "Information Technology and Services,Computer Software,Financial Services", "description": "Allworth Financial (www.allworthfinancial.com) is an independent investment financial advisory firm that specializes in retirement planning, investment advising, and 401(k) management with a direct approach to financial planning. Allworth Financial delivers long- and short-term investment planning solutions and advice to help clients achieve their goals and plan strategically for retirement.\nAllworth Financial is a high growth, private equity backed, Registered Investment Advisory business, headquartered in Sacramento, CA. The business is a $10 billion firm and is on track for continued growth through both acquisitions and strong organic growth. Allworth Financial was recognized as a Barron's Top 100 RIA in 2020.\nSummary\nAs part of Allworth Financial's growth, the Finance team has created a new Data Integration position reporting to the VP of Analytics & Insights. The ideal candidate must have the following:\nStrong organizational skills to work independently and with a team, set priorities, plan and coordinate multiple projects while adapting to changing priorities\nStrong attention to detail and understand how various issues impact the company's overall data environment.\nTactful, solid business judgment with the ability to make business-savvy recommendations based on data analyzed\nResponsibilities\nWork directly with acquisition targets to conduct due diligence related to acquisition targets' data and infrastructure and report findings to data team\nMeet with acquisition targets to scope/map data migration and conversions\nMigrate data from acquisition targets' data platforms and integrate into Allworth's standard reporting structure\nRequirements\nStandard understanding of Excel\nSQL Experience\nBe able to effectively use joins, case statements, WHERE/GROUP BY/HAVING statements\nBe able to use aggregate functions: SUM, MIN, MAX for exploratory data analysis\nPreferably SQL Server experience, but not mandatory\nPython Experience\nBasic understanding of Built in Python features\nLists, Dictionaries, etc.\nList and Dictionary comprehensions\nLambda functions\nError and exception handling\nExperience with Jupyter Notebooks is a plus\nDeep understanding of Pandas library\nPrior experience with Salesforce a plus but not required\nAbility to work with all levels of management\nBachelor's Degree in Finance, Computer Science or similar\nBenefits\nWe value our associates' time and effort. Our commitment to your success is enhanced by our competitive base pay and an extensive benefits package including flexible work arrangements, paid time off, medical and other insurances, Retirement Benefit – 401K and future growth opportunities within the company. Plus, we work to maintain the best possible environment for our associates, where people can learn and grow with the firm. We strive to provide a collaborative, creative environment where each person feels encouraged to contribute to our processes, decisions, planning and culture.\nThe above statements are intended to describe the general nature and level of work being performed by people assigned to this job. Typical reporting relationships are described, but actual relationships may vary in some instances. This job description is not intended to be an exhaustive list of all responsibilities, duties, skills, or knowledge required of personnel classified in this job.", "employment_type": "FULL_TIME", "date_posted": "2021-07-30T05:13:43.000Z"}, "company": {"name": "Allworth Financial", "link": "https://www.linkedin.com/company/allworth"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}