{"location": {"country": "US", "locality": "United States", "region": "United States", "postal_code": "99999", "street_address": null, "latitude": 39.50355, "longitude": -99.0183}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Scientist", "industry": "Internet", "description": "Summary\nAs a Data Scientist at Fast, you will partner closely with product managers, engineering, design, marketing, sales, or other operational leaders to define core metrics/KPIs, generate actionable data insights from large datasets, build automated dashboards using data pipelines, and run experiments to measure impact of new initiatives.\nRole\nRun complex data queries, analyze large datasets and run statistical analyses to continuously drive deeper understanding of our customers and product performance\nCreate dashboards and reports with effective data visualizations\nBe a thought partner to business leaders in determining quantitative success and process improvement\nBuild data pipelines and create scripts to automate processes and reports\nBuild models to improve our understanding of user behavior and predict future performance\nRequirements\n3+ years of experience in quantitative analysis roles\nFluent in SQL and a scripting language (R, Python)\nKnowledge of experimentation and statistical methods\nBS in quantitative field or equivalent experience\nSkilled with Looker, Jupyter Notebook and other data visualization tools\nNice to Have\n5+ years of experience in quantitative analysis roles\nAdvanced degree in quantitative field or equivalent experience\nKnowledge of building data pipelines (e.g. dbt, airflow)\nExperience in e-commerce industry\nPrevious mature startup experience", "employment_type": "FULL_TIME", "date_posted": "2021-08-19T23:57:50.000Z"}, "company": {"name": "Fast", "link": "https://www.linkedin.com/company/fast"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}