{
    "job": {
        "title": "Software Engineer",
        "industry": "Financial Services,Logistics and Supply Chain,Transportation/Trucking/Railroad",
        "description": ".NET Software Engineer OTR Capital, LLC is a factoring company dedicated to offering timely, working capital solutions to companies looking to maintain positive cash flow while growing their business. We are seeking motivated individuals with a desire to join an established fast-paced and growing technology organization with a start-up culture. We are at the beginning of the development of a new Cloud-Native platform that will drive the next wave of innovation in the industry and fuel OTR’s growth. We are looking for growth minded, collaborative developers who love to create, innovate and learn cutting-edge solutions on the latest and greatest technology. You’ll be part of a technology team working to develop web, mobile, and cloud-based data solutions. The Senior Software Developer position will lead software architecture, design, coding, test and deployment of our applications.Please note: We do not sponsor work-related visas.**OTR has been recognized as a “Top Workplace” 5 years in a row by the Atlanta Journal-Constitution!Roles and Responsibilities:Provides Full cycle application design and development.Perform requirements analysis, detail design, troubleshooting, source code construction, system testing, integration testing and implementation for reports.Create, update and maintain system based on incoming change requests and break-fixes.Create and maintain stored procedures.Interact with team members when developing interfaces, and researching and troubleshooting technical issues.Qualifications: Minimum 4-6+ Years work experience with:Expert knowledge ASP.Net, MVC, C#, Javascript, and JQuery or object-oriented development language-equivalent experienceWeb services including creation and consumption of WebAPI and other RESTful servicesUse of Postman or similar for API testingHTML, and CSS experienceAdvanced knowledge in SQL Server database management, Stored Procedures, Query Analysis, and SQL codingVisual Studio 2017/19 experienceSource control, work item and build management with Azure DevOps (Team Foundation Server/GIT)Expert knowledge Entity Framework – Database First, and LINQ experience a plusAzure or other cloud experience a plusBootstrap, DataTable library experience a plusTranslate business requirements in to technical requirementsAble to manage multiple projects and deliver high quality deliverables by deadlinesFlexible and adaptable with the ability to learn quicklyStrong communication skillsExcellent teaming skills Our Culture •        Display the highest level of integrity.•        Demonstrate respect for others.•        Possess a \"do what it takes\" attitude.•        Think creatively and innovate.•        Embrace a growth mindset and life-long learning•        Enjoy working in a collaborative, team-oriented environment.•        Are resourceful and results driven.These are the fundamental aspects of our working environment that make each day both challenging and rewarding.  Our BenefitsOTR provides a competitive, comprehensive compensation package for our full-time employees:Pluralsite TrainingPaid CertificationsCertification BonusEligibility for Individual and Company bonus programsMedical, Dental, Vision, Life/ AD&D Insurance, Short-Term DisabilityPet Insurance, Paid Family Leave, Employee Assistance ProgramFully Paid Maternity Leave401(k) with Company Matching12 days of Paid Time Off, 4 Sick/Mental Health days, 7 Paid Holidays, 2 Flex Holidays,Weekly Catered LunchesWork from Home FlexibilityCompany Paid Fitness MembershipVolunteer Days and Opportunities with Company-Partnered CharitiesInternal Inclusion programs OTR Mission and Values:OTR’s mission is to create exceptional value for our clients by providing industry leading financing and back office solutions delivered through a blend of outstanding customer service and tech-driven efficiencies, while maintaining a culture that provides the opportunity for employees to achieve greatness.BE PASSIONATE Conquering the day with energy and heart.BE INNOVATIVE Always finding new ways to improve our services and technologiesBE LIMITLESS Dedicated to the growth of ourselves, the company, and our clientsBE AGILE Willing and eager to accept new challengesBE ESSENTIAL Committed to being a strategic partnerBE OTRelite. OTR Capital, LLC is an Equal Opportunity Employer",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T15:14:35.000Z"
    },
    "company": {
        "name": "OTR Capital",
        "link": "https://www.linkedin.com/company/otr-capital"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Roswell",
        "region": "GA",
        "postal_code": "30076",
        "street_address": null,
        "latitude": 34.021652,
        "longitude": -84.36167
    }
}