{
    "job": {
        "title": "Data Scientist",
        "industry": "",
        "description": "Chalice is a funded year-old startup in the digital advertising industry that is a software layer for deploying custom algorithms for Brands and Agencies. We believe the “age of AI” will be like the dawn of personal computing - companies who adopt it first will run ahead of the competition. We empower marketers with the ability to point the power of AI directly at their chosen business outcomes.  We like to say that algorithms are just decisioning rules, and Brands should be able to write those rules for their own business interests. We are rapidly growing and looking to add to our early stage team.   We are looking to hire a data scientist to work with our Chief Data Scientist and help build out our Inference Engine. Chalice’s Inference Engine is the central asset that builds our algorithmic products. An ideal candidate has experience in working in the digital advertising ecosystem and, in particular, with optimization of bid prices on advertising exchanges. You will:Be a leader in defining and executing Chalice’s data science and technology roadmap.Work with the Chief Data Scientist/CTO to define the technical requirements for Chalice’s infrastructureDesign and execute experiments to improve client campaign performance and analyze experimental resultsLeverage industry best practices to establish repeatable applied data science practices, principles & processesYou have:BS, MA, or PhD. in a quantitative discipline such as Statistics, Math, Economics, or Engineering, or similar field.3-5+ years’ experience in data science roles. Specific expertise in using XGBoost and Random Forest on very large datasets. Expertise using SageMaker or Spark/Databricks preferred.1+ years’ experience building buy-side data science solutions, including algorithmic biddingExperience with SQL, SageMaker, and Spark/Databricks preferredMust have excellent organizational, project management, and communication skills (both written and verbal)Ability to work well cross-functionally and handle organizational complexities and manage competing priorities without loss of efficiencyPassion for solving large data problems and must be a strategic thinkerAdvanced knowledge of statistics, especially as it relates to hypothesis testing About ChaliceChalice equips forward-thinking brands to own the transformative power of ad buying algorithms. Leveraging brand-specific KPIs, protected insights, and predictive analytics, Chalice empowers brands to get ahead - and stay ahead - of the competition.  Built by digital advertising veterans and backed by industry investors, Chalice brings a track record of ad-tech expertise and just enough intolerance for the status quo to help brands level-up their ad buying strategy.  Our philosophy:  If you create real value, you can be completely transparent.  Advertisers deserve more than off-the-shelf, black box solutions.We strive for excellence while fostering learning and creating a supportive work environment.Not your typical ad tech company. We don’t take ourselves too seriously. No empty promises. No black boxes. No bro culture.  We are committed to diversity of thought, background and experience and creating the psychological safety for all to thrive. We believe more perspectives and experiences make for a richer team, offering and company. Location: company HQ in NYC; open to remote",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T17:42:55.000Z"
    },
    "company": {
        "name": "Chalice Custom Algorithms",
        "link": "https://www.linkedin.com/company/chalice-custom-algorithms"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}