{"location": {"country": "US", "locality": "Boston", "region": "Boston", "postal_code": "02118", "street_address": null, "latitude": 42.358994, "longitude": -71.05863}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer - CES", "industry": "Information Technology and Services,Computer Software,Biotechnology", "description": "Who We Are\nTetraScience provides the world’s first and only R&D Data Cloud, with a mission to transform life sciences R&D, accelerate discovery, and improve human life. Scientists at global Pharma and Biotech organizations rely on our innovative Tetra Data Platform for easy access to centralized, harmonized, and actionable scientific data to accelerate their digital lab transformation. With best-in-class SaaS performance, a team of industry innovators, and excellent product/market fit, Tetra is positioned to become an iconic life sciences software company.\nWhat you are\nYou thrive on working well with others\n. You make the people around you better. You love to collaborate with fellow team members, customers, field engineers, executives, and inspire them to do their best.\nYou relentlessly strive to excel in your craft.\nYou are passionate about delivering delightful customer experiences. You take ownership of all the aspects of the customer journey from beginning of case creation, to resolution.\nYou consistently seek understanding and clarity\n. You look at every interaction as an opportunity to learn. You aren’t afraid to ask questions. You have the humility and confidence to not be the smartest person in the room.\nWhat You Will Do\nDevelop tools, scripts, and design processes to improve observability and system resiliency.\n80% of your time will be hands-on code fixes - individually or by partnering with engineering teams.\nBuilding, automating, and monitoring infrastructure in AWS to increase product reliability.\nYou will be the responsible to investigate end-to-end issues and escalations reported by TetraScience customers.\nTriage issues, drive to resolution and/or identify workarounds to unblock customers.\nYou will be the steward of the customer support to the engineering escalation process, increasing efficiency by streamlining communication with customer success, by triaging, extracting, and documenting relevant information\nRequirements\n3+ years of experience with a proven track record of excellence as Production Support Engineer or Site Reliability Engineer for web application platforms\nCoding experience in one or more languages Python, JavaScript, React or Java\nDemonstrated experience of debugging software reliability issues in a distributed environment including troubleshooting experience with APIs.\nMust have experience with CloudNative(AWS) platforms and applications( Micro-services, Lambda, Docker and Kubernetes deployments, Databases, NoSQL, Kafka/Queueing Service, or Elastic Search)\nMust be self-driven, innovative, and willing to take initiative. Good to have startup experience.\nBachelor's degree in engineering, or equivalent\nBenefits\nCompetitive Salary and equity in a fast growing company\nSupportive, team oriented culture of continuous improvement.\n100% employer paid benefits for all eligible employees and immediately family members.\n401K\nGenerous paid time off (PTO)\nFlexible working arrangements - Remote work | East Coast Zone + Boston office as needed", "employment_type": "FULL_TIME", "date_posted": "2021-08-25T03:41:03.000Z"}, "company": {"name": "TetraScience", "link": "https://www.linkedin.com/company/tetrascience"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}