{"location": {"country": "US", "locality": "Waterloo", "region": "Waterloo", "postal_code": "53594", "street_address": null, "latitude": 43.18382, "longitude": -88.99043}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Embedded Systems Software Engineer", "industry": "Sporting Goods,Retail,Information Technology and Services", "description": "Description\nA bit about us\nTrek is an awesome place to work, with amazing benefits for all employees. We build only products we love, provide incredible hospitality to our customers, and change the world by getting more people on bikes. When you’re on our team, you’re taken care of, encouraged to learn and grow, and given lots of opportunities to do so. Give us your best, and we’ll give it right back. Sound pretty sweet? Then come join us!\nPosition Summary/Job Description\nAdvanced Technologies team is looking for an Embedded Systems Software Engineer to work on multidisciplinary early concept projects. Embedded Systems Software Engineer is responsible for developing the embedded software solutions for the incubating rider-bike interfacing technology concepts with a mass production intent. In this role, you’ll be an integral part of the new concept team that propels the next generation product development.\nResponsibilities\nWork in an interdisciplinary R&D teams to distill technical tasks out of the end-user expectations. Define the concepts’ functional and design specifications.\nOwn the system design and firmware on hardware prototypes. Work with embedded hardware engineer, and design and code firmware that drives microcontroller or SoC based prototypes. Test/debug/QA the system performance.\nWhen applicable, develop client applications for rapid field testing of the concepts, or actively contribute in application software development.\nWork with IoT architect to map out the system architecture necessary to deploy the applications.\nParticipate and occasionally drive the project sprints to keep high-velocity process.\nRequirements\nTechnical skills:\nExtensive experience in SoC/microprocessor programming (ARM, Nordic nRF52 preferred) in C/C++ language. Additional hands-on experience with Arduino, Swift, and Python would be valuable.\nExperience with firmware development for I2C, SPI USB peripherals, sensors, CANbus, and for RF communication protocols Wifi, BLE, LoRA, and cellular\nDemonstrated experience in designing PCB layouts, and building physical prototypes is highly desirable.\nSkills to develop mobile (Android and/or iOS)/desktop client application would be highly valuable when we want to quickly test the prototypes in the field\nKnowledge of display technologies is desired\nKnowledge of machine learning, edge AI, and computer vision image processing with OpenCV library is desired\nDemonstrated knowledge of digital signal processing\nDemonstrated experience in managing budget and project schedule\nRisk assessment skills\nAttributes Of a Successful Candidate\nA resilient and resourceful problem solver who emphasizes execution.\nA reliable teammate who brings humility and compassion to create a positive work environment.\nAbility to give effective and candid professional feedback in a respectful manner.\nAbility to formulate good hypotheses and estimate risks for big vision ideas.\nPractices a good documentation habit.\nDevelops and exports talents.\nEducation/Training\nBachelor/Master’s/PhD degree in electrical engineering, and/or computer science, or equivalent experience\n3+ years of industry experience as a firmware engineer, or embedded system design engineer\nDomain knowledge in outdoor/fitness consumer product development is a plus\nTrek Benefits\nRemote work options available\nFlexible and fun company culture\nCompetitive health care\nPPO & HDHP medical plan options, Dental insurance, Vision insurance\nFlexible Spending Accounts (FSA)\nFree life insurance & optional term life insurance\nCompetitive vacation package\n401(k) with match and Employee Stock Ownership Plans (ESOP)\n12 weeks of maternity leave with 100% pay\nFlexible holiday schedule – 10 company holidays\nTuition Reimbursement up to $15,000! (Undergraduate & Masters programs)\nEmployee discounts on all product\nDeep partner retail discounts\nWe are an E-Verify employer.\nFor More Information, Please Click On The Following Links\nE-Verify Participation Poster: English / Spanish\nE-Verify Right to Work Poster: English | Spanish", "employment_type": "FULL_TIME", "date_posted": "2021-10-18T05:56:11.000Z"}, "company": {"name": "Trek Bicycle", "link": "https://www.linkedin.com/company/trekbikes"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}