{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Food &amp; Beverages,Food Production,Consumer Goods",
        "description": "Description      Is responsible for the oversight and performance of the maintenance staff and functions, engineering, and site facilities. Develop engineering plans to support current and future plant requirements and develop systems in critical areas such as preventative maintenance, spare parts inventories, and work order systems. Work closely with plant management and plant employees and serve as a liaison with DFA enterprise wide functional departments such as Quality Assurance and Compliance, Human Resources, Accounting, Engineering, Purchasing, Research and Development, and Risk Management.      Duties And Responsibilities     - Establish and manage the department’s budget to ensure financial goals are met or exceeded   \n  - Manage capital and expense projects to meet scope, budget, and timeline as defined   \n  - Develop and utilize maintenance key performance indicators (KPI) to drive improvements to plant reliability   \n  - Develop, implement, and maintain maintenance related systems to support the continuous manufacturing requirements   \n  - Ensure the department’s activities remain in or exceed the standards and specifications established by Quality Assurance   \n  - Manage maintenance inventory, purchasing and inventory control processes   \n  - Coordinate with on-site staff and DFA management or engineering to review and approve plans for new equipment installation and layout to ensure operational efficiency   \n  - Engage and interact with personnel on a regular basis assisting them with their concerns and questions   \n  - Initiate and drive continuous improvement activities to ensure plant sustainability   \n  - Manage employee’s performance through establishing expectations and holding employees accountable   \n  - Coach and mentor employees to develop their skills and instill an appropriate sense of urgency   \n  - Partner with other departments regarding the resolution of ongoing problems, the implementation of new procedures or process, and the introduction of new products or product lines   \n  - Ensure good business communication practices are engaged at all levels to ensure key stakeholders are well informed and can appropriately respond as needed   \n  - Ensure all process changes, equipment changes, or product changes are understood by affected employees in a timely fashion   \n  - Serve as a member of the plant Hazard Analysis Critical Control Point (HACCP) team   \n  - Work any shift(s) if necessary. Must be able to receive calls pertaining to plant issues when not on duty   \n  - Must adhere to all safety policies and procedures   \n  - Follow all DFA GMP’s and works in a manner consistent with all corporate and regulatory, food safety, quality, and sanitation requirements   \n  - The requirements herein are intended to describe the general nature and level of work performed by employee; but is not a complete list of responsibilities, duties and skills required. Other duties may be assigned as required.         \nRequirements      - Bachelor of Science in Mechanical, Electrical, or Industrial Engineering or related degree   \n  - 6+ years of related experience in a manufacturing environment, including 1+ year of management experience   \n  - High speed manufacturing and food experience preferred   \n   - Excellent communication and presentation skills to all levels of the organization    \n   - Computer proficiency with Microsoft Office (Word, Excel and PowerPoint); SAP knowledge preferred   \n  - Must be able to read, write and speak English         \nAn Equal Opportunity Employer",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-10T06:41:04.000Z"
    },
    "company": {
        "name": "Dairy Farmers of America",
        "link": "https://www.linkedin.com/company/dairy-farmers-of-america"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": "Senior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Garden City",
        "region": "KS",
        "postal_code": "67846",
        "street_address": null,
        "latitude": 37.97498,
        "longitude": -100.85864
    }
}