{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services",
        "description": "Data Scientists are responsible for cleaning, transforming, enriching, and analyzing vast amounts of raw data from various systems using Apache Spark and other analytics packages to develop valuable features and to provide ready-to-use data to stakeholders for robust downstream analysis. They analyze data for correlations to identify trends and predictive power, and build, maintain, and deploy predictive models. Data Scientists work with analysts to understand business needs and requirements, and data engineers to implement scalable pipelines for ETL, model training, and scoring. They service both ad-hoc requests as well as core pipeline development. The ideal candidate has a passion for discovering insight hidden in large data sets and working with stakeholders to improve business outcomes. They keep up with the latest technology including the latest versions of spark, new analytical packages, etc. They must have a proven ability to drive business results with their data-based insights and be comfortable working with a wide range of stakeholders and functional teams.Core ResponsibilitiesCollaborate with product management and engineering departments to understand company needs and devise possible solutionsMine and analyze data from company databases to drive optimization and improvement of product development, marketing techniques and business strategiesCommunicate results and ideas to key decision makersResearch and develop predictive models for data analysisOptimize joint development efforts through appropriate database use and project designAssess the effectiveness and accuracy of new data sources and data gathering techniquesDevelop custom data transformations, models, algorithms to apply to data setsUse predictive modeling to increase and optimize customer experiences, revenue generation, ad targeting and other business outcomesDevelop processes and tools to monitor and analyze model performance and data accuracyCreate high-performance pipelines in Apache Spark for data transformation, aggregation, and model trainingDevelop and share well documented analysis in data science notebook solutions like JupyterWrite documentation with all codeBasic QualificationsExcellent communication and interpersonal skillsKnowledge of agile methodologies and tools (e.g. Scrum, JIRA).Basic system administration skills in both a Windows and Linux environmentBachelor’s degree in Computer Science, Statistics, Applied Math or related field3+ years practical experience with Apache Spark, ETL, machine learning, data processing, and data analyticsStrong experience with Python and Bash shell scriptingStrong experience with Apache Spark and MLflowStrong experience with AWS and/or Google Cloud PlatformExperience training, deploying, monitoring, and updating machine learning modelsKnowledge of a variety of machine learning techniques, including clustering, decision trees, random forest, boosting, text mining, and neural networks, and their real-world advantages and drawbacksGLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc.Experience with multiple machine learning libraries, including XGBoost, Scikit-learn, TensorFlow, and PyTorchExperience working with and creating data architecturesThe ability to teach and train others in the methodologies and practices used in data scienceFamiliarity with Git and code versioning practicesFamiliarity with the Atlassian product suite, including JIRA and ConfluenceA drive to learn and master new technologies and techniquesPreferred QualificationsStrong experience with Scala5+ years practical experience with Apache Spark (Scala and Python), ETL, machine learning, data processing, and data analyticsStrong experience with Apache Spark 3.x, including query tuning and performance optimizationMaster’s or Doctoral Degree in Computer Science, Statistics, Applied Math or related fieldStrong experience with AWS EMR, Glue, and AthenaExperience working with healthcare data, specifically healthcare insurance claims data",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T12:38:39.000Z"
    },
    "company": {
        "name": "Bridge Technical Talent",
        "link": "https://www.linkedin.com/company/bridge-technical-talent"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Connecticut",
        "region": "United States",
        "postal_code": "06450",
        "street_address": null,
        "latitude": 41.575153,
        "longitude": -72.73828
    }
}