{"location": {"country": "US", "locality": "San Francisco", "region": "San Francisco", "postal_code": "94121", "street_address": null, "latitude": 37.78008, "longitude": -122.42016}, "salary": {"currency": "USD", "min_value": 94400, "max_value": 203000, "unit": "YEAR"}, "job": {"title": "Machine Learning Engineer", "industry": "Information Technology and Services,Computer Software,Internet", "description": "Embark Trucks is a leading self-driving truck company bringing autonomous freight mainstream. We have raised $117m by partnering with Tiger Global ($70m Series C) and Sequoia Capital ($30m Series B) to help grow our team and introduce our technology to the public. Currently, we move freight daily between LA and Phoenix using our purpose-built transfer hubs. We have aligned ourselves with truck manufacturers , shippers, and carriers to integrate our technology into the freight ecosystem, pursuing a business model where fleets own and operate our trucks. This is an incredibly exciting time for autonomous vehicles and our team is looking to grow.\nOur deep learning team focuses on developing systems that sense and perceive the world around our self-driving truck. Within our deep learning team, you will focus on optimizing deep learning algorithms into production-ready self-driving perception systems.\nResponsibilities\nBuild and maintain pipelines and benchmarks to improve model performance\nOptimize the training process for deep learning models\nDesign in-truck validation experiments and conduct full-system integration and tests\nExperience Should Include\n2-5+ years of professional experience in software engineering with exposure to backend systems\nInterest in deep learning and self-driving\nInterest in building metrics and visualization systems to track model performance\nStrong C++ and Python skills\nPreferred Experience\nExperience training and optimizing deep learning networks\nExperience in designing and building UIs to help monitor experiments, plot results, and visualize benchmarks\nExperience in designing and building machine learning/deep learning data pipelines\nPrior academic or industrial experience in autonomous driving\nBenefits\nA full time, competitive salary with equity\nFlexible paid vacation from the start\n100% of the base insurance option covered for Medical, Dental, and Vision and a buy-up option for other plans\nLife insurance covered by Embark\nAccess to a Flexible Spending Account & 401K Plan\nSnacks & catered lunches\nWork in a fast-growing startup revolutionizing transportation as we know it\nAt Embark we celebrate diversity and are committed to creating an inclusive environment for all employees.\nWhen you apply, address the application to Kiana and let me know why you want to join our team.\nA Few Company Highlights\nCNBC - Our Partner Development Program\nForbes - The Embark Universal Interface\nNavigating Highway Work Zones with the Embark Driver\nForbes - 70 Million Dollar Series C\nVideo - Day in the life of a self-driving truck\n30 Million Dollar Series B led by Sequoia\nAt Embark we celebrate diversity and are committed to creating an inclusive environment for all employees. Embark provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\nSan Francisco, CA /\nEngineering – Perception /\nFull-time", "employment_type": "FULL_TIME", "date_posted": "2021-07-21T06:29:35.000Z"}, "company": {"name": "Embark Trucks", "link": "https://www.linkedin.com/company/embarktrucks"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}