{"location": {"country": "US", "locality": "Phoenix", "region": "Phoenix", "postal_code": "85009", "street_address": null, "latitude": 33.448204, "longitude": -112.072586}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Analyst", "industry": "Information Technology and Services", "description": "Need local to Phoenix AZ\nNeed (USC,GC and EAD only)\nNo H1 or C2C\nResponsibilities include but are not limited to:\nDesigning reports requiring analysis, writing of SQL, data mining, and presentation to technical and non-technical audiences in a variety of technical platforms (Power BI, Tableau, Excel, etc.)\nPrioritize business and operational needs\nExtract, import, clean, transform, and validate data\nWriting queries using SQL, T-SQL, and MS Access\nExperience with DB2\nIdentify, analyze, and interpret trends or patterns in complex data sets\nCreate standard and ad-hoc reports including detail, summary, history, snapshots, drill down, and other reports\nDevelop report specifications, test plans, prepare test data, execute tests, supporting documentation, and coordinate production implementation\nEstablish data connections with various data sources\nSetup report schedule, subscription, access process and procedures, and delivery method\nPresent data in lists, tables, charts, graphs, snapshots, crosstab, and other formats\nTailor the analysis and reporting methods by the type of data as well as to the intended audience\nReview key indicators to locate and correct problems\nFollow up and track remediation of issues\nWrite and present Desk-Aids and Work-Flows for both technical and non-technical audiences.\nKnowledge, Skills & Abilities:\nKnowledge of Service Level Agreement (SLA); laws, rules, security policies, privacy, data confidentiality management.\nKnowledge of Engineering workflow, IT lifecycle and system design, performance tuning, and Business Intelligence tools and features.\nKnowledge of Statistical and business analysis and research and analysis methodologies.\nKnowledge of multiple business intelligence software applications (SQL, SSIS, MS Visual Studio, Tableau, Visual Basic, MS Access, etc.) and multidimensional and relational database design.\nKnowledge of project management concepts, principles, and practices.\nSkilled in dimensional and relational database design.\nSkilled in analysis, design review, troubleshooting, implementation, and integration for applications.\nSkilled in keyboarding and use of Microsoft Office programs such as Excel, Word, Access, and PowerPoint and Google for gmail, calendar, chat, sheets, docs, slides, etc.\nProblem and negotiation skills to research and resolve issues.\nGood time management and organizations skills with attention to detail.\nSkilled in effective listening, oral and written communications skills to communicate technical and non-technical concepts to a variety of audiences.\nAbility to write business and functional requirements and diagram business processes, translate into technical solutions and reports, query and view objects, and present in a meaningful format.", "employment_type": "CONTRACTOR", "date_posted": "2021-07-21T02:07:23.000Z"}, "company": {"name": "Sharp Decisions", "link": "https://www.linkedin.com/company/sharp-decisions"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}