{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Our missionSleegal’s mission is to make legal services accessible to everyone. At Sleegal, we are using machine learning to build a legal marketplace that accurately matches clients with lawyers. Today, users have to go online to search for lawyers on their own, giving calls to multiple lawyers hoping to find the right one with the right price. With our tech, users find the lawyers that truly match their needs, with just a few lines of online chat, and completely for free. You will work closely with our founding team to develop our web products. You will play a critical role in improving the user experience for clients and lawyers. We will expect you to not only solve problems but propose new ideas that may fundamentally change our product.We are a dynamic team with a mixed background in law, tech, and business. Our core team members earned degrees from top US law schools and business schools and have deep experience building successful AI products in the Valley, ranging from autonomous vehicles to wearable devices. This position can start immediately. Apply by August 13, 2021.Location: remote (our HQ is in the Bay Area)What’s in it for youImplement a fully functioning web application that interacts with our AI-driven platformCollaborate with the founding team to enhance the user experience of the productAchieve engineering excellence by building a robust development pipelineDesign the machine learning infrastructure for the product and put it into realityYou may have to wear multiple hats as a frontend, a DevOps, a database admin, an IT admin, etc.Work with the founding team to design the company long-term roadmap and secure fundraisingYou could be a great fit if you haveBackground in computer science or a related field+2 years of industry experienceExpert in Javascript, React.js, SCSS for frontend and Node.js for backend developmentExperience with frameworks such as Next.js or GatsbyExperience with AWS, i.e. Lambda, DynamoDB, SQS, etc.Entrepreneurial, a self-starter, motivated to bring a product from 0 to 1Frontend design experience or AI experience is preferredWhat to expectAn experienced, productive founding team you can trustA true tech startup experience with a focus on ‘build’ with no bureaucracy or big egosYou will be working fully virtually with the team that is mainly based in the bay areaCompetitive salary with equity of a seed-stage companyThis is a 40-hour/week contractor position with the opportunity to convert to full-timeOur team mentalityWe put users first. We empathize with the user. We follow the \"KISS\" principle: Keep It Simple, Stupid.We are proactive. We have a bias for action. We own it. We hold each other accountable to deliver results.We are passionate. We know that we are building something great that’s meaningful.We trust each other, debate, and commit. We trust our team members’ intentions. Debates are encouraged, but once aligned, we follow the consensus wholeheartedly. We communicate and over-communicate. We are growing fast in different directions. We believe that communication is the key to alignment across teams.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T20:46:59.000Z"
    },
    "company": {
        "name": "Sleegal AI",
        "link": "https://www.linkedin.com/company/sleegal"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}