{"location": {"country": "US", "locality": "Dallas", "region": "Dallas", "postal_code": "75342", "street_address": null, "latitude": 32.777977, "longitude": -96.79621}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Machine Learning Engineer III", "industry": "Information Technology and Services", "description": "Title: Machine Learning Engineer III\nOverview Of Position\nWe’re looking for a dynamic ML Engineer with a passion for artificial intelligence to help drive a new generation of data and machine learning-enabled services and products to impact healthcare supporting Artificial Intelligence, Machine Learning, and Data Science solutions for Change Healthcare.\nYou'll enjoy working with a highly talented and diverse team of Engineers and Data Scientists specializing in deep learning, active learning, and classical machine learning, one of the richest data sets in US healthcare, nearly limitless cloud compute resources including Spark clusters and GPUs, and the ability to see your insights turned into real products.\nWhat will be my duties and responsibilities in this job?\nDesign, build, and launch efficient & reliable data pipelines to move and transform data (both large and small amounts )\nAssemble large, complex data sets that meet business requirements\nOptimize data delivery and re-design infrastructure for greater scalability.\nBuild the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources\nBuild analytics tools that utilize the data pipeline to provide actionable insights into customer acquisition, operational efficiency, and other key business performance metrics.\nDesign elegant interfaces between internal services and internal customers. Design, build and launch new data extraction, transformation, and loading processes in production.\nWork with internal and external stakeholders to assist with data-related technical issues and support data infrastructure needs\nWhat are the requirements needed for this position?\nMaster's degree in Computer Sciences, or Mathematics OR Bachelors's degree in Computer Sciences, or Mathematics +3 years of equivalent work experience\n2+ years of professional experience building and operating scalable distributed systems across the full software lifecycle, including design, implementation, testing, operations, and maintenance\nProgramming experience in one or more modern programming languages such as Java, Python, Scala, or C++\nAWS technologies (Lambda, EMR, EC2, SQS and RDS, etc )\nHands-on experience in tackling massive data sets with Yarn, Spark, Presto, Hive, Impala, etc\nFamiliarity with key-value stores and NoSQL databases like HBase, Cassandra, Hive, etc\nExperience with CI/CD using Jenkins\nFamiliarity with shell scripting using Bash or Zsh\nWhat other skills/experience would be helpful to have?\nCurious - willing to learn new things, and try new things, able to implement prototypes\nCommunicative - Comfortable presenting to other engineers, sharing ideas, and writing specifications and other documentation\nSense of Urgency - bring an agile, let’s get things done attitude\nPrior experience with healthcare data is a plus , but if you don’t have experience with healthcare data we will teach you everything you need to know!\nWhat are the working conditions and physical requirements of this job?\nGeneral office demands\n#northwest\n#southwest\nJoin our team today where we are creating a better coordinated, increasingly collaborative, and more efficient healthcare system!\nEqual Opportunity/Affirmative Action Statement\nChange Healthcare is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, genetic information, national origin, disability, or veteran status. To read more about employment discrimination protections under federal law, read\nEEO is the Law\nat https://www.eeoc.gov/employers/eeo-law-poster and the supplemental information at https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf .\nIf you need a reasonable accommodation to assist with your application for employment, please contact us by sending an email to applyaccommodations@changehealthcare.com with \"Applicant requesting reasonable accommodation\" as the subject. Resumes or CVs submitted to this email box will not be accepted.\nClick here https://www.dol.gov/ofccp/pdf/pay-transp_%20English_formattedESQA508c.pdf to view our pay transparency nondiscrimination policy.\nCalifornia (US) Residents: By submitting an application to Change Healthcare for consideration of any employment opportunity, you acknowledge that you have read and understood Change Healthcare’s Privacy Notice to California Job Applicants Regarding the Collection of Personal Information .\nChange Healthcare maintains a drug free workplace and conducts pre-employment drug-testing, where applicable, in accordance with federal, state and local laws.", "employment_type": "FULL_TIME", "date_posted": "2021-07-16T10:06:53.000Z"}, "company": {"name": "Change Healthcare", "link": "https://www.linkedin.com/company/change-healthcare"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}