{"location": {"country": "US", "locality": "Weston", "region": "Weston", "postal_code": "33004", "street_address": null, "latitude": 26.100613, "longitude": -80.39994}, "salary": {"currency": "USD", "min_value": 72400, "max_value": 122000, "unit": "YEAR"}, "job": {"title": "Software Engineer", "industry": "Computer Hardware,Computer Software,Information Technology and Services", "description": "Description\nDevelopment and unit testing code for both existing legacy systems and new Development initiatives.\nImplement solutions utilizing Object Oriented Programming and commonly related Data Structures\nCommunicate with team members to clarify requirements in able to meet team goals\nProvide input to the team to develop cutting-edge solutions to maximize performance, scalability, and distributed processing capabilities of the solution\nAttend Standup, kickoff and team meetings to provide status of current work, suggest opportunities for improvements and communicate challenges to ensure cohesion with all team members\nWork with their team in an agile context as it relates to software development\nFacilitate and participate in daily code reviews with the team\nQualifications\nDegree in Computer Science or related technical discipline\n0-2 or more years’ experience engaging with software/test engineers on enterprise level software development projects\n0 -2 years’ experience with basic programming techniques\n0 -2 years’ experience with OOP, Data Structures and Algorithms\nKnowledge of SaaS (Software as a Service), PaaS (Platform as a Service), and IaaS (Infrastructure as a Service) solutions\nKnowledge of API’s, Web Services and Forms development\nAbility to code in a functional or OOP language\nAbility to code basic SQL statements\nUnderstanding of object-oriented design and development\nUnderstanding of Agile or Lean Software Development experience such as Kanban or Scrum\nAbility to successfully work within a team and manage a dynamic environment with rapidly changing priorities\nExcellent problem-solving skills\nPositive team player attitude with excellent verbal and written communication skills\nSelf-motivated and willing to “do what it takes” to get the job done\nHigh degree of organizational skills\nStrong written and verbal communication skills\nSelf-motivation to learn new methodologies that will enhance job performance\nCorporate overview\nHere at UKG, Our Purpose Is People. UKG combines the strength and innovation of Ultimate Software and Kronos, uniting two award-winning, employee-centered cultures. Our employees are an extraordinary group of talented, energetic, and innovative people who care about more than just work. We strive to create a culture of belonging and an employee experience that empowers our people. UKG has more than 13,000 employees around the globe and is known for its inclusive workplace culture. Ready to be inspired? Learn more at www.ukg.com/careers\nEEO Statement\nEqual Opportunity Employer\nUltimate Kronos Group is proud to be an equal opportunity employer and is committed to maintaining a diverse and inclusive work environment. All qualified applicants will receive considerations for employment without regard to race, color, religion, sex, age, disability, marital status, familial status, sexual orientation, pregnancy, genetic information, gender identity, gender expression, national origin, ancestry, citizenship status, veteran status, and any other legally protected status under federal, state, or local anti-discrimination laws.\nView The EEO is the Law poster and its supplement.\nView the Pay Transparency Nondiscrimination Provision.\nUKG participates in E-Verify. View the E-Verify posters here.\nDisability Accommodation\nFor individuals with disabilities that need additional assistance at any point in the application and interview process, please emailor please call 1 (978) 250 9800.", "employment_type": "FULL_TIME", "date_posted": "2021-08-27T04:37:37.000Z"}, "company": {"name": "UKG (Ultimate Kronos Group)", "link": "https://www.linkedin.com/company/ukg"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}