{"location": {"country": "US", "locality": "Sunnyvale", "region": "Sunnyvale", "postal_code": "94089", "street_address": null, "latitude": 37.373676, "longitude": -122.036575}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer", "industry": "", "description": "Title: Software Engineer\nLocation: Sunnyvale, California\nJob Description:\nAs a Software Engineer in the Engineering Department, your primary responsibilities will include working side by side with R&D and 3rd party vender on the development of new automated test equipment. You will be expected to demonstrated an excellent working knowledge of C/C# programming, developing application and automating tool per product required. You are a self-motivated professional who demonstrates the ability to quickly grasp new technologies, products and use cases.\nResponsibilities will include:\nParticipate in product functional, system architecture and design review.\nCollaborate effectively with peers and venders to solve complex problems, deliver end-to-end quality in our product and customer experience.\nTriage customer issues and find timely creative solution to customer problems.\nExecute test cases, analyze and report test results to internal R&D or venders.\nWrite API and feature documentation.\nRequired qualifications:\nBS/MS in Computer Science or equivalent experience.\n2+ year’ working experience on Windows/Linux SW development with strong debugging skills.\nHave strong programming skills on C#, Java, Python, etc.\nKnowledge of cloud-based services or imaging process will be preferred.\nStrong collaboration and communication skills.\nStrong initiative and ability to work independently.", "employment_type": "FULL_TIME", "date_posted": "2021-10-13T17:36:58.000Z"}, "company": {"name": "FutureDial, Incorporated", "link": "https://www.linkedin.com/company/futuredial"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}