{"location": {"country": "US", "locality": "Irving", "region": "Irving", "postal_code": "75063", "street_address": null, "latitude": 32.813877, "longitude": -96.949936}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Scientist", "industry": "Telecommunications,Information Technology and Services,Computer &amp; Network Security", "description": "Job # 571724\nWhen you join Verizon\nVerizon is a leading provider of technology, communications, information and entertainment products, transforming the way we connect across the globe. We’re a diverse network of people driven by our ambition and united in our shared purpose to shape a better future. Here, we have the ability to learn and grow at the speed of technology, and the space to create within every role. Together, we are moving the world forward - and you can too. Dream it. Build it. Do it here.\nWhat You’ll Be Doing...\nThis position will be in the Global Supply Chain/Real Estate Advanced Analytics team. It is an individual contributor role with considerable autonomy in terms of responsibilities.\nDevelops quantitative advanced analytical models and computational solutions using large-scale data manipulation and transformation, statistical analysis, data mining, visualization, optimization and related advanced analytical techniques to solve complex business challenges.\nEngages with business and IT partners, you enable the architecture required to implement analytical solutions into our current supply chain, real estate and sourcing/procurement ecosystem.\nReceives high-level directions from the manager, but is quite independent in tactical and day-to-day tasks for the assigned projects.\nInteracts with various Verizon teams such as sourcing & procurement, real estate operations, supply planning & distribution, warehouse distribution & transportation, forward and reverse device forecasting, and device/accessory assortment planning.\nWhat We’re Looking For...\nYou are a highly skilled expert in quantitative modeling, optimization, statistics, data mining and visualization. You have experience with SQL and in data visualization software like Tableau, QlikView or Excel. You have excellent verbal and written communication skills, and be proficient in engaging and influencing large teams and functional leaders.\nYou’ll Need To Have\nBachelor’s degree or four or more years of work experience.\nFour or more years of relevant work experience.\nExperience with SQL and statistical software packages (e.g., R, Python).\nCoding experience (for personal use) in a general-purpose programming language (e.g., Java or Python).\nExperience engaging and influencing large teams and functional leaders.\nEven Better If You Have\nBachelor’s degree in Supply Chain, Operations Research, Industrial Engineering, Statistics, Economics or a related field or four or more years of work experience.\nMaster’s degree in Operations Research, Industrial Engineering, Statistics, Economics or a related field.\nVerbal and written communication skills.\nExperience with simulation software packages (e.g. ExtendSim).\nExperience with optimization models such as Linear & Integer Programming, Network and Routing Optimization, and tools such as OPL and CPLEX to solve such problems.\nExperience creating analytical data sets.\nExperience with data visualization software like Qlikview, Tableau or Excel.\nExperience and competency in supply chain management.\nEqual Employment Opportunity\nWe're proud to be an equal opportunity employer - and celebrate our employees' differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our\ndiversity and inclusion\npage to learn more.\nJob Family: TEC\nBusiness Unit: HQOVH", "employment_type": "FULL_TIME", "date_posted": "2021-08-17T09:48:31.000Z"}, "company": {"name": "Verizon", "link": "https://www.linkedin.com/company/verizon"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 48, "seniority_level": "Mid-Level"}}