{"location": {"country": "US", "locality": "Overland Park", "region": "Overland Park", "postal_code": "66214", "street_address": null, "latitude": 38.97482, "longitude": -94.6836}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "REMOTE Sr Software Engineer - Python, React, PostgreSQL, GraphQL", "industry": "Hospital &amp; Health Care", "description": "If you are a REMOTE Senior Software Engineer with experience, please read on!\nWe are looking for a Senior Software Engineer to join our team in Overland Park, KS! You will work independently on complex assignments and assists in coming up with appropriate procedures on new assignments. You'll also assist in serving as a resource to both internal and 3rd party team members on higher level issues as well as analyzing and designing specs of junior team members.\nWhat You Will Be Doing\nUtilizing technical expertise; creates system requirements, performs design and analysis, and coding and unit testing of complex to highly complex system functionality and/or defect correction across multiple platforms.\nResolves complex technical design issues.\nProvides functional and/or technical guidance in evaluating applications systems or evaluating requests for proposals.\nCoordinates changes and influences and prioritizes tasks with business or technical departments.\nAnalyzes and influences technical, system, and/or user requirements.\nIdentifies and creates solutions to improve system performance and availability.\nFacilitates root cause analysis of system issues to minimize impact and future occurrences.\nCreates system documentation/play book(s) and serves as a lead technical reviewer and contributor in requirements, design and code reviews.\nAnalyzes and designs specifications for less experienced engineers.\nActs as a technical resource throughout the development life cycle.\nMay also actively contribute to the technical and soft skills development of team members.\nAssists team leads and management with delegation of work to cross functional and third party team members for execution through the full development life cycle.\nKeeps management appropriately informed of progress and issues.\nCoordinates system application transition from development teams to maintenance and production teams.\nConstructs and implements necessary controls to assure system/application traceability.\nWhat You Need for this Position\nPython\nREACT\nPostgreSQL\nGraphQL\nAPI Gateway\nAWS Lambda\nEC2\nAgile\nMicroservices\nSNS\nExcellent communication skills!\nFully REMOTE!\nWhat's In It for You\nCompetitive compensation ($130-215k/yr DPE)\n401k w/match\nFull health benefits (medical, dental, vision)\nGenerous PTO\nFun work culture\nWe pride ourselves in a healthy work/life balance!\nSo, if you are a REMOTE Senior Software Engineer with experience, please apply today!\nThis job is open to telecommute candidates.\nApplicants must be authorized to work in the U.S.\nSo, if you are a REMOTE Senior Software Engineer with experience, please apply today!\nEmail Your Resume In Word To\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nNick.Valenti@CyberCoders.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : NV1-1639671 -- in the email subject line for your application to be considered.***\nNick Valenti - Executive Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\nYour Right to Work\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.", "employment_type": "FULL_TIME", "date_posted": "2021-08-25T17:32:31.000Z"}, "company": {"name": "CyberCoders", "link": "https://www.linkedin.com/company/cybercoders"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}