{"location": {"country": "US", "locality": "Atlanta", "region": "Atlanta", "postal_code": "30355", "street_address": null, "latitude": 33.748547, "longitude": -84.3915}, "salary": {"currency": "USD", "min_value": 67100, "max_value": 139000, "unit": "YEAR"}, "job": {"title": "Software Engineer (New College Grad)", "industry": "Computer &amp; Network Security", "description": "Company Description\nZscaler (NASDAQ: ZS) accelerates digital transformation so that customers can be more agile, efficient, resilient, and secure. The Zscaler Zero Trust Exchange is the company’s cloud-native platform that protects thousands of customers from cyberattacks and data loss by securely connecting users, devices, and applications in any location.\nWith more than 10 years of experience developing, operating, and scaling the cloud, Zscaler serves thousands of enterprise customers around the world, including 450 of the Forbes Global 2000 organizations. In addition to protecting customers from damaging threats, such as ransomware and data exfiltration, it helps them slash costs, reduce complexity, and improve the user experience by eliminating stacks of latency-creating gateway appliances.\nZscaler was founded in 2007 with a mission to make the cloud a safe place to do business and a more enjoyable experience for enterprise users. Zscaler’s purpose-built security platform puts a company’s defenses and controls where the connections occur—the internet—so that every connection is fast and secure, no matter how or where users connect or where their applications and workloads reside.\nJob Description\nYou will develop software to detect and block different type of security threats including viruses, malware, etc\nYou will be expected to participate in all phases of the product development cycle, from definition, design, through implementation and test\nQualifications\nBachelor’s or Master's degree in Computer Science or a Computer-related discipline\nProficiency in C, Java or Python programming language is required\nStrong in Algorithms and Data Structures\nStrong in fundamentals - High-performance Computing, Event-based programming, Multi-threading, Memory optimization, Fault Tolerance etc\nExperience with FreeBSD and Unix\nExcellent verbal, written and interpersonal skills\nSelf-starter takes initiative & ownership, identifies and completes tasks; goal driven\nAbility to work with remote teams, handle multiple tasks, prioritize and meet deadlines\nYou are a highly motivated, self-driven individual who relishes working in a startup environment\nPreferred Qualifications\nWorking experience in Security domain\nKnowledge of TCP-IP and networking protocols\nKnowledge of Database\nAdditional Information\nAll your information will be kept confidential according to EEO guidelines.\nWhat You Can Expect From Us\nAn environment where you will be working on cutting edge technologies and architectures\nA fun, passionate and collaborative workplace\nCompetitive salary and benefits, including equity\nWhy Zscaler?\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team.\nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com.\nZscaler is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.", "employment_type": "FULL_TIME", "date_posted": "2021-07-31T00:50:00.000Z"}, "company": {"name": "Zscaler", "link": "https://www.linkedin.com/company/zscaler"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 120, "seniority_level": "Lead"}}