{"location": {"country": "US", "locality": "Kansas City Metropolitan Area", "region": "Kansas City Metropolitan Area", "postal_code": "64101", "street_address": null, "latitude": 39.051476, "longitude": -94.48047}, "salary": {"currency": "USD", "min_value": 74500, "max_value": 124000, "unit": "YEAR"}, "job": {"title": "Software Engineer", "industry": "Insurance", "description": "Mylo is a fast-growing insurtech leader with an embeddable digital insurance platform that enables our partners to offer expert coverage advice and solutions to their clients. Our proprietary technology – the Mind of Mylo™ – delivers precise coverage recommendations to business owners and individuals. It matches risks with carrier appetites and determines the right insurance at the best value from multiple leading carriers for a wide variety of needs, including business, small group benefits, home, auto, life, individual health, and Medicare.\nBacked by global investor Guggenheim Partners and the world’s largest independent broker, Lockton, and drawing on 55 years of Lockton insurance expertise, Mylo offers expert insurance recommendations online or over the phone with licensed agents. More information about Mylo can be found at www.choosemylo.com\nWe are revolutionizing insurance to protect what matters.\nDescription:\nDo you like to have your hands in a little bit of everything? We are looking for versatile, full stack developers that are comfortable with (and excited by) working on a variety of different kinds of projects. In addition to our consumer facing web features we also support our marketing department and insurance agent sales team, building tools and integrations to make them more effective and efficient. If you enjoy solving various problems with code and technology, we are the place for you.\nAs part of a relatively small development team, you’ll have ownership over technology and architectural decisions, and be given high level business problems to solve with code. You'll be able to see the direct impact of your work on our users (internal and external), and our ability to scale and grow our business.\nOur Technology Stack:\nNode.js microservices\nReact.js, Redux, TypeScript, MaterialUI\nAWS (EC2, S3, EKS, etc)\nKafka\nPostgres\nGithub, Travis CI, Docker Hub\nEssential Duties and Responsibilities:\nDesign and build software that is efficient, fault tolerant, and testable\nCollaborate with business and technical roles to ensure that business needs are being met.\nGiven the nature of the business (insurance), apply due diligence to security and HIPAA best practices.\nBe trustworthy; have integrity and a strong work ethic.\nExercise initiative in taking on tasks with minimal direction.\nLearn new areas independently and without formal training.\nEducation/Experience:\nAn understanding of Continuous Delivery principles and experience implementing them.\nAn understanding of Agile principles and experience working in such an environment.\nAbility to apply a wide variety of open source technologies and tools.\nA bachelor’s degree.\nExperience handling large scale, multi-tenant cloud software.\nExperience with multiple programming and scripting languages (e.g., JavaScript, Python, Ruby, C#).\nExperience with source code management systems, ideally GitHub.\nThe ideal candidate will have experience with container technologies such as Docker.\nThe ideal candidate will have experience with cloud platforms such as AWS.\nThe ideal candidate will have experience with SQL and noSQL databases.\nHigh emotional intelligence.\nAbility to communicate clearly in both verbal and written form.\nBenefits:\nOutstanding benefits package including health, dental and vision\n401(k) up to 6% match and immediate vesting\nAssociate discount on home and auto insurance\nFree financial coaching through Principal\nWellness program (incentives and services for healthy living)\nFeedback culture through OfficeVibe weekly survey", "employment_type": "FULL_TIME", "date_posted": "2021-07-30T00:35:37.000Z"}, "company": {"name": "Mylo, a Lockton Company", "link": "https://www.linkedin.com/company/mylo-insurance"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}