{"location": {"country": "US", "locality": "Baltimore", "region": "Baltimore", "postal_code": "21226", "street_address": null, "latitude": 39.290443, "longitude": -76.612335}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "SOFTWARE ENGINEER - Remote Opportunity", "industry": "Information Technology and Services,Computer Software,Financial Services", "description": "At Pitney Bowes, we do the right thing, the right way.\nAs a\nSoftware Engineer\nfor Pitney Bowes, you can too.\nWe have amazing people who are the driving force, the inspiration and foundation of our company. Our thriving culture can be broken down into four components:\nClient. Team. Win. Innovate.\nWe Actively Look For Prospects Who\nAre passionate about client success.\nEnjoy collaborating with others.\nStrive to exceed expectations.\nMove boldly in the quest for superior and best in market solutions.\nYou Are\nA\nSelf-motivated\nContributor\nwho can\nbe part of a team that designs and develops cloud-based microservices that are consumed by customer facing applications. Also, collaborating across the organization with architects, UX experts, software engineers and product managers to deliver cloud solutions.\nYou are a\nPerformance-driven\nindividual\nwho\nwants a role that contributes to the success of all applications a business delivers to their customers, then this role is for you!\nYou Will\nFull Stack development\nDesigning and solving complex software engineering solutions\nWork with cross-functional teams to design and develop innovative solutions that meets the needs of our customers\nEvaluate and incorporate new technologies into new and existing frameworks as applicable\nCollaborate with and mentor members of the team and other coworkers.\nBe agile, embrace change and should be able to work independently.\nYour Background\nQualifications - External\nAs a Software Engineer You Have\nB.S. in Computer Science, Engineering or related discipline\nAt least 4 years of experience in designing and developing large scale, mission critical and high available/scalable solutions\nStrong In\nAngular and Node.js\nCI/CD toolset: GitLab CI/CD, Jenkins, Ansible\nProficient In\nMicroservices Development\nScripting: Python or JavaScript\nCore Java, Spring MVC, Spring Boot and Hibernate\nDatabases and web storage\nAWS ecosystem, Docker, K8S\nPreferred\nAgile Methodology Experience\nExcellent interpersonal skills and the ability to work with diverse and distributed product teams\nExperience programming in Go\nExperience with Cloud Native Technologies\nWe Will\nProvide the opportunity to grow and develop your career\nOffer an inclusive environment that encourages diverse perspectives and ideas\nDeliver challenging and unique opportunities to contribute to the success of a transforming organization\nOffer comprehensive benefits globally (pbprojectliving.com)\nOur Team\nOur Software team powers global commerce, processing billions of transactions every year. Our Software technology and solutions help businesses operate faster and more efficiently. How? By identifying trusted data and insights to create targeted, effective messaging, by providing accurate geographic data to make smarter business decisions, and by delivering relevant and engaging\nPitney Bowes is an Equal Employment Opportunity/Affirmative Action Employer that values diversity and inclusiveness in the workplace.\nWomen/Men/Veterans/Individuals with Disabilities/LGBTQ are encouraged to apply.\nAll interested individuals must apply online. Individuals with disabilities who cannot apply via our online application should refer to the alternate application options via our Individuals with Disabilities link.", "employment_type": "FULL_TIME", "date_posted": "2021-07-20T05:46:35.000Z"}, "company": {"name": "Pitney Bowes", "link": "https://www.linkedin.com/company/pitney-bowes"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 48, "seniority_level": "Mid-Level"}}