{"location": {"country": "US", "locality": "Blue Ash", "region": "Blue Ash", "postal_code": "43334", "street_address": null, "latitude": 39.231274, "longitude": -84.377045}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Senior Full-Stack Software Engineer - Java OR Ruby", "industry": "Accounting", "description": "If you are a\nSenior Full-Stack Software Engineer\nwith experience, please read on!\nThis is a\n100% REMOTE position, forever\n!\nWe are a niche FinTech that is growing and continually transforming our industry! We are looking for a Senior Full-Stack Software Engineer to join our team! We are looking for someone steeped in either Java or Ruby who loves the FinTech world and is all about rolling up their sleeves and wearing many hats!\nWhat You Will Be Doing\nDesign and develop high quality, scalable, multi-threaded, multi-tier, web-based applications using the latest technologies and software best practices\nBe responsible for collaborating on a cross-functional team in story-mapping exercises; in certain cases sharing the responsibilities with the Principal Engineer in outlining the overall scope and user story process of product developments and enhancements for a project; participate in release plan overview as well as identifying areas of risk & exposure in group discussions\nParticipate in retrospectives, sprint planning, and sprint reviews for the team\nParticipate in directing dedicated QA testing resources for the team youre working on\nWork with cross functional team in an agile SDLC; collaborate with product owners, technical team-members, business stakeholders and designers to implement enhancements or new applications\nPropose innovative solutions to complex problems\nWork closely with local and remote team members and management, to achieve high team morale and productivity\nShare best practices and improve processes within and across agile teams\nWhat You Need for this Position\nBachelor's degree in Computer Science preferred\n5+ Years of experience as a full-stack engineer\nDemonstrated leadership experience, either project or people leadership\nNeeds strong understanding of quality systems, continuous integration, unit and integration testing\nSound knowledge of\nRuby on Rails or Java\nProven strong understanding of design patterns\nProven strong understanding of Service-Oriented Architecture\nBackground in a MVC-based implementation of a web platform\nDemonstrated ability to work well in ambiguous situations and pivot quickly\nDemonstrated experience with Agile or Scrum software development methodologies\nProven ability to multi-task, organize, and prioritize work\nWhat's In It for You\nWe offer a compensation package of base, bonus and equity in a collaborative environment with great leadership!\nThis is a 100% full REMOTE position, forever!\nSo, if you are a Senior Full-Stack Software Engineer with experience, please apply today!\nEmail Your Resume In Word To\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nRhona.Kannon@CyberCoders.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : RK3-1644101 -- in the email subject line for your application to be considered.***\nRhona Kannon - Principal Director - CyberCoders\nApplicants must be authorized to work in the U.S.\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\nYour Right to Work\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.", "employment_type": "FULL_TIME", "date_posted": "2021-07-31T07:03:52.000Z"}, "company": {"name": "CyberCoders", "link": "https://www.linkedin.com/company/cybercoders"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}