{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "About ValitanaValitana is a fintech startup providing cutting-edge software as a service solutions to institutional investors. Our current offering includes advanced financial analysis, trade flow, and portfolio management solutions. Valitana was founded in 2017 and has grown at a rapid pace, providing services to a wide range of industry leaders. As we continue to grow, we are looking for exceptional Software Engineers to join our team and help accelerate our business and our technology.  A successful candidate will help Valitana continue to grow, exercising an eye for detail across all aspects of the development lifecycle while maintaining organization and good code hygiene. This engineer should be able to effectively communicate both with Valitana’s internal teams and with our clients. Key ResponsibilitiesDesign, implement and maintain components and frameworks that add to Valitana’s toolsetCollaborate with internal and external clients to understand their application development needsResearch new technologies and use-cases. Seek out inefficiencies and match relevant technology solutions to resolve themParticipate in code reviews and provide technical feedback to the teamSuccessful Candidates possess these qualitiesSelf-starter who is passionate about technologyKeen eye for automation and improving efficiencyAbility to provide leadership and accountability for work they undertakeTakes ownership of their work and has exceptional attention to detailHas excellent communication skills and the ability to articulate their thoughts and ideasComfortable with fast-paced and strongly collaborative environmentsAble to take on ideas and feedback from both technical experts and business thought-leaders Required skills and experienceFluency in HTML, CSS, JavascriptExperience in component-based frontend frameworks, ideally AngularExperience in a backend language, ideally C#Working knowledge of relational databasesAttention to good UI/UX designGood communication skillsAbility to work in agile-based project management structureFamiliarity with Git Preferred skills and experienceExperience with PythonExperience with cloud platforms such as AWS and AzureFamiliarity with debugging front-end rendering & performance issues using browser development toolsUnderstanding of how to optimize a component’s UI/UX performance",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10T18:08:36.000Z"
    },
    "company": {
        "name": "VALITANA",
        "link": "https://www.linkedin.com/company/valitana"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Greenwich",
        "region": "CT",
        "postal_code": "06807",
        "street_address": null,
        "latitude": 41.026527,
        "longitude": -73.62855
    }
}