{"location": {"country": "US", "locality": "Nashville Metropolitan Area", "region": "Nashville Metropolitan Area", "postal_code": "37201", "street_address": null, "latitude": 36.172813, "longitude": -86.78488}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Scientist", "industry": "Logistics and Supply Chain", "description": "The\nData Scientist\nensures that the data assets of the organization are supported by its information technology architecture. The Data Scientist is responsible for developing predictive and prescriptive analytics models, creating efficient algorithms, and innovating use of data. The Data Scientist will work closely with the rest of the operations teams, IT, and internal business partners to identify, evaluate, design, and implement statistical analyses and data exploration/visualization of internal and external, structured and unstructured, public and proprietary data.\nJob Duties\n:\n[1]\n- [2]\nPrimary Duties:\nLeads the organization's planning of GEODIS’ data model and data architecture through continual redesign of the data model and/or transition to a common model\nRecommends strategies to management on approaches to optimize business success based on changing business needs\nEvaluates applicability of leading edge technologies and uses information to significantly influence future business strategy\nAnalyzes complex business and competitive issues and discerns the implications for systems support; including identifying, defining, directing, and performing project issue analysis of the technical and economic feasibility of proposed data solutions\nDesigns projects with the proper tools and methodologies to successfully address cross-technology and cross-platform issues within the business and/or the future architecture of the organization\nProposes and leads projects required to support the development or the organization's data infrastructure needs and provides intelligence on advances in database technologies\nDevelops partnerships with senior users to understand business needs and define future data requirements\nInteracts with internal and external audiences to develop effective networks to ensure business needs are met\nOther duties as required and assigned\nRequirements:\nEducation and Experience\nMaster’s degree in Data Science, Computer Science, Statistics or Business Administration\nMinimum 7 years of related experience and/or training; or an equivalent combination of education and experience\nExperience with analytical and data mining efforts which could include but not limited to clustering, segmentation, logistic and multivariate regression, decision/CART trees, neural networks, time-series analysis, sentiment analysis, and topic modeling\nExperience with optimization algorithms; Bayesian Optimization, Genetic Algorithm, and Particle Swarm Optimization, etc.\nKnowledge of Experience in modeling and an ability to implement models or model components from scratch.\nExperience using statistical computer languages; Python, R, etc.\nPC literate with experience with Microsoft Outlook, Word, Access and Excel\nEssential Skills:\nExcellent written and oral communication skills that demonstrate a proven ability to develop relationships with a range of internal and external customers\nExcellent planning and organizational skills\nAbility to read and interpret documents such as safety rules, operating and maintenance instructions, and procedure manual\nAbility to write routine reports and correspondence\nAbility to apply common sense understanding to carry out instructions furnished in written, oral, or diagram form\nEnvironment:\nWhile performing the duties of this job, the employee frequently is required to sit, reach with hands and arms, and talk. The employee is regularly required to use hands to finger, handle, or feel. The employee must occasionally lift and/or move up to 15 pounds. The employee is regularly exposed to ambient lighting and temperate climate conditions.\n[1]The following statements are intended to describe the general nature and level of work being performed. They are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified.\n[2] Job Duties as documented in this job description are considered “Essential Functions” and have been created by the standards of the Equal Employment Opportunity Commission (EEOC). The standards of the Americans with Disabilities Act (1990) require that employees be able to perform “Essential Functions” of the job with or without reasonable accommodation. Reasonable accommodations may be made to enable individuals with disabilities to perform the “Essential Functions”.", "employment_type": "FULL_TIME", "date_posted": "2021-08-09T21:09:23.000Z"}, "company": {"name": "GEODIS", "link": "https://fr.linkedin.com/company/geodis"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 84, "seniority_level": "Senior"}}