{"location": {"country": "US", "locality": "New York", "region": "New York", "postal_code": "10132", "street_address": null, "latitude": 40.713047, "longitude": -74.00723}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer", "industry": "Information Technology and Services,Computer Software,Internet", "description": "About Weaveworks\nWeaveworks was founded in 2014 and we are the company behind popular Kubernetes tools like Flux, Scope, the official CLI for Amazon EKS called eksctl and the flagship enterprise product Weave Kubernetes Platform.\nOur mission is to help the world’s leading organizations to adopt Kubernetes and other Cloud Native technologies and working practices. Enterprises use our products and services to build better software and operate it reliably, at scale. Our approach brings together container-based application deployment, Kubernetes, and operations tooling in a model we call GitOps.\nThe role\nWe want to bring an empathetic and collaborative engineer into one of our teams that focuses on a blend of open source and commercial code. We are building a product that enables organizations to operate with a GitOps mindset. This needs someone who is comfortable navigating sometimes unclear scenarios and is proactive in wanting to help figure things out. You will be helping to develop and maintain tools and products which make using cloud-managed and on-premise Kubernetes installations easy.\nWhat You’ll Be Doing\nHands-on development work in Golang\nWorking on building out our progressive delivery capabilities around the Weave GitOps Core product and the open source technologies that are its foundation\nEnjoys iterative development and likes making things progressively better working in an agile process\nKnows how to balance maintenance tasks with delivery of new features\nLikes to think about our end users and cares about their experience.\nIs comfortable collaborating with others; UX, design, QA, customer care\nCollaborating with the product manager to:\nClarify and refine issues/requests/features\nContribute to sprint planning and sharing ideas\nCommunicate with our external partners\nCommunicating with the open source community\nParticipating in wider Weaveworks engineering culture (lunch and learns/sprint reviews)\nWe’re looking for you if you:\nCoding experience within a commercial context\nBasic understanding of Kubernetes and/or Cloud Native technology in general\nHave an understanding of Git\nSee the value in unit and integration tests\nAre comfortable working in a fully remote and distributed team\nHave a team-first mindset and demonstrate curiosity\nLike working in an agile environment and getting things done iteratively to make things better for our users\nEnjoy communicating, collaborating, and helping each other out :)\nAre familiar with or have experience with one or more public cloud providers (Google Cloud, AWS, Azure)\nWe really want to hear from you if you:\nThink this sounds cool and are unsure if you should apply, especially typically underrepresented folks, please apply anyway\nAre excited by developer tooling\nWant to contribute to making a corner of the tech industry more inclusive and welcoming to all.\nCommunicates proactively and has a team-first mindset\nContributes to an inclusive and collaborative environment\nDemonstrates curiosity and willingness to learn\nSounds good? Excellent!\nWeaveworks is committed to diversity in its workforce and is proud to be an equal opportunity employer. Weaveworks considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. Weaveworks is an Affirmative Action and Equal Opportunity Employer.\nBlack lives matter.\nBy submitting your interest in this job, you agree to receive text notifications with additional steps to complete your job application. You will receive up to 6 messages from the number \"63879\". Message & data rates may apply. Please refer to our privacy policy for more information.", "employment_type": "FULL_TIME", "date_posted": "2021-10-05T00:00:00.000Z"}, "company": {"name": "Weaveworks", "link": "https://uk.linkedin.com/company/weaveworks"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}