{
    "job": {
        "title": "Software Engineer ",
        "industry": "Information Technology and Services",
        "description": "PriceSpider is revolutionizing retail data technology by capturing actionable insights that improve the customer experience. Combining decades of data on consumer shopping behaviors with its proprietary data collection platform, PriceSpider arms brands with intelligence from thousands of ecommerce sites and marketplaces to help them drive sales conversions and protect brand integrity at every possible digital touch point. PriceSpider helps the world’s biggest brands enrich the consumer journey and build long-lasting relationships with their shoppers, resulting in more revenue and higher profit margins.We are looking for enthusiastic and passionate engineers to join our team. If you would enjoy working to bring real world value to many of the world’s largest companies, we would love to hear from you. Our platform runs thousands of jobs and processes millions of requests each day as we strive to collect the most accurate information about the way our customers’ products are used and consumed around the globe.&amp;nbsp;&amp;nbsp;Essential Functions & Responsibilities:&amp;nbsp;  - Work individually and collaboratively with global teams to create&amp;nbsp;both scalable and&amp;nbsp;maintainable solutions towards team and company&amp;nbsp;goals&amp;nbsp;   \n  - Promote high quality coding standards through the employment of industry best practices, including unit-testing,&amp;nbsp;CI/CD, and our expanding cloud&amp;nbsp;only&amp;nbsp;strategy&amp;nbsp;   \n  - Take responsibility for project quality, represented primarily by user adoption and data usability and accuracy   \n  - Identify and engage in opportunities to reduce legacy application inefficiencies as newer projects and solutions progress&amp;nbsp;   \n  - Create and maintain documentation and training material&amp;nbsp;   \n  - Research and explore new technology and systems for the application of improved solutions to internal and external client obligations&amp;nbsp;   \n  - Participate in project and team planning, including those responsible for the identification and enumeration of product requirements&amp;nbsp;   \n&amp;nbsp;Requirements and Qualifications:&amp;nbsp;  - 4+ Years of experience&amp;nbsp;in web application development preferably&amp;nbsp;involving technologies promoting the movement, maintenance, and quality of&amp;nbsp;data&amp;nbsp;   \n  - Experience with cloud service providers, preferably AWS (handled&amp;nbsp;standard cloud service technologies including VMs,&amp;nbsp;containers,&amp;nbsp;queueing systems...)&amp;nbsp;   \n  - Thorough understanding of SQL Databases (MSSQL and Postgres)   \n  - Experience with multiple languages,&amp;nbsp;preferably&amp;nbsp;Go and NodeJS (Typescript)&amp;nbsp;   \n  - Experience with ReactJS and functional components   \n  - Strong understanding of REST architecture and how to build scalable API’s   \n  - Experience with CI / CD&amp;nbsp;procedures and&amp;nbsp;tools&amp;nbsp;(GitHub Actions, Jenkins,&amp;nbsp;...)&amp;nbsp;   \n  - Very analytical thinking and adaptability to frequently changing needs&amp;nbsp;with&amp;nbsp;an absolute&amp;nbsp;solution orientation&amp;nbsp;   \n  - Excellent communication skills in an international environment   \n&amp;nbsp;Tech Stack:  - Any of: NodeJS, Golang, C#   \n  - PostgreSQL, MSSQL   \n  - Github&amp;nbsp;and&amp;nbsp;Github&amp;nbsp;Actions,&amp;nbsp;CI/CD&amp;nbsp;   \n  - AWS&amp;nbsp;in&amp;nbsp;general&amp;nbsp;   \n  - Container,&amp;nbsp;Kubernetes, Linux&amp;nbsp;   \n  - Messaging&amp;nbsp;(e.g.&amp;nbsp;RabbitMQ)   \n  - Nice to have, any of:&amp;nbsp;Jenkins, C#, Elastic Search, Kafka   \n&amp;nbsp;Location:&amp;nbsp;We are hiring for this position in Irvine, CA or remote (PST). Remote work allowed.PriceSpider is an equal opportunity employer that is committed to inclusion and diversity.&amp;nbsp;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10T21:08:36.000Z"
    },
    "company": {
        "name": "PriceSpider",
        "link": "https://www.linkedin.com/company/pricespider"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "California",
        "region": "United States",
        "postal_code": "93266",
        "street_address": null,
        "latitude": 37.254673,
        "longitude": -119.61728
    }
}