{"location": {"country": "US", "locality": "Mountain View", "region": "Mountain View", "postal_code": "94040", "street_address": null, "latitude": 37.39008, "longitude": -122.08139}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Scientist", "industry": "Electrical/Electronic Manufacturing,Information Technology and Services,Computer Software", "description": "Job Description\nPosition Title:\nData Scientist\nPosition Description:\nProtingent Staffing has an exciting opportunity for a Data Scientist opportunity with our client located in San Francisco bay area.\nJob Requirements\nAs a Data Scientist you will work with a product team to design, develop, and launch efficient and reliable data pipelines to move, analyze, and model data and to provide intuitive analytics from large and complex datasets.\nA strong systematic mind is a priority, as well as the ability to communicate clearly in multiple technical contexts.\nThe ideal candidate should be passionate about finding insights in large datasets, while maintaining attention to database architecture, data reliability, efficiency, and quality.\nAs we are continually releasing new features and products, the ability to construct elegant system-level data architecture is expected.\nDiscover datasets that could help in solution development\nData curation, analysis, quantitative modeling\nValidation and quality assurance of data, models and results\nDeploy and implement solutions in collaboration with product team\nInteract with the product team on current and upcoming user requirements\nJob Qualifications\nMasters or Ph.D. in Sciences, Mathematics or Engineering, especially numerical methods and simulations.\nStrong background in database management solutions, familiarity with databases such as MySQL and Oracle\nLarge-scale data processing and implementing batch processing pipelines in HPC or cloud architecture\nBackground in Statistics is expected, and Experience with Machine Learning is a bonus\nExperience with Cloud Computing environments (AWS, GCloud, Azure) is a plus\nAbout Protingent:\nProtingent is a niche provider of top Engineering and IT talent to Software, Electronics, Medical Device, Telecom and Aerospace companies nationwide. Protingent exists to make a positive impact and contribution to the lives of others as well as our community by providing relevant, rewarding and exciting work opportunities for our candidates.\nBenefits Package:\nProtingent offers competitive salary, 100% paid health insurance, education/certification reimbursement, pre-tax commuter benefits, Paid Time Off (PTO) and an administered 401k plan.", "employment_type": "FULL_TIME", "date_posted": "2021-07-20T06:08:33.000Z"}, "company": {"name": "Protingent", "link": "https://www.linkedin.com/company/protingent"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}