{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services",
        "description": "This position is responsible for design, coding, unit testing, and documentation of applications for Heartland’s customers. This position will also work closely with other Team Members and clients to provide custom .NET and CMS based software solutions. In addition, this position will also meet with new and existing clients to frame up and estimate new solutions.   ESSENTIAL FUNCTIONS  - Design, code, unit test and documentations of software.   \n  - Develop using cutting edge technologies to match the fit for our customer from a time, budget, and technical need.   \n  - Leverage CMS systems to provide a foundation framework for our customer websites.   \n  - Estimate development effort required to deliver small and large projects.   \n  - Mentor other developers in developing scalable, secure, responsive applications.   \n  - Provide application support with focus on customer satisfaction and quality.   \n  - Follow Agile development practices for delivering software components.   \n  - Presales consulting in order to frame in solution architectures.   \n  - Design reusable services and components to build composite applications.   \n  - Provide leadership role in designing applications for our customers.   \n   COMPETENCIES  - Ambition – The drive to achieve personal advancement.   \n  - Active Listening - Ability to actively attend to, convey, and understand the comments and questions of others.   \n  - Adaptability - Ability to adapt to change in the workplace.   \n  - Assertiveness – Ability to act in a self-confident manner to facilitate completion of a work assignment or to defend a position or idea.   \n  - Coaching and Development – Ability to provide guidance and feedback to help others strengthen specific knowledge/skill areas.   \n  - Conflict Resolution – Ability to deal with others in an antagonistic situation.   \n  - Customer Oriented - Ability to take care of the customers’ needs while following company policy.   \n  - Decision Making - Ability to make critical decisions while following company procedures.   \n  - Goal Oriented – Ability to focus on a goal and obtain a pre-determined results.   \n  - Honesty / Integrity – Ability to be truthful and be seen as credible in the workplace.   \n  - Innovative – Ability to look beyond the standard solutions.   \n  - Leadership – Ability to influence others to perform their jobs effectively and to be responsible for making decisions.   \n  - Motivation – Ability to inspire oneself and others to reach a goal and perform to the best of their ability.   \n  - Presentation Skills – Ability to effectively present information publicly.   \n  - Relationship Building – Ability to effectively build relationships with customers and co-workers.   \n   SKILLS & ABILITIESRequired Experience  - 6+ years of experience building web-based applications in Microsoft stack   \n  - 4+ years of experience working with .NET including C#, ASP.NET, MVC, AOD.NET/Entity Framework, HTML, CSS, and JavaScript   \n  - 4+ years of experience working with object oriented development, utilizing design patterns, as well as, SQL utilizing MS SQL Server and source code repos (GIT, TFS, Azure DevOps)   \n   Preferred Experience  - 3 + years of experience developing applications using Kentico or another CMS   \n  - 1+ years of experience developing Xamarin apps, cloud first applications in Microsoft Azure, and IoT applications   \n  - 1+ years of experience with React, Vue, Node, and CI/CD automated pipelines   \n   Required Sills, Education and/or Certifications:  - Associate’s degree in Software Engineer/Computer Science or related discipline   \n   Preferred Skills, Education and/or Certifications:  - Bachelor’s Degree in Computer Science or related discipline   \n  - Kentico Certified Developer and Exam AZ-204: Developing Solutions for Microsoft Azure   \n  - General knowledge of LAMP stack   \n   Equal Opportunity Employer - Disabled/Vets",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10T18:36:53.000Z"
    },
    "company": {
        "name": "Heartland Business Systems",
        "link": "https://www.linkedin.com/company/heartland-business-systems"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": "Senior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Wisconsin",
        "region": "United States",
        "postal_code": "54943",
        "street_address": null,
        "latitude": 44.639957,
        "longitude": -89.73298
    }
}