{"location": {"country": "US", "locality": "Saginaw", "region": "Saginaw", "postal_code": "48607", "street_address": null, "latitude": 43.419548, "longitude": -83.94636}, "salary": {"currency": "USD", "min_value": 55900, "max_value": 72600, "unit": "YEAR"}, "job": {"title": "Pursuits Systems Engineer (2021)", "industry": "Automotive,Electrical/Electronic Manufacturing", "description": "Nexteer Automotive is looking for a technically skilled and highly focused individual who enjoys developing & integrating mechanical & electrical components into a mechatronic system. The focus of this position is to lead the elicitation of customer requirements and collaborate with the organization to have them understood by sub-system teams in order to develop a design proposal. The System Pursuit Engineer will then lead technical discussions concerning the selected system design with the customer. This opportunity requires daily customer interactions, so excellent technical communication skills are necessary. This position interacts with both internal and external customers to ensure deadlines are met and requirement evaluations are completed. In addition to the customer interface work, the position will require development of new technology & demonstrations of those new designs to find a solution that can meet performance expectations at the lowest cost.\nThe ideal candidate has experience with vehicle communication networks, MATLAB & Simulink, ECU Calibration & Analysis Software Tools (Vector, Intrepid Control, etc), Microsoft Office and can quickly learn internal tools. The ideal candidate possesses good communication skills, excellent problem-solving techniques, good organization and documentation abilities, knowledge of system synthesis, analysis and verification techniques and a general competency and experience in vehicle dynamics, mechanical systems, electronic systems, and computer hardware and software.\nIn This Role You Will\nSupport system requirements decomposition & flow down to various parts of the organization\nOwn the system design of an Electronic Power Steering system for a vehicle project\nOptimize multiple system requirements through flow down and use of multi-disciplinary engineering\nLead technical discussions with a vehicle customer\nBe responsible to design to cost & assist in maintaining optimized solutions\nTune vehicle steering characteristics & diagnose/corrects deficiencies in demonstrations & prototypes\nSupport algorithm development specific to a vehicle customer\nSupport the development of our product from pursuit of business through award\nBe exposed to a rapidly changing business environment and be a focal point of our effort to develop solutions to grow within that environment.\nJob Requirements\nPreferred: 2-3 years of industry experience\nBackground in automotive chassis engineering (steering, braking, etc)\nRequired: the right to work in the US without sponsorship\nRequired: ability to drive a vehicle and possess a valid driver license\nable to make quick physical maneuvers while driving\nEducation\nRequired – Bachelors in Electrical, Mechanical or Computer Science Related Engineering\nMinimum cumulative GPA requirement of 2.7\nPreferred – Masters in Electrical, Mechanical or Computer Science Related Engineering\nEqual Opportunity Employer Disabled/Minorities/Veterans/Women\nVEVRAA Federal Contractor\nNexteer is an E-Verify employer. E-Verify is an internet based system operated by the Department of Homeland Security (DHS) in partnership with the Social Security Administration (SSA) that allows participating employees to electronically verify the employment eligibility of their newly hired employees in the United States.\nAccessibility for Applicants with Disabilities:\nIf you need a reasonable accommodation for the online application process due to a disability please call . Please provide your contact information and details about the posted position of interest. Only inquiries regarding assistance for those who need an accommodation with the online application process due to a disability will be returned.", "employment_type": "FULL_TIME", "date_posted": "2021-09-12T05:10:30.000Z"}, "company": {"name": "Nexteer Automotive", "link": "https://www.linkedin.com/company/nexteer-automotive"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}