{
    "job": {
        "title": "Data Scientist",
        "industry": "Nonprofit Organization Management,Fund-Raising",
        "description": "Join World Vision as Data Scientist01 At a Glance    Role: Data Scientist, Marketing Experience level:  SeniorRequired experience: Predictive modeling, model monitoring/model ops, SQL, Python, descriptive statistics, exploratory statistics, information visualization Preferred experience: Marketing analytics, statistics trainingLocation: Prefer Seattle (Federal Way, WA) base. Remote possible w/preference for Pacific NW base for ease of travel to the HQ office as needed post-pandemic. Compensation Range:  Your salary is important to you so it’s important to us. If you need the approximate range to inform your decision on whether to apply or not contact Scott using one of the ways below. Benefits: Yes. Visit https://www.worldvision.org/about-us/job-opportunities/working-for-world-vision to learn more.Company size: 900+ (World Vision USA) / 35,000 worldwide (World Vision International)   02 Join professionals with purpose    At World Vision USA you’ll join people who are all-in to impact the lives of the world's most vulnerable children. Our recipe includes love of all people, fiscal responsibility, and targeting the root causes of poverty. Our purpose includes human transformation for the most vulnerable and for the donors who support them.   And the impact is real. Every day we see donors’ hearts draw closer to the heart God has for children, families, and communities affected by poverty and injustice. The work you'll do here will help make it possible that every 60 seconds a family gets water, a hungry child is fed, and a family gets the tools they need to overcome poverty.  03 The Job   We are looking for a seasoned data scientist with a passion for applying machine learning and building solutions that inspire our donors and provide a better life for hundreds of thousands of children in 100 countries. You will be joining a team of two other data scientists who have been given executive level support to expand machine learning for marketing and fundraising initiatives. Responsibilities include:    Helping define our evolving vision and tactics of machine learning for all World Vision marketing functions.  Leveraging automated machine learning, as well as programming, to take predictive models from ideation to feature creation, training, and implementation.  Monitoring and managing models over time to ensure we are continually putting our best foot forward for our faithful donors.   Serving as analytical consultants to our marketers by setting up and reading market tests, producing actionable insights from deep-dive analyses, and applying best practices in information visualization. Applying sound statistics that help the organization make reliable data-driven decisions.   Keeping Christ central in our individual and corporate lives. Attending and participating in weekly devotions, chapel services, and regular prayer.  04 You Bring   Heart for service because we are not just working with data, we are working with valuable donor dollars and impacting the livelihood of the world’s neediest children.  Team spirit because we try to learn from each person and function as a body of Christ, not a lone ranger or unicorn. Yet you also bring a “figure it out” attitude because you are an independent and resourceful adult.  Passion for continual learning because our industry, our organization, and the data science world will never stop changing. Creative problem solving with machine learning and the fortitude to follow through to the end because our data and our projects won’t be easy.  Real-world experience in marketing data science (including digital marketing). This means you can build models, but have also wrestled with defining training sets, creating features, and monitoring models over time because you know the building part is only the tip of the iceberg.  Fluency in SQL and Python to pull and transform data, conduct descriptive analysis, and perform machine learning. There will be a lot of coding for sure and it won’t always be the glamorous machine learning type. Familiarity with automated machine learning because we’re a non-profit trying to do more with less by embracing Datarobot to do the work of 5x more people than we actually have.  Excellent verbal and written communication skills that resonate with lay people because you’ll be working with marketers who put tremendous value in words and images.  05 Where this job could take your career  World Vision USA is a part of the larger World Vision International partnership. Globally, we have nearly 35,000 staff working in nearly 100 countries. Just over 900 of us call World Vision USA home. You'll have opportunities to advance within our robust and talented group of professionals as you continue to stretch and grow your career for the future.  06 Let your work be your faith in action  Every day, nearly 16,000 children under the age of 5 die from preventable causes. Our call to action is urgent. That’s why we’re looking for someone who is ready to place their expertise behind helping the world’s most vulnerable children. Every data-driven decision made and donor experience optimized can help influence whether someone chooses to help today or not. If not you, then who?   07 Salary Range & Benefits Your salary is important to you so it’s important to us. If you need the approximate range to inform your decision on whether to apply or not contact Scott using one of the ways below. In addition, we have a robust and comprehensive benefits package to round out our total compensation package. Visit https://www.worldvision.org/about-us/job-opportunities/working-for-world-vision to learn more.  08 To ApplyClick the Easy Apply button on this page. Still not sure? We'd really like to hear from you, even if it’s just to ask a question about the job. Text Scott in Talent Acquisition at 253-815-2843 or smcdiffett@worldvision.org. Connect with him here on LinkedIn over at hhttps://www.linkedin.com/in/scott-mcdiffett-746a6932/.   09 What happens next? Glad you asked. We owe you that and strive to not leave you in limbo. We review applications nearly every day assessing strength of fit for the role. Sometimes questions arise on our end so we message you to learn more. Short-listed candidates are contacted for an initial phone conversation with our recruiting staff. Moving deeper into our selection process you can expect to interview 1:1 with a hiring manager. Finalists normally participate in a panel interview where the opportunity to meet additional members of our staff lends itself to more of a 360-view of the role. Our most valuable resource is our talented staff. Our goal is to fill this vacancy with the right person in the shortest amount of time so we have all hands on deck to move this important work forward.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-13T15:54:08.000Z"
    },
    "company": {
        "name": "World Vision USA",
        "link": "https://www.linkedin.com/company/worldvisionusa"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Federal Way",
        "region": "WA",
        "postal_code": "98063",
        "street_address": null,
        "latitude": 47.315178,
        "longitude": -122.334656
    }
}