{"location": {"country": "US", "locality": "Utica-Rome Area", "region": "Utica-Rome Area", "postal_code": "13501", "street_address": null, "latitude": 43.09009, "longitude": -75.2616}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Machine Learning/NLP Engineer", "industry": "Pharmaceuticals", "description": "The Pfizer Machine Learning and Intelligent Assistance Team, builds, delivers and maintains the products, platforms and capabilities that enable Pfizer Business Units to leverage intelligent automation solutions to effectively engage/collaborate with teams internally and our customers externally. We build advanced AI technology solutions at a global scale that positively impact Pfizer business performance. Pfizer is accelerating the use of AI technologies across our entire enterprise.\nWe are looking for a natural language processing (NLP) engineer to join the Intelligent Solutions Team to scale and help us improve our NLP products and create new efficient self-learning NLP applications and products.\nYou will need to apply state of the art NLP and ML techniques, build robust pipelines to enable end to end intelligent solutions for unique business problems. You will be responsible for developing the NLP vision for new projects and will need a keen understanding of NLP/ML models, solutions and technologies. Finally, you will also assist in evangelizing AI/ML/NLP across Pfizer and promote adoption and enablement of NLP solutions across Pfizer by providing education, guidance and mentorship to junior members of the team and the broader Pfizer digital and business community.\nThe ideal candidate will be passionate about health care, software engineering, machine learning, NLP and stay up-to-date with the latest developments in the field.\nRole Responsibilities\nUnderstand business problems/objectives and develop strategy/roadmap to pilot and build NLP based software products that help to achieve business goals for business clients\nLead the development of robust NLP and machine learning pipelines to deliver stable and efficient production-ready components and solutions.\nArticulate experiment plans that demonstrate the process of model building, refinement and productization\nSupervise the data acquisition process if more data is needed\nFind available datasets online that could be used for training\nDefine validation strategies\nDefine the preprocessing or feature engineering to be done on a given dataset\nDefine data augmentation strategies\nTrain models and tuning their hyperparameters\nAnalyze the errors of the model and design strategies to overcome them\nDeploy models to production\nPresent model outcomes in a scientifically rigorous manner\nProduce executive reports and visualizations for decision makers throughout the organization\nDirectly engage with key business stake-holders (Director/Sr. Director level)\nLead projects with vendor resources and business stakeholders from requirements gathering through the full software development life cycle.\nShared-ownership of advancing team's capabilities in Machine Learning and NLP.\nManagerial responsibility for up to five interns and contingent workers\nQualifications\nMasters degree in Data Science, Computer Science, Informatics, life sciences, physics, applied mathematics, statistics or related field\n5 years as a data scientist, Machine Learning or NLP engineer\n5 years working with different types of enterprise and real world data sets – structured, semi-structured and unstructured data\n4 years building ML/NLP based software solutions\nDeep understanding and workings of contextual search products and solutions\nStrong understand of Software Engineering and Development Life Cycle principles\nExpertise in supervised and unsupervised Machine Learning techniques, with emphasis on Natural Language Processing (NLP)\nExperience building production-ready NLP systems, from preprocessing and normalization to monitoring model drift in a production environment, ideally using NLP libraries and technologies including Spacy, PyTorch & Deep Learning models\nProficiency in leveraging cloud-based machine learning resources such as those from Amazon Web Services or Google Cloud for model training and productization\nExpertise in NLP feature engineering and modeling (e.g., text classification, entity recognition, dependency parsing)\nExperience with SoTA modeling techniques, such as transformers (e.g., BERT, GPT-_N_),\nExperience in applying NLP in multi-lingual and multi-modal contexts\nExperience taking an NLP project from concept to production\nExpertise with Python\nBuilding deep neural networks with modern tools, such as PyTorch or Tensorflow\nBuilding, testing, and deploying computer vision based solutions\nWriting unit tests\nCollaborating via Git\nAbility to thrive in a fast-paced multi-disciplinary environment; with the ability to effectively communicate with a diverse audience\nExperience with hyperparameter optimization, model selection and validation.\nExperience with implementation of solutions with DevOps tools within the CI/CD pipeline (eg. Docker, Kubernetes)\nGood proficiency with SQL, Python, Scala, or Java as well as formal statistical tools R, SAS, etc.\nExcellent written and verbal communication skills\nPhysical/Mental Requirements\nStrong Analytical Thinking and Problem Solver.\nNon-standard Work Schedule, Travel Or Environment Requirements\nFlexibility to work across multiple time zones (i.e.: EST, PST, GMT, IST)\nLast Date to Apply for Job: 9/20/2021\nEligible for Employee Referral Bonus\nSunshine Act\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider’s name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\nEEO & Employment Eligibility\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\nInformation & Business Tech", "employment_type": "FULL_TIME", "date_posted": "2021-08-26T23:51:39.000Z"}, "company": {"name": "Pfizer", "link": "https://www.linkedin.com/company/pfizer"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}