{
    "job": {
        "title": "Market Research Engineer",
        "industry": "Electrical/Electronic Manufacturing,Automotive,Mechanical or Industrial Engineering",
        "description": "Job Description      This position is responsible for helping develop strategic marketing plans for key market sectors across all AVX products, i.e. Automotive, Medical, Military/Aerospace, Industrial, etc. Plans will include AVX value proposition for each market and specific targeting strategies. This person will also work to help incorporate acquired companies into the AVX marketing strategy.      Reports To      Market Research Manager      Duties And Responsibilities     - Help formulate marketing strategies for delivery to business unit for each product line.   \n  - Aid in establishing key marketing metrics.   \n  - Provide assistance in competitor profiles that include: Products, pricing, trends, and SWOT Analysis.   \n  - Coordinate with AVX Marketing Communications group for NPR releases, trade shows, and conferences/symposiums.   \n  - Analyze global RFQs for market trends.   \n  - Research market trends to identify new opportunities with existing products, potential new products, and acquisition targets.   \n  - Develop marketing communication strategies with AVX Marcom group, including technical articles, press releases, NPI, advertising, catalogs and datasheets, content for AVX website and landing page, and webinars.   \n  - Help facilitate communication on market trends/conditions and market research to various stakeholders including sales, FAE’s, APTC, operations, and executive management.         \nJob Requirements     - BS degree in Engineering   \n  - 1+ years of experience, preferably in electronic components.   \n  - Ability to communicate at all levels. Should have experience with passive electronic components.   \n  - Ability to apply knowledge of competitor’s product lines and their relative position in the market.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-11T23:27:47.000Z"
    },
    "company": {
        "name": "AVX Corporation",
        "link": "https://www.linkedin.com/company/avxcorp"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Junior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Greenville",
        "region": "SC",
        "postal_code": "29601",
        "street_address": null,
        "latitude": 34.850746,
        "longitude": -82.398964
    }
}