{
    "job": {
        "title": "Senior Software Engineer - TrainHeroic",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "Are you ready to work on a product impacting millions of people? TrainHeroics user base of athletes and coaches is growing rapidly. We call them Heroes. To meet their demands TrainHeroic needs innovators, collaborators, and excellent engineers like you. Together were building the worlds best training app. Join TrainHeroic today. Day-to-Day      Responsibilities     - Build full-stack solutions to grow our platform to millions of athletes and coaches.   \n  - Analyze customer data and develop hypotheses around growth opportunities.   \n  - Develop experiments and tracking for growth-oriented features across our web and mobile apps.   \n  - Thrive in an iterative and collaborative engineering environment. Our engineers push code to production every day, averaging 250 releases per engineer per year.   \n  - Improve code quality through automated testing, refactoring, and code reviews. What Some of Our Projects Look Like   \n  - Optimizing user flows and conversion funnels for athletes in our Marketplace.   \n  - Writing investigative SQL queries and data visualizations to identify and understand patterns in athlete and coach behaviors.   \n  - Developing creative full-stack features across our mobile app and API to increase athlete enjoyment and satisfaction.   \n  - Building reporting and data analysis solutions that empower coaches to grow their online training business.   \nRequirements     - Experience: 4+ years of software engineering experience   \n  - Frontend Technical Skills: JavaScript, CSS, and a framework like React, Vue, or Angular. In this role, you will work directly on our React web app and React Native mobile app.   \n  - Backend: SQL and PHP, Ruby, Python, or a similar language. The work characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.   \nBenefits      Compensation Peaksware/TrainHeroic is committed to fair and equitable compensation practices. The salary range for this role is $88,140 - $146,900. Final compensation for this role will be determined by various factors such as a candidate's relevant work experience, skills, and certifications. This role is eligible for variable compensation including bonus.      Benefits      and Perks Health     - 100% company-paid Medical for employees with buy-up options   \n  - Dental   \n  - Vision   \n  - Health Savings Account   \n  - Flexible Spending Account   \n  - Dependent Care Flexible Spending Account   \n  - Paid Parental Leave   \n  - Teladoc   \n  - Employee Assistance Program (EAP)   \n  - Additional coverage options such as accident and critical illness insurance and hospital indemnity Disability and Life   \n  - Company-paid Short Term Disability   \n  - Company-paid Long Term Disability   \n  - Company-paid Basic Life Insurance and AD&D   \n  - Employee-paid Supplemental Life Insurance for Employee, Spouse, and/or Child Additional   \n  - * 401(K)   \n  - 401(K) Matching   \n  - Pet Insurance   \n  - Significant investment in resources for employee development and professional growth   \n  - Flexible work schedule in a culture of trust   \n  - 9 paid holidays annually and unlimited Flexible Time Off (FTO)   \n  - Free TrainingPeaks, TrainHeroic, MakeMusic accounts, and Alfred Music product   \n  - Access to on-site workout room, including locker rooms and showers   \n  - Secure on-site bike storage   \n  - Access to our on-site music studio   \n  - Access to corporate discounts on gym memberships and gear   \n  - Access to nutritious snacks and devour hour, weekly subsidized lunch *Please note - due to COVID-19 some perks are not readily available at this time. Please contact [ if you require a reasonable accommodation to review our website or to apply online. Work Environment This job operates in a professional office environment that is well-lighted, heated, and/or air-conditioned with adequate ventilation and a noise level that is usually moderate. This role routinely uses standard office equipment such as computers, phones, photocopiers and filing cabinets. All employees must comply with all safety policies, practices and procedures. Report all unsafe activities to your manager and/or Human Resources. Physical Demands While performing the duties of this job, the employee is regularly required to sit and move about the facility; use hands to handle, or feel; talk by expressing ideas by means of the spoken word; and hear by perceiving the nature of sounds. The employee is occasionally required to stand, walk, and reach with hands and arms. The employee must occasionally lift and/or move up to 10 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and ability to adjust focus.      \nSDL2019-1032",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-11T23:12:07.000Z"
    },
    "company": {
        "name": "Peaksware Holdings, LLC",
        "link": "https://www.linkedin.com/company/peaksware-holdings-llc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Senior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Louisville",
        "region": "CO",
        "postal_code": "80027",
        "street_address": null,
        "latitude": 39.976837,
        "longitude": -105.13214
    }
}