{"location": {"country": "US", "locality": "Irvine", "region": "Irvine", "postal_code": "92717", "street_address": null, "latitude": 33.68591, "longitude": -117.82472}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Scientist", "industry": "Information Technology and Services", "description": "Title: Sr. Data Scientist\nLocation: Saint Louis, MO\n100% Remote\nDuration:  18 Months\nJob Description:\nAt Client Companies, we are passionate about transforming the lives of pets and the people who love them. A key ambition of ours is to deliver new-to-world solutions that give pet owners the confidence and reassurance they are seeking in the decisions they make every day regarding their pets needs. We aim to do this by developing digital products and services for pet owners and vets that translate each pets behavior, health and nutrition data into current and predictive insights unique to each pet.\nTo deliver on this ambition, we are looking for an exceptional senior data scientist with experience in AI and other Machine-Learning (ML) products. The ideal candidate will have a desire to leverage this experience to design, build and productionize AI/ML models that can be used at a global level .\nIn this role, you’ll use AI/ML development strategies while collaborating with pet data acquisition, infrastructure, and AI-UX teams to deliver advanced analytics solutions that transform the lives of pets and the people who love them.\nSummary:\nThe Client Companies Global Digital Solutions Group is seeking a dynamic and skilled Senior Data Scientist who will develop reliable Data Science solutions. This role is a key member of the dynamic new digital product development group’s team responsible for Client’s global expansion in “smart” and connected-pet product development as. This position is responsible for the development of Advanced Analytics and AI products that translate a pet’s data into unique behavior, health, and nutrition insights.\nPrimary Responsibilities:\nTranslate objectives into project plans and lead, and manage projects to successful end points\nCollaborate with internal and external teams to efficiently acquire labelled training data that can be used to create advanced analytic and AI products\nExtract, prepare, clean, analyze, visualize, and explore data using scripting languages\nFeature Engineering including signal processing of time series sensor data and cleaning and processing of longitudinal health record data\nBuild and test AI and advanced analytic solutions using standard statistical programming languages (e.g. R, Python)\nWork closely with product teams to understand and deploy advanced analytics and AI products directly within devices or cloud environments using container-based solutions\nMaintain and monitor performance of models in production and iterate and improve models when necessary\nWork with internal/external vendors to assess needs, aid and resolve problems, using excellent problem-solving skills and verbal/written communication to non-technical audiences\nAdditional Responsibilities:\nPolicy Alignment. Conduct all activity in compliance with Good Manufacturing Practices (GMP), Good Laboratory Practices (GLP), and all required Company policies and procedures.\nSafety. Maintain a safe, clean, and sanitary work environment. Practice safety in the work area.\nQuality. Support quality assurance and regulatory compliance of all work performed.\nTravel. Travel as necessary (estimated not to exceed 15%-20%).\nAdvocate for, and use, agile digital product development methodologies.\nActively work to deliver products that meet consumer and business needs.\nWork effectively within cross-functional project teams to achieve excellent results\nAdditional duties as assigned\nSupervision:\nThis position reports to the lead of AI product development\nJob Qualifications (Education, Experience, and Knowledge):\nPhD or Master's degree from an accredited college/university in Computer Science, Statistics, Mathematics, Engineering, Physics, Chemistry or related fields preferred, with at least 7 years of relevant experience in statistics, machine learning, deep learning and/or neural networks.\nDeep understanding of and experience with standard machine learning algorithms (Random Forest, SVM, Logistic Regression, etc.) and deep learning algorithms and frameworks (CNN, LSTM, GANs, etc.)\nProficiency in statistical programming languages (e.g. Python, R) and machine learning libraries and packages (Python: Scipy, Numpy, Pandas, TensorFlow, pyTorch, Theano, MXNet R: tidyverse, dplyr, randomForest, caret, glmnet, nnet)\nExperience as a data scientist on a team that has successfully delivered AI/ML products from inception to production for internal and/or external customers\nDeep experience extracting, cleaning, preparing, and modeling large / complex / segmented data sets and interpret data to identify meaningful insights\nDemonstrated experience working collaboratively with teams using Agile methodologies and version control repositories to develop, deploy and enhance high-performing data science deliverables.\nExperience with cloud computing platforms such as Azure.\nPossess a clear grasp of the fundamentals of microservices, containers and their orchestration\nAbility to communicate complex technical concepts clearly through written or oral communication\nAdditional Desired Qualifications:\nExperience working with AWS cloud.\nExperience in applying deep learning models in the field of health diagnostics.\nExperience with CI/CD pipelines for AI solutions", "employment_type": "CONTRACTOR", "date_posted": "2021-08-30T20:35:17.000Z"}, "company": {"name": "Denken Solutions, Inc", "link": "https://www.linkedin.com/company/denkensolutions"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 84, "seniority_level": "Senior"}}