{
    "job": {
        "title": "Senior Site Reliability Engineer",
        "industry": "Automotive,Computer Software,Information Technology and Services",
        "description": "This position is part of a team that focuses on the development of vehicle related embedded, backend, and frontend software systems with particular relevance to the US and Canadian markets and will work alongside development and infrastructure teams to research, design, deliver, automate and operate the platform to host online services on the basis of Microsoft Azure and MCVP   As a Senior Site Reliability Engineer specializing in Software Engineering, your aim will be to focus on software engineering excellence and applied SRE principles. You will have the opportunity to help us build tooling to help grow and operate our global hyper-scale operations. You may also embed with an application development team where you will help develop next generation features for the automotive cloud and help your team apply SRE-driven patterns, practices, and solutions. In driving these best practices, you will help us drive consistency and increase maturity across our teams. Additionally, you will help facilitate the on-call and service review processes for your application team. By accomplishing these things, you will play an exceptionally critical role in ensuring that millions of customers around the world can rely on the features your team and our organization produce.  &amp;nbsp;   Role Responsibilities:  - Conception, definition, and integration of online services E2E   \n  - Collection of requirements, plausibility, and risk analysis   \n  - Collaboration with other functional owners and stakeholders   \n  - Manage the specification, development, and integration of API requirements between backend systems (e.g. SOAP, REST, HTML, MQTT)   \n  - Issue analysis and lifecycle management   \n  - Risk management   \n  - Planning of online services lifecycles, including post-SOP support   \n  - Contribute to the management of variant, quality, and change management   \n  - Integration of service packages in vehicle projects and securing the deployment in production environment   \n  - Interaction with local and remote suppliers   \n  - Synchronization of US development activities with internal and external stakeholders   \n  - Reporting of status and progress to internal and external stakeholders   \n  - Utilize latest technology and deliver services with availability   \n  - Remote global customer care   \n  - Assure smooth operation of services   \n  - Analyze and fix faults, debug code, create bug reports and define feature requests   \n  - Provide information and training for 1st&amp;nbsp;and 2nd&amp;nbsp;level support   \nRequired Experience:  - 5-8 years of experience working with development teams, preferably in supporting cloud and managed services   \nRequired Education:  - Bachelor's degree in Computer Science, Computer Engineering or equivalent   \nDesired Education:  - MBA or other Master's Degree   \n  - Certification in Project Management field   \n  - Certification(s) Preferred:&amp;nbsp;PMI, SCPO   \nRequired Skills:  - Proven ability to take business/marketing concepts or user stories and translate them to detailed engineering specifications   \n  - Defines and tracks work packages for function related components   \n  - Systems/software engineering background   \n  - Relevant experience working with end-to-end/cloud-based teams and their applications   \n  - System-level thinking   \n  - Requirements analysis, definition, and implementation   \n  - Experience working on projects involving integration of E2E Systems: vehicle, backend, and frontend   \n  - Understanding of continuous integration and deployment practices   \n  - Solid teamwork and interpersonal skills   \n  - High service orientation and motivation to build up new services   \n  - Excellent understanding of microservices   \n  - Change management experience   \n  - Issue and risk management   \n  - Prior experience working in an Agile/Scrum environment   \n  - Excellent oral and written communication skills   \n  - Excellent interpersonal and organizational skills   \n  - Motivated team player, with positive attitude and strong work ethic   \n  - Demonstrated competency in designing, programming, testing and maintaining complex data platforms and components   \n  - Appreciation of security, reliability, scalability and availability requirements   \n  - Excellent verbal and written communication skills, including the ability to explain IT concepts and technologies to other team members.   \n  - Risk and Issue Management   \n  - Ability to analyze and think quickly and to resolve conflict   \n  - Ability to adapt to a changing environment   \n  - Self-motivation and ability to stay focused amid distraction   \n  - Ability to work in fast-paced environments and adapt quickly   \nDesired Skills:  - Experience working in diverse and international environments   \n  - Hands-on embedded and integrated automotive systems experience   \n  - Understanding of common backend API technologies   \n  - Passion for cars and car electronics   \nWork Flexibility:  - Travel is estimated to be 10-15%   \n   We are proud to be an EEO employer M/F/D/V. We maintain a drug-free workplace and perform pre-employment substance abuse testing.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-11T14:14:11.000Z"
    },
    "company": {
        "name": "Volkswagen Automotive Cloud",
        "link": "https://www.linkedin.com/company/vwcloud"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Redmond",
        "region": "WA",
        "postal_code": "98073",
        "street_address": null,
        "latitude": 47.67491,
        "longitude": -122.12399
    }
}