{
    "job": {
        "title": "Senior Site Reliability Engineer",
        "industry": "Automotive,Computer Software,Information Technology and Services",
        "description": "This position is part of a team that focuses on the development of vehicle related embedded, backend, and frontend software systems with particular relevance to the US and Canadian markets and will work alongside development and infrastructure teams to research, design, deliver, automate and operate the platform to host online services on the basis of Microsoft Azure and MCVPAs a Senior Site Reliability Engineer specializing in Software Engineering, your aim will be to focus on software engineering excellence and applied SRE principles. You will have the opportunity to help us build tooling to help grow and operate our global hyper-scale operations. You may also embed with an application development team where you will help develop next generation features for the automotive cloud and help your team apply SRE-driven patterns, practices, and solutions. In driving these best practices, you will help us drive consistency and increase maturity across our teams. Additionally, you will help facilitate the on-call and service review processes for your application team. By accomplishing these things, you will play an exceptionally critical role in ensuring that millions of customers around the world can rely on the features your team and our organization produce.   Role Responsibilities:Conception, definition, and integration of online services E2ECollection of requirements, plausibility, and risk analysisCollaboration with other functional owners and stakeholdersManage the specification, development, and integration of API requirements between backend systems (e.g. SOAP, REST, HTML, MQTT)Issue analysis and lifecycle managementRisk managementPlanning of online services lifecycles, including post-SOP supportContribute to the management of variant, quality, and change managementIntegration of service packages in vehicle projects and securing the deployment in production environmentInteraction with local and remote suppliersSynchronization of US development activities with internal and external stakeholdersReporting of status and progress to internal and external stakeholdersUtilize latest technology and deliver services with availabilityRemote global customer careAssure smooth operation of servicesAnalyze and fix faults, debug code, create bug reports and define feature requestsProvide information and training for 1st and 2nd level supportRequired Experience:5-8 years of experience working with development teams, preferably in supporting cloud and managed servicesRequired Education:Bachelor's degree in Computer Science, Computer Engineering or equivalentDesired Education:MBA or other Master's DegreeCertification in Project Management fieldCertification(s) Preferred: PMI, SCPORequired Skills:Proven ability to take business/marketing concepts or user stories and translate them to detailed engineering specificationsDefines and tracks work packages for function related componentsSystems/software engineering backgroundRelevant experience working with end-to-end/cloud-based teams and their applicationsSystem-level thinkingRequirements analysis, definition, and implementationExperience working on projects involving integration of E2E Systems: vehicle, backend, and frontendUnderstanding of continuous integration and deployment practicesSolid teamwork and interpersonal skillsHigh service orientation and motivation to build up new servicesExcellent understanding of microservicesChange management experienceIssue and risk managementPrior experience working in an Agile/Scrum environmentExcellent oral and written communication skillsExcellent interpersonal and organizational skillsMotivated team player, with positive attitude and strong work ethicDemonstrated competency in designing, programming, testing and maintaining complex data platforms and componentsAppreciation of security, reliability, scalability and availability requirementsExcellent verbal and written communication skills, including the ability to explain IT concepts and technologies to other team members.Risk and Issue ManagementAbility to analyze and think quickly and to resolve conflictAbility to adapt to a changing environmentSelf-motivation and ability to stay focused amid distractionAbility to work in fast-paced environments and adapt quicklyDesired Skills:Experience working in diverse and international environmentsHands-on embedded and integrated automotive systems experienceUnderstanding of common backend API technologiesPassion for cars and car electronicsWork Flexibility:Travel is estimated to be 10-15%We are proud to be an EEO employer M/F/D/V. We maintain a drug-free workplace and perform pre-employment substance abuse testing.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-11T14:14:11.000Z"
    },
    "company": {
        "name": "Volkswagen Automotive Cloud",
        "link": "https://www.linkedin.com/company/vwcloud"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Redmond",
        "region": "WA",
        "postal_code": "98073",
        "street_address": null,
        "latitude": 47.67491,
        "longitude": -122.12399
    }
}