{"location": {"country": "US", "locality": "San Francisco", "region": "San Francisco", "postal_code": "94101", "street_address": null, "latitude": 37.78008, "longitude": -122.42016}, "salary": {"currency": "USD", "min_value": 124000, "max_value": 212000, "unit": "YEAR"}, "job": {"title": "Machine Learning (ML) Engineer - Data Platform", "industry": "Computer Networking", "description": "Cisco Meraki is revolutionizing the way IT administrators manage their infrastructure by providing simple and secure cloud-managed solutions. With a large install base of customers and rich, multifaceted data sets, the potential for data analytics to improve business performance for both our customers and our own business is enormous.\nThe Strategy & Data Science department is a growing group that works closely with executives and leaders across the company to support the development of and alignment on our business strategy. We are looking for a Senior ML Engineer - Data Platform to join our team in San Francisco. As part of this team, you will develop cross-functional relationships and work closely with data engineering and data science teams to drive near- and longer-term initiatives to improve our product, and customer experience. This would be an outstanding fit for a solution-oriented technical pro who is hands-on, has the ability to work autonomously, and can drive technical efforts building robust and resilient auto-scaling platform solutions with core AI-capabilities.\nWhat Will You Do\nDesign and implement cloud platform in a hybrid platform setting to support business priorities and product needs\nTake ownership of delivering cloud solutions\nManage, secure and scale enterprise cloud applications\nIdentify and mitigate data governance and compliance gaps\nDrive developments and solutions leveraging cloud and other open source technologies\nDesign and implement CI/CD pipeline for production and staging environments\nManage deployment of various “containerized” models and components on cloud\nOperationalize intelligent ML/AI services for business and engineering units\nProvide guidance on best practices of software development\nWhat Skills You Possess\nMinimum 3 - 5 years of development experience with cloud engineering and infrastructure in one of the core cloud provider services, preferably AWS\nSolid programming skills in Python, Scala/Java, Ruby on Rails etc\n2+ years of experience managing model building and secure model deployment flows\nAdvance level knowledge in Docker containers, Kubernetes etc\nProficiency in cloud database technologies\nDeep understanding of service-oriented application development\nPast work experience using streaming frameworks and tools, such as Kafka Streaming,Spark etc\nStrong written and verbal communication skills\nBS or MS in Computer Science / related technical field or equivalent combination of graduate degree and work experience\nExcellent attention to detail and accuracy\nWho You Are\nSomeone who thrives when using their technical acumen in their work\nA go-getter!\nYou have a real passion for complex data / engineering challenges\nYou have the ability to keep track of multiple opposing priorities without losing details\nAbility to communicate ideas and solutions to both technical and non-technical audiences\nYou are eager to take ownership of projects and technical initiatives\nYou remain curious and desire for continuous learning\nAre you wondering what it is like to work at Cisco Meraki? Picture a breathtaking office, healthy catered meals, fully stocked kitchens, onsite gym and paid time off to volunteer. Meraki Cisco has crafted an amazing equal opportunity focused office where employees thrive. With that said, we are confident you will love it here. Check out more of our benefits on our job page, at https://meraki.cisco.com/jobs, and we look forward to talking with you soon.\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.", "employment_type": "FULL_TIME", "date_posted": "2021-06-06T17:34:35.000Z"}, "company": {"name": "Cisco Meraki", "link": "https://www.linkedin.com/company/cisco-meraki"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}