{"location": {"country": "US", "locality": "Lenexa", "region": "Lenexa", "postal_code": "66227", "street_address": null, "latitude": 38.956512, "longitude": -94.73757}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer", "industry": "Information Technology and Services,Computer Software,Telecommunications", "description": "Parker and Lynch is current seeking a Software Engineer in the Kansas City area to work within the Management Information Systems department and be responsible for carrying out software development projects that aid the goals of the company. This role cooperates within a team providing strong, scalable solutions across every department of a fast-growing and agile company.\nResponsibilities\nDevelop and design customer-facing and internal applications\nDesign internal APIs and develop custom web services\nCollaborate with Business Analysts as well as other departments to obtain requirements for projects, execute test plans and supply required functionality.\nMaintain and migrate legacy software and applications\nIntegrate with third party systems\nAnalyze root causes, debug code, and troubleshoot issues\nQualifications\nBS in Computer Science or a related field\nAdept in at least one general purpose programming language: Ruby, Python, PHP, Perl, C#, or C++\nExperience using version control systems like Git and/or Subversion\nKnowledgeable with Linux and command-line interfaces like Bash and/or KornShell\nExperience using SQL\nSkills\nStrong troubleshooting and debugging skills\nExcellent verbal, written and interpersonal communication skills\nHighly detail oriented\nTeam player\nWhat helps you stand out:\nExperience with:\nCSS3 / HTML5\nWeb Services (SOAP/REST)\nJavaScript (React/ES6/ES7/jQuery)\nAJAX\nOWASP\nTwelve-Factor Applications\nWhat's in it for you?\nCompetitive compensation package\n401(k) company match and being 100% vested on your first day\nGreat medical benefits\nFlexible schedule\nLocally owned with a fun and friendly atmosphere\nRecognized as one of the Best Places to Work in 2020 by Glassdoor\nEmployment Type\nFull-time\nEqual opportunity employer\nIf you have a strong desire to impact the success of a local organization please apply today!", "employment_type": "FULL_TIME", "date_posted": "2021-08-19T14:08:31.000Z"}, "company": {"name": "Parker and Lynch", "link": "https://www.linkedin.com/company/parker-and-lynch"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}