{"location": {"country": "US", "locality": "Menlo Park", "region": "Menlo Park", "postal_code": "94029", "street_address": null, "latitude": 37.45322, "longitude": -122.18322}, "salary": {"currency": "USD", "min_value": 71000, "max_value": 133000, "unit": "YEAR"}, "job": {"title": "Software Engineer", "industry": "Information Technology and Services", "description": "Role:\nSoftware Engineer\nLocation:\nMenlo Park, CA\nOur client is shaping the future of Ads in a world that is becoming increasingly privacy aware by giving users control over their data and experience and by gaining their trust. Your work will help define the future of online advertising, and meaningfully impact on all stakeholders: users, advertisers and regulators.\nResponsibilities:\n- Drive project technical direction and effectively communicate complex features and systems in detail.\n- Work closely with product, design and other cross functional teams to define and refine project specifications.\n- Technical design, implement and test (unit and end to end) complex project features and ensure hitting the project release timeline.\n- Design and develop front-end interfaces, underlying APIs, or backend systems across a number of programming languages such as JavaScript, Python, PHP (Hack) or C++\n- Create consumer products and features on a large scale\n- Master development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity\n- Partner closely with infrastructure and operations teams to build and scale back-end services\nDay to day activities include but not limited to:\n- Collaborating with TL, Design and other teams to implement the desktop UI. Skills used: React, javascript, GraphQL, Hack (Php)\n- Collaborating with TL, Design and other teams to implement the Mobile UI. Skills used: Bloks (a mobile Framework with syntax similar to Hack (php), general UI knowledge\n- Working on adding data pipelines to aggregate data and create dashboards for the product. Skills used: SQL, Spark\n- Working on mid layer API connecting the backend ML data to topic control APIs used by the UI. Skills used: PHP, general ML knowledge\nMinimum Qualifications:\n- Experience leading projects with industry-wide impact\n- Experience communicating and working across functions to drive solutions\n- Experience in influencing senior engineers across organizations\n- Proven track record of delivering complex projects within a challenging timeline.\n- Experience in driving large cross-functional/industry-wide engineering efforts\n- Proficient on React/Vue/Angular and/or other morden JavaScript framework/libraries.\nPreferred Qualifications:\n- Experience shipping products to millions of customers or have started a new line of product\n- Experience building and scaling large products or systems\n- Experience with building privacy and ads related products is a big plus.\nEducation/Experience:\n• Bachelor's degree in computer science, software engineering or relevant field required.\nNote:\n- Experience with database, Full Stack, UI, and API experience\n- Want a quick learner so they can ramp up quickly\nWarm Regards,\nSimran Khanduja\nDigital Intelligence Systems, LLC (DISYS)\n1301 Fannin St, Suite 1600\nHouston, TX 77002\nPhone: 562-453-3983| www.disys.com\nEmail: Simran.khanduja@disys.com", "employment_type": "CONTRACTOR", "date_posted": "2021-07-20T00:47:52.000Z"}, "company": {"name": "DISYS", "link": "https://www.linkedin.com/company/disys"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}