{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "BrightLink: Software EngineerBrightLink (The ideal team member has mastery of computer science and engineering fundamentals and is comfortable working in an Agile/Scrum/Lean development environment. The team member should be passionate about helping others, learning new technologies, leading a team by example, and solving difficult problems.Who is BrightLink?Because we build technology for the professional credentialing industry, BrightLink sits in the crossroads between what people were and what they're going to become. We help individuals demonstrate value, articulate trustworthiness, and move to a new chapter of life. Simply put: We help people prove themselves worthy of opportunity.What are our team’s core values?Be remarkablePractice humble serviceNurture enduring partnershipsAlways drive to deliverSeek pragmatic perfectionCreate positive personal growthEngage in camaraderieQualifications:BS in CS/CmpE or a related field3-5 years experience in professional software developmentSignificant expertise in the following areas:Full-stack, web-based application developmentObject-oriented programmingRelational databases, including schema design, advanced SQL, and optimizationUNIX-based software developmentA strong desire to learn and improve the quality of your craftsmanshipA sense of ownership, urgency, and personal pride in your workThe ability to adapt to changing situations and requirementsExcellent communication skills (both verbal and written)Confidence in, and passion about, tackling the most challenging of problemsComfortable investing in junior team members, promoting a healthy development culture, and leading by exampleMastery of any of the following things will be a plus:PythonPostgreSQLJavaScript (specifically popular libraries/frameworks such as jQuery, React, Backbone, etc.)BootstrapAWSAgile/Scrum/Lean development practicesResponsibilities:Build planned software features, tools, and new products within a Scrum/Lean environment in collaboration with team members and stakeholdersWrite high-quality, testable software that is scalable, robust and maintainableCraft remarkable, high-performance user interfacesWork together with our Quality Assurance Engineers to identify and fix bugsCollaborate with other engineers on matters of architecture and solution designParticipate in early-stage product designConstantly pursue knowledge, and seek to improve your skills and technical professionalismShare best practices and new technologies with the team and apply them to your workBenefits:Paid Vacation and Sick DaysHealth and Vision Insurance401k Plan (with corporate match)Paid Sabbatical (every 7 years)Discounted Company Cell Phone PlanReading Reward ProgramQuarterly Team / Company ActivitiesPersonal or Professional Growth Conference StipendsFriday Family Lunches for You, Your Spouse and ChildrenCasual Dress EnvironmentPaid Recess - Everyday!Awesome, Collaborative and Open Work Environment Sure, we look like a technology company. Sharp people working really hard to do something that changes the world in a meaningful way.However, if you look at our core values you'll notice BrightLink specifically focuses on positive personal growth. Whether it's our team members, clients, or client's clients this means our goal is to leave people better than we found them. You'll be surrounded by people with a drive to grow, discover, and build a better life. If this is something you're interested in, take a look at our currently open positions.Powered by JazzHRj7DWgWoKrg",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-14T07:19:43.000Z"
    },
    "company": {
        "name": "BrightLink ",
        "link": "https://www.linkedin.com/company/brightlink-technology-llc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Atlanta",
        "region": "GA",
        "postal_code": "30355",
        "street_address": null,
        "latitude": 33.748547,
        "longitude": -84.3915
    }
}