{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "The ideal candidate will have e xperience with Kubernetes, Docker, Go, and Python to help build Workiva's Continuous Integration/Continuous Development (CI/CD) product features, products or systems from beginning to end.Job SummaryThe Software Engineer under Platform Operations will own well-defined Continuous Integration/Continuous Development (CI/CD) product features, products or systems from beginning to end.What You'll DoContribute to team projects and deliver individual level technical solutionsPerform Code Reviews within your team’s products or componentsTest software and write automated tests (unit, integration, functional, etc)Debug components within your service or application contextAnalyze data to assess and understand solutions developed by your teamEstimate your own work with guidanceWrite and document code with clearly defined requirementsCommunicate individual work to your team and diverse technical audiencesAssist in triaging and resolving production issuesMay participate in product discovery activities with customers and stakeholdersMay participate in the hiring processSkillsWhat You'll NeedDemonstrated proficiency in programming to include a solid foundation in computer science, with competencies in one or more of: data structures, algorithms, object-oriented software design, and working with cloud-based distributed systems.Experience working in modern programming languages such as Dart, JavaScript, Go, Java, Kotlin, Python, or C#Some experience debugging systems or applicationsExperience using one or more commercial databasesFamiliarity with one or more of the following areas: Amazon Web Services, Google Cloud Platform, relational databases, REST and other modern web protocols, and/or Mobile computingFamiliarity building one or more of unit, integration, functional user acceptance, or contract testsExperience working in an agile development environment preferredExperience developing for service oriented architecture is a plusExperience with Docker or other container systems is a plusExperience with active or passive monitoring is a plusEducationBS in CS/SE/EE/CE/related field or equivalent experienceTravel RequirementsUp to 10% travelWorking Conditions & Physical RequirementsMay require after-hours support to resolve critical customer issuesHow You'll Be RewardedBase Pay Range in Colorado: $86,000 - $125,000A discretionary bonus typically paid annuallyRestricted Stock Units granted at time of hireThe base pay range represents the low and high end of the hiring range for this job. Actual pay will vary and may be above or below the range based on various factors including but not limited to relevant skills, experience, and capabilities.Where You’ll WorkOur values drive how we work and who we hire. You will see these values ingrained in how we support our customers, work with team members, build our products and in the work environment we’ve created.Customer Success: Always delight our customers.Trust: Rely on each other. Integrity: Do the right thing, every time. Collaboration: Share resources and work together. Innovation: Keep creating solutions and finding better ways. Inclusion: Support a diverse community where we all belong. Accountability: Be responsible for your success and failure.We believe our people are our greatest asset, and our unique culture gives employees the opportunity to make an impact everyday. We give our employees the freedom and resources they need—backed by our culture of collaboration and diverse thought—to continue innovating and breaking new ground. We hire talented people with a wide range of skills and experiences who are eager to tackle some of today’s most challenging problems.At Workiva, You’ll EnjoyFantastic Benefits: With coverage starting day one, choose from competitive health, dental, and vision plans on the largest physician networks available.Casual Dress: Workiva has a casual work environment, most people wear jeans to the office.Involvement: Ability to participate in Employee Resource Groups, (Women in Tech, Women in Sales, Ethnic Diversity, Veterans, Rainbow (LGBTQ), Remote Employees, Caregiving) Volunteering, Company wide celebrations, and moreWork-life Balance: We have competitive PTO, VTO and Parental Leave. We encourage employees to spend time enjoying life outside of work. Learn more about life at Workiva:  www.linkedin.com/showcase/workiva-life-and-careers/Learn more about the company: https://www.linkedin.com/company/workiva/Learn more about benefits:  https://www.workiva.com/careers/benefitsWorkiva is an Equal Employment Opportunity and Affirmative Action Employer. We believe that great minds think differently. We value diversity of backgrounds, beliefs, and interests, and we recognize diversity as an important source of intellectual thought, varied perspective, and innovation. Employment decisions are made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression genetic information, marital status, citizenship status or any other protected characteristic.Workiva is committed to working with and providing reasonable accommodations to applicants with disabilities. To request assistance with the application process, please email  talentacquisition@workiva.com  .",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-12T07:45:54.000Z"
    },
    "company": {
        "name": "Workiva",
        "link": "https://www.linkedin.com/company/workiva"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Bozeman",
        "region": "MT",
        "postal_code": "59718",
        "street_address": null,
        "latitude": 45.679295,
        "longitude": -111.04661
    }
}