{"location": {"country": "US", "locality": "Phoenix", "region": "Phoenix", "postal_code": "85009", "street_address": null, "latitude": 33.448204, "longitude": -112.072586}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer I", "industry": "Information Technology and Services,Computer Software,Financial Services", "description": "Join a team recognized for leadership, innovation and diversity\nHoneywell changes the way the world works.\nFor more than 130 years, we’ve solved the toughest customer challenges through a rare combination of our industrial expertise and our innovations in ground breaking software and technology, and industry-leading automation.\nThis perfection is built on a foundation of inclusion, diversity and driving a performance culture that values integrity and ethics.\nAre you ready to help us make the future?\nWe lead with software and innovation.\nWhether we’re turning mustard seeds into fuel, creating quantum algorithms or making taxis fly, our software engineering team is home to the world’s leading technological talent.\nWe want software engineers who not only have a solid foundation in coding, development, designing, testing and even hacking, but who also have a passion for empowering the world and making it a better place for everyone – today and tomorrow.\nJoin a team that designs, develops and integrates highly complex software applications within Honeywell Aerospace. You will be an active and integral member of a team to achieve the completion of goals. You will also generate innovative solutions in work situations; trying different and novel ways to deal with problems and opportunities.\nKey Responsibilities\nRequirements and design\nSoftware architecture and coding\nIntegration\nCertification\nTest\nFeature Definition\nCustomer Support\nVerification and Validation\nYOU MUST HAVE\nBachelors degree in Computer Science\n1+ years of experience in software development from college or industry\nExperience or exposure utilizing C++ and iOS on Linux platforms\nGood understanding of Agile software development process\nWE VALUE\nUnderstanding various software development lifecycle\nDemonstrate the ability to develop efficient and high quality software\nKnowledge of software configuration management and change management practices\nDiverse and global teaming and collaboration\nEffective communicator\nCan quickly analyze, incorporate and apply new information and concepts\nAbility to consistently make timely decisions even in the face of complexity, balancing systematic analysis with decisiveness\nAbility to convey subtle or complex messages clearly, as appropriate for the topic and audience\nAbility to code in multiple languages\nAdditional Information\nJOB ID:\nHRD126818\nCategory:\nEngineering\nLocation:\n21111 N. 19th Ave (Deer Valley),Phoenix,Arizona,85027,United States\nExempt\nDue to US export control laws, must be a US citizen, permanent resident or have protected status.\nHuman Resources (CORPORATE HR)\nHoneywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status.", "employment_type": "FULL_TIME", "date_posted": "2021-06-26T20:16:23.000Z"}, "company": {"name": "Honeywell", "link": "https://www.linkedin.com/company/honeywell"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 12, "seniority_level": "Junior"}}