{"location": {"country": "US", "locality": "Palo Alto", "region": "Palo Alto", "postal_code": "94310", "street_address": null, "latitude": 37.445103, "longitude": -122.16036}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "UX Researcher", "industry": "Health, Wellness and Fitness", "description": "UX Researcher\nPalo Alto, CA, United States\nAbout Yo Labs:\nTechnology has changed daily life in a way no one could have imagined. It’s made us more productive, capable and connected. But it has come at a cost. We’re productive, but overwhelmed. Capable but paralyzed by too many choices. Connected, but only if social media counts. Living this way creates a void in our daily lives. Yo Labs is here to change that. Our team is committed to alleviating the mental load that our modern world has created by putting human connection back into technology and caretaking at the heart of everything we create.\nAbout the Role:\nAs a UX Researcher, you will work closely with designers, engineers, and product managers to build new mobile apps and services. In this role, you will create understanding and empathy around user needs, stated and unstated. Your research will help us create useful, usable, and delightful new products and features for our users. This role will start out mainly focused on usability testing across multiple products with multiple user types, but there will be opportunities to take on different types of research projects and collaborate with more experienced UXRs.\nResponsibilities\nSupport the evaluative research (i.e., usability testing, heuristic evaluations, etc.) needs of multiple product teams\nWork with designers, engineers, and product managers to identify and prioritize research opportunities in a fast-paced, rapidly changing environment\nPlan and execute research studies end-to-end, including designing the study, recruiting participants, moderating interviews, analyzing data, and reporting results\nAdvocate research findings to diverse audiences through written reports and in-person presentations\nRequirements\nBA/BS degree in Anthropology, Human-Computer Interaction (HCI), Human Factors, Psychology, Sociology, or a related field, or equivalent practical experience\nPreferred, but not required: Master's degree in a related field\n1-3 years of relevant work experience in an applied research setting and/or product research and development\nExperience conducting evaluative research and ability to demonstrate the impact of their research insights\nUnderstanding of UI/UX best practices and user-centered design\nUnderstanding of the strengths and shortcomings of different research methods, including when and how to apply them during the product development process\nNice to have\nDemonstrated experience with other research methods, including but not limited to ethnographic research, contextual inquiry, diary studies, surveys, etc.\nFamiliarity with analytics, a/b tests, or statistical concepts\nProficiency with Figma\nWhat We Offer:\nCompetitive compensation package\nComprehensive benefits\nPet Insurance\nPaid Parental Care Leave\nEmployee Referral Program\nEducational Assistance\nFlexible Work Program\nVolunteer time Off\nTotal Well Being Program", "employment_type": "FULL_TIME", "date_posted": "2021-07-22T01:26:42.000Z"}, "company": {"name": "Yo Labs", "link": "https://www.linkedin.com/company/yo-labs"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 12, "seniority_level": "Junior"}}