{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Technology and Services,Computer Software,Computer & Network Security",
        "description": "About StackPathStackPath is a platform of secure Internet services built at the cloud's edge. StackPath services enable developers to build protection and performance into any cloud-based solution—from apps, to games, web sites, and beyond—without needing cloud security and delivery expertise of their own. More than 800,000 customers already use StackPath services, ranging from early-stage enterprises to Fortune 100 organizations. Headquartered in Dallas, Texas, StackPath has offices across the U.S. and around the world.For more information follow StackPath at www.fb.com/stackpathllc and www.twitter.com/stackpath.About The RoleThe StackPath Site Reliability Engineering (SRE) team combines software, systems and network engineering to deploy and run a portfolio of high-performance edge services including CDN, WAF and Compute. SRE’s daily focus is on the availability, change velocity, performance and capacity of customer-facing services and supporting internal systems.On the SRE team you will have the opportunity to apply your experience against systems at scale – where a single week can involve shifting terabits of traffic between sites, deploying configuration changes to shave milliseconds off billions of requests, or enabling a new software feature on thousands of systems using automated tooling you designed and built.This role will report to our: VP Site Reliability EngineeringEssential Duties And ResponsibilitiesRespond to incidents during on-call dutyRespond to complex customer escalations, which often cross system, network and software boundariesDesign, develop and maintain internal service metrics (SLA, SLO, SLI) in cross-team collaborationsDesign, develop and maintain dashboards, tooling, alarms and playbooks in collaboration with operations teams to support service-level objectivesDesign, develop and maintain reusable monitoring and canary infrastructureDesign, execute and evaluate performance experimentsCollaborate with development teams to complete production readiness checklists prior to major feature launchesCollaborate with operations and engineering teams in determining root cause of major incidents, performance anomalies, or other customer-impacting issuesDesired Skills And ExperienceExperience with monitoring and alerting platforms (Prometheus and Alertmanager, Grafana, Zabbix, Nagios)Experience with a Linux server environmentExperience with scripting languages (Python, Ruby, Perl)Experience with systems programming languages (Go, C)Experience with configuration management systems (Puppet, Ansible, Chef)Expert-level proficiency in systems, network or software engineeringExcited about working on a remote-first engineering teamProficient at troubleshooting complex systemsProduction experience in a service provider environmentComfortable with a software engineering workflow for collaboration and configuration management — branches, pull requests, merges, conflictsProjects you might work onProduct launchesSoftware and platform feature releasesLive streaming event planning and executionNetwork reach and capability expansionNetwork and system automation tooling developmentTelemetry and monitoring system developmentDefining service metrics (SLA, SLO, SLI) during new product developmentThis Job Description Is Not Intended To Be All-inclusive.StackPath is an Equal Opportunity Employer. EOE/AA M/F/D/VIf your experience and qualifications match our current needs, a member of our human resources team will contact you. We look forward to hearing from you.StackPath collects and processes personal data submitted by job applicants in accordance with our Privacy Policy",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-14T01:30:50.000Z"
    },
    "company": {
        "name": "StackPath",
        "link": "https://www.linkedin.com/company/stackpath"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Dallas",
        "region": "TX",
        "postal_code": "75342",
        "street_address": null,
        "latitude": 32.777977,
        "longitude": -96.79621
    }
}