{"location": {"country": "US", "locality": "San Francisco", "region": "San Francisco", "postal_code": "94121", "street_address": null, "latitude": 37.78008, "longitude": -122.42016}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Machine Learning Engineer", "industry": "Retail,Apparel &amp; Fashion", "description": "Senior Machine Learning Engineer\nGlobal Ecommerce Retailer\nFully Remote - Anywhere in US\n$190,000 - $210,000 + full benefits & bonus\nYou will be working with a well-established fashion brand in the US. They are leaders in their industry and are at an exciting point in their growth, moving into a tech revolutionized future. They are looking for an experienced Machine Learning Engineer who will be responsible for collaborating with the data science team to operationalize Machine Learning Models to transform their standard business procedures. You will optimize already existing Machine learning systems to revolutionize consumer satisfaction.\nTHE ROLE\nAs the Senior Machine Learning Engineer, you will be required to:\nApply end-to-end solutions for batch and real-time algorithms along with requisite tooling around\nMonitoring, logging, automated testing, performance testing, and A/B testing\n.\nFind fresh opportunities to improve business processes and consumer experiences, as well as\nPrototype solutions in order to create value with an evolutionary mindset.\nCollaborate with data scientists and analysts to create and employ new product features on eCommerce.\nAutomate efficient processes for data analyses, model development, validation, and implementation\nusing y\nWrite software to ship products in a continual-release environment\nContribute to and promote good software engineering practices throughout the team.\nContribute to and re-use community best practices.\nYOUR SKILLS AND EXPERIENCE\nThe successful Senior Machine Learning Engineer will have the following skills and experience:\nUniversity or advanced degree in engineering, computer science, mathematics, or a related field\nLong-standing experience developing and deploying machine learning systems into production\nCommercial\ne\nxperience working with SQL and NoSQL databases\nExperience working with big data tools: Hadoop, Spark, Kafka, etc. in a commercial environment\nExperience with at least one cloud provider solution (AWS, GCP, Azure)\nStrong\nExperience with Python, Java, C++, Scala, etc – comfortable coding and working from scratch\nExperience working in a Linux environment\nKnowledge of data pipeline and workflow management tools\nExpertise in standard software engineering methodology integration, code reviews, design documentation\nRelevant working experience with Docker and Kubernetes is a big plus\nKEYWORDS\nNLP | Engineering | Natural Language Processing | Machine Learning | Deep Learning | Data Science | Fashion | Software Engineering | Natural Language Understanding | Natural Language Generation", "employment_type": "FULL_TIME", "date_posted": "2021-08-03T21:45:50.000Z"}, "company": {"name": "Harnham", "link": "https://uk.linkedin.com/company/harnham"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}