{"location": {"country": "US", "locality": "Dallas", "region": "Dallas", "postal_code": "75342", "street_address": null, "latitude": 32.777977, "longitude": -96.79621}, "salary": {"currency": "USD", "min_value": 79000, "max_value": 112000, "unit": "YEAR"}, "job": {"title": "Data Scientist - Machine Learning Engineer", "industry": "Information Technology and Services,Retail,Financial Services", "description": "Position Summary... What You'll Do...\nWe are looking for a Machine Learning (ML) Engineer to help us create artificial intelligence products. He/she will collaborate with product manager, product solution architect, tech leads and multi-disciplinary engineers to define, develop and deploy an actual production system that uses AI/ML.\nMachine Learning Engineer Responsibilities Include\nDesigning and developing MLOps for machine learning and deep learning systems for NLP applications.\nDevelop machine learning applications according to requirements\nImplementing appropriate ML algorithms\nRunning machine learning tests and experiments\nTrain and retrain systems when necessary\nPerform statistical analysis and fine-tuning using test results\nExtend existing ML libraries and frameworks\nStudy and transform data science prototypes\nSelect appropriate datasets and data representation methods\nResearch and implement appropriate ML algorithms and tools\nKeep abreast of developments in the field\nRequirements\nProven experience as a Machine Learning Engineer or similar role\nUnderstanding of data structures, data modeling and software architecture\nDeep knowledge of math, probability, statistics and algorithms\nAbility to write robust code in Python, Java and R\nFamiliarity with machine learning frameworks related to NLP.\nExcellent communication skills\nAbility to work in a team\nOutstanding analytical and problem-solving skills\nBSc in Computer Science, Mathematics or similar field; Master’s degree is a plus\nPreferred Qualification\nExperience in developing MLOps.\nComfortable with fast-paced, fluid and ambiguous situations.\nMinimum Qualifications...\nOutlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications.\nOption 1: Bachelors degree in Statistics, Economics, Analytics, Mathematics, Computer Science, Information Technology or related field and 2\nyears' experience in an analytics or related field. Option 2: Masters degree in Statistics, Economics, Analytics, Mathematics, Computer Science,\nInformation Technology or related field. Option 3: 4 years' experience in an analytics or related field. Preferred Qualifications...\nOutlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications.\nData science, machine learning, optimization models, Master’s degree in Machine Learning, Computer Science, Information Technology, Operations Research, Statistics, Applied Mathematics, Econometrics, Successful completion of one or more assessments in Python, Spark, Scala, or R, Using open source frameworks (for example, scikit learn, tensorflow, torch) Primary Location...603 MUNGER AVE STE 400, DALLAS, TX 75202, United States of America", "employment_type": "FULL_TIME", "date_posted": "2021-09-24T08:03:43.000Z"}, "company": {"name": "Walmart", "link": "https://www.linkedin.com/company/walmart"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 48, "seniority_level": "Mid-Level"}}