{"location": {"country": "US", "locality": "Lehi", "region": "Lehi", "postal_code": "84043", "street_address": null, "latitude": 40.387875, "longitude": -111.84917}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Sr. Site Reliability Engineer I", "industry": "Marketing and Advertising,Information Technology and Services,Computer Software", "description": "Who is Elementum™?\nElementum is the company behind the first cloud-native supply chain automation platform. In an age where instant gratification is the new norm and customer expectations are continuing to grow exponentially, successful operations need to adapt faster than ever to unplanned exceptions. Elementum’s platform centralizes information and communication to drive rapid resolution of incidents, enable cross ecosystem execution, and ensure products are available at the right time, place, quantity, and cost.\nWhat is the Site Reliability Engineer role?\nAs part of the Technical Operations team, you will be supporting enterprise level applications hosted in the cloud. You need to have a good understanding of web application development and exposure to Amazon Web Services and other similar cloud technologies. As we grow out the SRE team, you will play a key role in shaping the foundation of the technical team. This position also requires strong communication, interpersonal and leadership skills, and a good candidate is expected to contribute to the vision and direction of the product line.\nRequirements\nStrong knowledge of Linux systems (Ubuntu, RHEL, CentOS).\nExperience with Amazon Cloud Services (AWS).\nExperience with DC/OS/Mesosphere, and Docker.\nRespond to and resolve service incidents in a timely manner and able to multitask.\nPerform root-cause analysis, instituting preventive measures where indicated.\nDeploy/upgrade server applications and software platforms.\nExperience with big data technologies such as: Spark, DataStax/Cassandra.\nStrong knowledge of system architecture, performance tuning concepts, and web applications.\nExperience with using JIRA, Confluence or other collaboration and ticketing systems.\nSupport/monitor day-to-day health of infrastructure, and 24x7 on-call participation.\nExperience with web technologies such as Java/Tomcat, NodeJS, MySQL/NoSQL, MongoDB, Apache, and Nginx.\nScripting or development background (ex. Python, Basic Shell Scripting)\n4 years of experience as a SRE or Development of customer-facing, high-availability, large scale web-based applications.\nBachelor's Degree in Computer Science or related field\nCompetitive Benefits\nMedical, Dental, and Vision are 100% covered by Elementum for employees\n401k matching\nOpen vacation policy\nEngage with (and give high-fives to) senior management regularly\nGet in on the ground floor of a huge opportunity", "employment_type": "FULL_TIME", "date_posted": "2021-08-18T00:00:00.000Z"}, "company": {"name": "Elementum", "link": "https://www.linkedin.com/company/elementum-scm"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 48, "seniority_level": "Mid-Level"}}