{"location": {"country": "US", "locality": "Los Angeles", "region": "Los Angeles", "postal_code": "90101", "street_address": null, "latitude": 34.05224, "longitude": -118.24335}, "salary": {"currency": "USD", "min_value": 111000, "max_value": 151000, "unit": "YEAR"}, "job": {"title": "Data Scientist", "industry": "Marketing and Advertising,Computer Software,Internet", "description": "Tinder brings people together. With tens of millions of users and a presence in every country on earth, our reach is expansive and rapidly growing.\nThe Analytics team powers data-informed decision-making at Tinder. We are looking to add a hardworking, creative Data Scientist to our growing team. As a Data Scientist on Analytics, you will partner with multiple teams - including Product, Marketing, Engineering, and Finance - to improve our extraordinary platform. You will use this comprehensive dataset to develop experiments, forecasting models, automated reports, and various exploratory insights to guide our business decisions.\nAn effective Data Scientist at Tinder must have a passion and aptitude for turning sophisticated problems into concrete hypotheses that can be answered through thorough data analysis and A/B testing. They must also be able to disseminate their takeaways and recommendations to a variety of partners within our organization via presentations, reports, and dashboards. In this role, your insights will influence both the performance of our business and the experience of our users.\nResponsibilities:\nBe a leader with a point of view for the organization, using data to constantly challenge and reshape our current understanding of customer behavior and business performance\nDerive and communicate data-driven recommendations regarding both the prioritization of potential product/marketing initiatives and performance of current initiatives\nDefine and operationalize the detailed tracking of company-wide, team-specific, and product-specific performance metrics via rollup tables, dashboards, and automated reporting\nDesign and analyze experiments to rigorously test a specific hypothesis\nFind the “story” in the data and readily share insights across the organization\nSkills Required:\nNo formal industry experience is required - we are looking for creative, tenacious problem solvers who are passionate about our product and excited to work with our rich, complex dataset\nAbility to develop a nuanced business understanding, testable hypotheses, and meaningful findings from data\nEagerness to identify and explore new product/marketing opportunities, potential improvements to our data infrastructure, and unanswered questions about customer behavior\nOutstanding written and verbal communication skills, and a willingness to collaborate with business partners\nComfort using descriptive and inferential statistics\nExperience with SQL and data visualization tools (e.g. Tableau or Mode) is highly recommended\nFamiliarity with scripting languages, machine learning, advanced statistical techniques, and A/B testing is a plus\nAs part of our team, you’ll enjoy:\nWorking on a product that has an immediate impact on people’s lives all around the world\nCollaborating with a team of creative, fun and driven colleagues\nComprehensive health coverage, competitive salary, 401(k) employer match, Employee Stock Purchase Plan (ESPP)\nOther perks and wellness benefits like a fitness membership subsidy, paid concierge medical membership, pet insurance offerings, and a commuter subsidy\nA robust Learning + Development offering including our MentorMatch program, access to a library of 6,000+ online learning courses through Udemy, and an annual L+D stipend\nAccess to mental health resources\nFertility preservation benefits\nNo Meeting Wednesdays and access to a wide range of product and service discounts through Perkspot\nCharitable donations match up to $15,000 annually\nMonthly and weekly interactive virtual events including Book Club, trivia with prizes and yoga workouts\nThe opportunity to join six active Employee Resource Groups (ERGs)\nAt Tinder, we don’t just accept difference — we celebrate it, we support it, and we thrive on it for the benefit of our employees, our product, and our community. We strive to make our workplace an inclusive and diverse environment, giving people from all walks of life the opportunity to have a voice. We champion and encourage those who bring different perspectives, ideas, and creativity to join our team dedicated to bringing people together across the globe. Tinder is proud to be an equal opportunity workplace where we welcome all people regardless of sex, gender identity, race, ethnicity, disability, or other lived experience.", "employment_type": "FULL_TIME", "date_posted": "2021-07-27T11:03:36.000Z"}, "company": {"name": "Tinder", "link": "https://www.linkedin.com/company/tinder-incorporated"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}