{
    "job": {
        "title": "FedNow Senior Software Engineer",
        "industry": "Banking,Capital Markets,Financial Services",
        "description": "Company   Federal Reserve Bank of Boston&amp;nbsp;&amp;nbsp;The Federal Reserve is developing a new interbank 24x7x365 real-time gross settlement (RTGS) service with integrated clearing functionality, called the FedNow service. This service will help enable financial institutions provide their customers with the ability to send and receive payments any time, any day, and have full access to those funds within seconds. This position is a unique opportunity to be part of a new mission-critical Federal Reserve initiative that will be transformative to the payments landscape in the United States.      Position Contributions-      Top level technical expert in one or more highly specialized areas of applications systems analysis and programming. Responsible for software design, coding, testing, debugging, and documentation. Has full technical knowledge of all phases of applications systems analysis and development. Provides technical leadership on complex projects. Interacts with internal project teams and work groups regularly. level of work required is considered advanced and staff must be able to work under minimal supervision. This job does not have any direct reports. You have an appetite to learn, and a passion for technology, innovation, and developing new skills on evolving technologies.      What Will Be Expected Of You-        - Serves as a Senior Software Engineer: to design, develop and implement new complex solutions in accordance with FedNow and Fed Standards   \n  - Develops software solutions (front end SPA and backend) in Cloud   \n  - Develop end to end Infrastructure-as-Code solutions in Cloud   \n  - Provides input into strategic and tactical planning of software solutions and software development lifecycle changes   \n  - In addition to being able to engineer across numerous areas of technology, you’ll serve as subject matter expert in one or more areas   \n  - Trains and consults cross functionally within the organization on troubleshooting/resolving highly complex and/or highly time critical problems   \n  - Collaborates with analysts as part of an integrated Agile team to define user requirements and conduct design review for the development of complex and innovative cloud applications using modern internet-scale technologies and Serverless architecture in Cloud   \n  - Demonstrates skill dexterity; seeking to continuously adapt and employ new technical skills alongside proven staples   \n  - Ensures that the quality of software developed, maintained and enhanced in-house and installed into production is sufficient to prevent the occurrence of catastrophic defects that cause the customer significant problems, missed deadlines, or interruption to the production environment   \n  - Ensure compliance with Fed policies, procedures and standards   \n  - Provides primary or backup production support for applications and components, including but not limited to timely resolution to production problems and processing issues         \nExpertise you will bring-     - 8+ years of Java Development   \n  - 3+ years working with AWS cloud-based platforms in an enterprise environment.   \n  - Demonstrated experience engineering software with cloud-first architectures   \n  - 5+ years software engineering experience in a team-based environment   \n  - Experience with building and deploying solutions in Cloud   \n  - Experience with Serverless architecture for building software solutions in Cloud   \n  - Experience with CI/CD build tools, and DevOps processes   \n  - Experience developing high performance, high volume, highly available   \n  - (24/7/365) environments   \n  - Experience with Agile software engineering (Scrum, Kanban, Lean etc)   \n  - Bachelor's degree in Computer Science, Information Systems,          \nLogistics& Requirements-        - Deep expertise in Java and proficient knowledge of programming languages (JavaScript, XML, JSON, HTML, CSS etc. Python a bonus)   \n  - Proficient knowledge of operating systems (Linux, Unix, Windows)   \n  - Proficient knowledge of database development (SQL, Oracle, DB2)   \n  - Ideally, you’ll have experience with AWS services, and integrating them into an application   \n  - Ideally you’ll have experience with leading edge Cloud technologies, such as Kafka, in-memory and NoSQL databases, messaging platforms, memcache etc).   \n  - Demonstrates independent thinking and decision-making abilities   \n  - Demonstrates excellent written and oral communication abilities   \n  - Proficient knowledge of cloud security for application development and delivery   \n  - Advanced knowledge of object-oriented programming   \n  - Ideally, Infrastructure as Code (IAC); Terraform         \nNice to Have-      - Experience with API Development and consumption and microservices architecture   \n  - Experience with agile development methodology   \n  - AWS Certifications   \n  - Knowledge of technology project and secure coding standards   \n  - Strong interpersonal, teamwork and negotiation skills   \n  - Strong customer service skills   \n  - Strong problem solving and critical thinking skills   \n  - Familiarity with usability techniques and best practices   \n  - Infrastructure as Code (IAC); Terraform   \nFull Time / Part Time   Full timeRegular / Temporary   RegularJob Exempt (Yes / No)   YesJob Category   Work Shift   First (United States of America)      The Federal Reserve Banks believe that diversity and inclusion among our employees is critical to our success as an organization, and we seek to recruit, develop and retain the most talented people from a diverse candidate pool. The Federal Reserve Banks are committed to equal employment opportunity for employees and job applicants in compliance with applicable law and to an environment where employees are valued for their differences.      Privacy Notice",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T07:45:16.000Z"
    },
    "company": {
        "name": "Federal Reserve Bank of Boston",
        "link": "https://www.linkedin.com/company/federal-reserve-bank-of-boston"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Boston",
        "region": "MA",
        "postal_code": "02118",
        "street_address": null,
        "latitude": 42.358994,
        "longitude": -71.05863
    }
}