{"location": {"country": "US", "locality": "United States", "region": "United States", "postal_code": "99999", "street_address": null, "latitude": 39.50355, "longitude": -99.0183}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer", "industry": "", "description": "Leveraging financial information is what Puzzle is all about. We are an ambitious startup, well funded by a top tier VC with an experienced team who have built multiple successful companies and raised over $500M.\nWe are solving a true pain point that every company has and keeps having as they grow.\nWe are on a mission to hire the very best and are committed to creating a culture where everyone is respected and has access to equal opportunity. We know that new ideas can come from anywhere in the organization, and the next big idea could be yours!\nWhat Are We Doing?\nStarting a company has become easier, but growing a company is more complicated than ever. We are building a real-time, smarter financial infrastructure to put trustworthy data into the hands of decision-makers.\nWe are currently remote, but will have a hub in San Francisco. But you can work from anywhere.\nJob Description\nAs part of Puzzle you will help design and build our financial data system.\nWe will be ingesting large amounts of data from disparate sources, transforming them, organizing them, and correlating them -- delivering the core platform for the rest of our products.\nWe expect the data to be large, dirty, and difficult to wrangle.\nWe want to be as real time as possible, event driven, and decoupled. Redundant, resistant and secure. And accuracy is key.\nThis is your opportunity to be an early engineer at a well funded startup that has a successful founder and a drive to change how company's leverage their financials. We are remote first, so anywhere in North America works for us.\nWhat You’ll Do\nScale out our core ingestion platform\nCreate unique functionality for correlation of data\nDesign interfaces and apis to our data\nExtend and architect our event pipeline for speed and scale\nExtend our core reporting platform\nWork on designing endpoints for our product\nHandle an ever growing stream of data\nAnything else that comes along...\nWhat You Need To Succeed\nBS/MS in Computer Science, a related field, or equivalent work experience\n4+ years as a professional software engineer\nExperience developing large-scale, data intensive applications, ideally using technologies like Node, Python, PubSub, Kafka, Kinesis, ElasticSearch\nExperience maintaining highly available, fault-tolerant, and distributed services, including familiarity with technologies, microservices, managed services, GCP, Docker\nExperience with the design of and integration with APIs and web services such as REST APIs and GraphQL\nExperience with agile software development methodologies\nExperience with financial systems is a big plus\nExperience with security is a big plus\nDesired Skills\nPractical experience in developing applications using microservices, container technologies, container management systems such as Docker, Kubernetes etc\nStrong experience with Databases design (SQL, NoSQL) and analytics\nPrior working experience in utility computing and/or cloud computing domain highly desired\nExperience building and deploying applications and services into cloud environments (GCP highly desired)\nPuzzle is an equal opportunity and affirmative action employer. We welcome and encourage diversity in the workplace regardless of gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other characteristics protected by law.", "employment_type": "FULL_TIME", "date_posted": "2021-08-04T16:57:48.000Z"}, "company": {"name": "Puzzle", "link": "https://www.linkedin.com/company/valencia-data"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 48, "seniority_level": "Mid-Level"}}