{"location": {"country": "US", "locality": "New York", "region": "New York", "postal_code": "10132", "street_address": null, "latitude": 40.713047, "longitude": -74.00723}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Site Reliability Engineer - Remote (US)", "industry": "Marketing and Advertising,Information Technology and Services,Staffing and Recruiting", "description": "Why PandoLogic?\nPandoLogic delivers Hire Intelligence to Talent Acquisition organizations by sourcing quality applicants faster and more efficiently through the use of big data, artificial intelligence, and proprietary campaign algorithms that fully-automate and optimize the job advertising and decision-making process.\nWe are backed by premier early-stage venture capital companies and list a number of Fortune 500 enterprise clients.\nWhen you join us, you'll become an important PandoPal of a well-established, global company. Professionally, you'll help us disrupt the recruitment advertising market and work on the most advanced technologies with experienced team members and from day one you'll be challenged to take risks while getting mentorship and support from the team.\nWhat else? Competitive compensation, the flexibility to work from anywhere, a family-friendly culture, happy hours, social outings, hackathons, and more…\nTo learn more visit http://www.pandologic.com.\nYou are a PandoPal if you are:\nExcited about using bleeding edge technologies to help make the hiring process better and more equitable for millions of people.\nYou'll be working on a small team at a rocketship-growth tech company that's focused on building out the conversational AI product in PandoLogic's offering. Your work will streamline the hiring process for millions of job seekers, reduce bias in hiring, and help companies solve some of the most ambitious challenges in the world.\nResponsibilities:\nYou will be the first dedicated SRE for the product: helping us with scalability and uptime as we grow to millions of users\nOptimize our applications\nPerformance and load testing\nSupport and debug our applications\nVirtualization of the system using tools like Docker\nCollraborate with and educate other developers on the team to build high performing scalable software together\nRequirements:\n5+ years of DevOps/SRE experience\nAWS\nDocker, Kubernetes, and Terraform\nCI/CD: experience setting up and supporting a mature build and deploy pipelines\nScripting experience\nExperience managing scalability and uptime in a high-growth environment\nExperience scaling microservices in a high-growth environment\nJava\nPython\nNice to have:\nUnderstanding and debugging microservice uptime issues\nMonitoring using tools like Datadog\nManaging and setting up tools like Amazon EKS\nA DevOps mindset\nExperience with databases\nBasic SQL skills\nCDN and Caching setup experience\nPandoLogic is committed to providing equal opportunity employment to all individuals regardless of race, color, religion, gender identity, sexual orientation, citizenship, national origin, disability, veteran status, or any other characteristic protected by law. We are flexible. We are kind. We are PandoLogic.", "employment_type": "FULL_TIME", "date_posted": "2021-07-27T05:19:54.000Z"}, "company": {"name": "PandoLogic", "link": "https://www.linkedin.com/company/pandologic"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}