{"location": {"country": "US", "locality": "Austin", "region": "Austin", "postal_code": "78746", "street_address": null, "latitude": 30.264978, "longitude": -97.7466}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer, Backend (LA/Austin)", "industry": "Computer Games", "description": "The fastest-growing High School and College sport in America isn’t basketball or football—it’s esports—and PlayVS is the official platform for High School and Collegiate esports. We offer an incredible, full-stack esport platform—game integrations, team building tools, leagues, tournaments, and schedules—and our software products tie everything together into a cohesive experience.\nWe are looking for a passionate backend Software Engineer to join our team. You will be responsible for helping us build new, and maintain existing, APIs and services.\nHere's What You'll Get To Do\nWork with a small team comprised of engineers, a product manager, and designer to build our product.\nCollaborate with other engineers and teams to develop new features, GraphQL APIs, improvements, and fixes to handle our current and future scale.\nTroubleshoot production issues and implement fixes for them.\nHelp our customers have an awesome experience with our products.\nWrite, audit, and improve our test coverage\nHere's What We're Looking For\n5+ years of product development experience\nThorough understanding of node.js and its core principles\nFamiliarity with TypeScript\nFamiliarity with GraphQL and Apollo\nExperience building and delivering successful products. You can take rough themes and big ideas and turn them into product features with minimal guidance\nPassionate about PlayVS and the problem we are solving\nCommitted desire to understand our customers\nStrong verbal and written communication skills\nPossess a growth mindset: Live and breathe experimentation, data analysis, and ruthlessly prioritize for impact\nPlayVS is an equal opportunity employer and is proud to be a majority minority company. We provide equal employment opportunities and are committed to maintaining an inclusive environment for our customers, employees, and applicants. We prohibit discrimination and harassment of any type regardless of race, color, religion, age, sex (including pregnancy and gender identity), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, parental status, or any other characteristic protected by federal, state or local laws.\nIf you have a disability or special need that requires an accommodation, please contact us at accommodations@playvs.com", "employment_type": "FULL_TIME", "date_posted": "2021-06-22T17:15:44.000Z"}, "company": {"name": "PlayVS", "link": "https://www.linkedin.com/company/playversus"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}