{"location": {"country": "US", "locality": "Washington", "region": "Washington", "postal_code": "98925", "street_address": null, "latitude": 47.411373, "longitude": -120.556366}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Lead Software Engineer", "industry": "Computer Software", "description": "Position Requirements\nThe company is looking for someone that can design and write code quickly and efficiently. Along with writing code you will conduct regular code reviews and testing. You will\nhelp set and maintain code standards, as well as ensure the team follows best test-driven development practices.\n2+ years of experience developing, launching and evolving scalable web applications\nExperience with\nReact Native\n,\nJava\nExperience with multiple full-stack web frameworks\nExperience building APIs for internal and public-facing use cases\nAn expert command of HTML and ability to write modular and responsive CSS\nPreferred:\nB.S., B.A., or M.S. Computer Science or related field\nExperience with Agile and/or Scrum development methodologies\nContribution to open source projects\nWe are looking for a Lead Software Developer to join our client's team based in Vancouver, WA. Our client is the first online network for builders and remodelers to connect with subcontractors and tradespeople in real time, and has recently raised $2.5 million in venture capital. The company is highly recognized in the tech community for their innovations in the construction industry.\nIn this role, you will lead a small team of developers in building an enterprise level web application, as well as furthering the development of an existing mobile app. You will take a pivotal role in decision making by providing expertise on the selection and development of architecture for their new web platform.\nAbout the Company\nThe company is the first marketplace for builders and remodelers and is a well-known player in the construction tech community. Their #1 goal is to build the best construction labor procurement solution, period. Through close ties with the customers and industry vendors they are able to gather feedback and implement substantive, innovative changes to their software in ways that outshine anyone else in the industry. The company has users nationwide and plans to expand to new locations in 2021. The organization was founded in 2019 and has around 25 employees. In May 2021, the company raised $2.5 million in a Series Seed 2 round.\nKey Responsibilities\nArchitect, implement and launch elegant and maintainable applications and systems\nWork closely with the Customer Success, Business, and QA team to craft, scope and implement new features\nAdopt and promote best-practices and technology for performance, usability, and testability\nImplement features and perform audits of existing features to meet Web Content Accessibility Guidelines (WCAG)\nWear multiple hats. We are a relatively small organization and it is vital that everyone is prepared to do things that may not be a part of their regular workflow\nWork closely with and help organize off-shore and remote developers.\nLead daily standups and participate in sprint planning.\nDesign and implement dev ops processes/pipelines.\nApplication Stack\nJava API\nReact Native iOS and Android mobile apps\nReact.js Web App\nmySQL\nAbout Employa\nApply to this position with Employa and get brand new hiring experience.\nNote that when your CV will be uploaded to Employa, you will get a link to your personal profile, where you can answer additional questions to improve your chances of being hired and track the job status.\nEmploya is a smart recruiting assistant that connects tech talents with the best employers to make the hiring process fast and easy for both sides. Employa AI-driven engines eliminate biases and limitations of human-to-human interaction, so candidates can always make sure that their CVs will be delivered, considered, and evaluated properly. It also enables candidates to track the hiring progress and improve their ranking for the position by answering additional questions from the potential employer.\nFollow Employa on LinkedIn to stay tuned with the hottest job openings!", "employment_type": "FULL_TIME", "date_posted": "2021-07-14T17:16:34.000Z"}, "company": {"name": "Employa", "link": "https://www.linkedin.com/company/employa-llc"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}