{"location": {"country": "US", "locality": "Hartford", "region": "Hartford", "postal_code": "06156", "street_address": null, "latitude": 41.765774, "longitude": -72.673355}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Site Reliability Engineer", "industry": "Restaurants,Facilities Services,Hospitality", "description": "Array is revolutionizing how businesses leverage and enhance consumer data. Our platform (APIs, components, and rules engine) enables innovative companies and developers to seamlessly integrate credit and identity data into their apps, websites or workflows. Founded by serial entrepreneurs (with several exits), weve been nearly doubling revenue monthly. Were looking for passionate and creative teammates to help us scale and supercharge the company. If youre looking for autonomy, impact, and cutting-edge FinTech, wed love to hear from you. Though fully remote, our team is the foundation of our success. We strive for diverse backgrounds, opinions, and approaches. We encourage respectful dissent, digging for the truth, so that we can deliver the best product for our clients and users. Continuous improvement, experimentation, and a clear mission stretch us individually and together.\nWe are seeking experienced, results-driven, and passionate engineers to join our infrastructure project team. Our ideal candidate is a self-starter and has excellent communication skills. Our collaborative environment relies heavily on innovation, technical savvy, and problem-solving skills. This is a full-time remote position within the US. As our newest SRE Engineer, youll be a major contributor to the companys success. Youll work with teams across the organization to build and maintain monitor-able, performant, reliable and highly-scalable software systems. Your technical contributions will help protect dozens of brands, facilitate continuous delivery, support our SLA for high-traffic websites and mobile applications in the credit score and reporting industry.\nResponsibilities\nEvangelize best practices for building and operating highly reliable systems.\nConsult in system design to meet reliability and capacity requirements\nConstantly optimizing performance and reliability\nSupport application deployments, building new systems and upgrading and patching existing ones through DevOps methodologies.\nAutomate infrastructure and configuration management.\nConduct timely post-mortems of production infrastructure incidents.\nAssist with all aspects of operational security and PCI compliance.\nSeek out potential threats to security and reliability and advocate solutions\nJob Requirements\nPassion for reliable, scalable, observable software with strong sense of ownership.\n5+ years experience developing and monitoring mission-critical systems.\nHands on experience with Docker and docker-compose.\nProficiency working with and understanding a containerized development workflow\nStrong background in Linux/UNIX administration (e.g. RedHat/CentOS 7/Alpine Linux).\nExperience with configuration management tools like Ansible.\nExperience with Infrastructure as Code (IaC) tools like Packer and Terraform.\nExperience in deploying large scale Docker based environments with OpenShift or Kubernetes, or similar product.\nExperience with languages like Bash, Python, or Node.js .\nExperience implementing Application clustering / load balancing concepts and technologies\nExperience using devops tooling/modules with VMware vSpheres API.\nProficiency administering a CI/CD pipeline (we use Gitlab).\nProficiency with networking fundamentals, diagnostic, troubleshooting, etc.\nProficient in using command line tools to quickly triage and fix production issues.\nUnderstanding of protocols/technologies like HTTP, SSL, LDAP, SQL, HTML, XML\nNice To Have\nExperience implementing CI/CD Blue/Green Deployments using Gitlab CI/CD You're a wizard with Terraform\nProject Atomic (Red Hat and Fedora atomic host)\nConsul\nBuild and maintain data stores with PostgreSQL\nImplement Keepalived / Linux HA in a scalable environment\nIn-depth knowledge of distributed computing and data systems, multi-region presence, high traffic websites.\nIn-depth knowledge of immutable infrastructure, compostable infrastructure, and/or serverless computing.\nGreat products and great ideas don't happen by accident. Our goal is to grow through the recruitment of truly exceptional people, and we appreciate your application. Teamwork is the foundation of our success, and we look forward to getting to know more about you! Thank you again for considering Arrayhave an innovative day!\nBest,\nThe Array Recruiting Team", "employment_type": "FULL_TIME", "date_posted": "2021-08-15T00:00:00.000Z"}, "company": {"name": "ARRAY", "link": "https://www.linkedin.com/company/arrayinfotech"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}