{"location": {"country": "US", "locality": "Chicago", "region": "Chicago", "postal_code": "60654", "street_address": null, "latitude": 41.88323, "longitude": -87.6324}, "salary": {"currency": "USD", "min_value": 81000, "max_value": 145000, "unit": "YEAR"}, "job": {"title": "Software Engineer, Machine Learning Infrastructure", "industry": "Marketing and Advertising,Computer Software,Internet", "description": "Come help us build the world's most reliable on-demand, logistics engine for delivery! We're bringing on experienced engineers to help us create and maintain a 24x7, no downtime, global infrastructure system that powers DoorDash’s three-sided marketplace of consumers, merchants, and dashers.\nAt DoorDash, our Data Scientists have the opportunity to dive into a wealth of delivery data to improve Dasher assignment, ETA prediction, Dasher capacity planning, search ranking & personalization, and fighting fraud & abuse. Useful blogs to learn about these use cases are - blog #1, blog #2, and blog #3.\nAbout The Team\nThe ML Platform team is aimed at building an industry leading Machine Learning platform for DoorDash Data Scientists and Machine Learning engineers to easily and quickly apply Machine Learning to a diverse set of use cases at scale. A recent blog that detailed some of the challenges is here.\nAbout The Role\nYou will work alongside our Data Scientists and Product Engineers to collaborate on various ideas and ensure that there is a highly reliable, world class platform to run their ML models on.\nYou will help build high performance and flexible infrastructure and services that can rapidly evolve to handle new technologies, techniques and modeling approaches\nYou will implement and operate an intuitive, easy to use and flexible ML development framework.\nYou’re Excited About This Opportunity Because You Will…\nJoin a growing company and grow right along with us.\nTake on significant technical challenges and have a large impact.\nCreate industry best practices for Machine Learning infrastructure\nWe’re Excited About You Because…\nHigh-energy and confident - you’ll do whatever it takes to win\nYou’re an owner - driven, focused, and quick to take ownership of your work\nHumble - you’re willing to jump in and you’re open to feedback\nAdaptable, resilient, and able to thrive in ambiguity - things change quickly in our fast-paced startup and you’ll need to be able to keep up!\nGrowth-minded - you’re eager to expand your skill set and excited to carve out your career path in a hyper-growth setting\nDesire for impact - ready to take on a lot of responsibility and work collaboratively with your team\nQualifications\nB.S., M.S., or PhD. in Computer Science or equivalent\nExceptionally strong knowledge of CS fundamental concepts and OOP languages\n4+ years of industry experience\nPrior experience building machine learning systems in production such as enabling data analytics at scale\nPrior experience in machine learning - you've developed and deployed your own models - even if these are simple proof of concepts\nSystems Engineering - you've built meaningful pieces of infrastructure in a cloud computing environment. Bonus if those were data processing systems or distributed systems\nNice To Haves\nExperience with real-time technology problems\nFamiliar with Pandas / Python machine learning libraries\nFamiliar with Spark, MLLib, Databricks MLFlow, Apache Airflow and similar related technologies.\nFamiliar with a cloud based environment such as AWS\nWhy You’ll Love Working at DoorDash\nWe are leaders - Leadership is not limited to our management team. It’s something everyone at DoorDash embraces and embodies.\nWe are doers - We believe the only way to predict the future is to build it. Creating solutions that will lead our company and our industry is what we do -- on every project, every day.\nWe are learning - We’re not afraid to dig in and uncover the truth, even if it’s scary or inconvenient. Everyone here is continually learning on the job, no matter if we’ve been in a role for one year or one minute.\nWe are customer obsessed - Our mission is to grow and empower local economies. We are committed to our customers, merchants, and dashers and believe in connecting people with possibility.\nWe are all DoorDash - The magic of DoorDash is our people, together making our inspiring goals attainable and driving us to greater heights.\nWe offer great compensation packages and comprehensive health benefits.\nAbout DoorDash\nDoorDash is a technology company that connects customers with their favorite local and national businesses in over 4,000 cities and all 50 states across the United States and Canada. Founded in 2013, DoorDash empowers merchants to grow their businesses by offering on-demand delivery, data-driven insights, and better in-store efficiency, providing delightful experiences from door to door. By building the last-mile delivery infrastructure for local cities, DoorDash is bringing communities closer, one doorstep at a time. Read more on the DoorDash blog or at www.doordash.com.\nOur Commitment to Diversity and Inclusion\nWe’re committed to growing and empowering a more inclusive community within our company, industry, and cities. That’s why we hire and cultivate diverse teams of the best and brightest from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel.\nPursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation.l", "employment_type": "FULL_TIME", "date_posted": "2021-08-26T01:18:39.000Z"}, "company": {"name": "DoorDash", "link": "https://www.linkedin.com/company/doordash"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 48, "seniority_level": "Mid-Level"}}