{
    "job": {
        "title": "Software Quality Engineer",
        "industry": "Information Technology and Services,Computer Software,Automotive",
        "description": "SHAPE THE FUTURE OF MOBILITY FROM DAY ONE.      This position is part of our Advanced Safety and User Experience segment located in Troy MI.      Summary (About This Position)      We have an exciting opportunity for a Software Quality Engineer. This person will be responsible for assigned projects to provide independent assurance and appropriate visibility to the project team and to management that work products meet defined quality criteria. The project team activities conform to the defined common processes and to approved project plans.      Candidate Profile      The successful candidate for this position is has significant experience with software and systems development throughout the lifecycle and is adaptable to a changing business environment.      Excellent problem solving and people skills are a must. The candidate successful in filling this role is a self-starter motivated by achieving ambitious goals, a multi-tasker who promotes quality thinking throughout the project team in the best interest of product quality.      Responsibilities     - Supports the Software Quality Project Leader as needed   \n  - Defines the quality sampling strategy and authors the Quality Assurance Plan   \n  - Provides mentoring to project team   \n  - Performs assigned checks, audits and tracks non-conformances through resolution to closure    \n  - Supports the Lead to create project quality status   \n  - Participates in Engineering, build, major customer milestone and production release audits and activities, and approves software releases   \n  - Leads efforts to root cause software Product Complaint Records in conjunction with associated project teams   \n  - Reports SQE activities and results         \nMust Haves (i.e. Basic Qualifications)     - Engineering Undergraduate Degree required in Business or Engineering preferred   \n  - A deep understanding of systems and software development, DFMEA/PFMEA, Functional   \n  - Safety and working across the enterprise – able to challenge engineering or supplier’s technical analysis   \n  - Potential candidates should have automotive background experience   \n  - Experience leading quality personnel and presenting solutions and improvement plans   \n  - Deep understanding of Quality Systems and industry requirements (IATF 16949, 26262, ASPICE). Also, understanding of Automotive APQP (Advanced Product Quality Planning)   \n  - Ability to travel is desirable   \n  - Strong and efficient oral, written and comprehension English language skills         \nNice To Haves (i.e. Preferred Qualifications)     - Engineering Quality Assurance experience.   \n  - Experience with Polarian.   \n  - Automotive SPICE or CMMI assessor qualified.   \n  - IATF 16949 qualified.   \n  - ISO 26262 (or Safety) trained.   \n  - Experience working in the Automotive industry.         \nAptiv Rewards And Advantages     - Competitive compensation with bonus potential   \n  - Competitive health benefits   \n  - 401K with matching contribution   \n  - Learning and development opportunities   \n  - Recognition for innovation and excellence   \n  - Meaningful work that makes a difference in the world   \n  - Relocation assistance (if applicable)         \nAbout Advanced Safety & User Experience      Advanced Safety & User Experience encompasses our deep expertise in centralized computing platforms, advanced safety systems and automated driving, while acknowledging the growth in areas that enrich the in-vehicle experience.      Some see differences. We see perspectives that make us stronger.       Diversity and Inclusion are sources of innovation and creativity, both of which are essential to Aptiv’s success. Everyday our diverse team comes together, drives innovation, pursues solutions, and meets challenges using their unique abilities, perspectives and talents, changing what tomorrow brings. When you join our team, you’ll get encouraged to think boldly, express your viewpoint and innovate as a matter of habit.      Some see technology. We see a way to make connections.      At Aptiv, we don’t just see the world differently; we work to change reality. That means developing technology that rewrites the rules of what’s possible in the pursuit of making transportation safer, greener and more connected. Today there are more than 180,000 of us globally, located in 44 countries, and united by one mission. Join the movement and together, let’s change tomorrow.      Privacy Notice - Active Candidates: https://www.aptiv.com/privacy-notice-active-candidates      Aptiv is an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, gender identity, sexual orientation, disability status, protected veteran status or any other characteristic protected by law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T17:19:29.000Z"
    },
    "company": {
        "name": "Aptiv",
        "link": "https://ie.linkedin.com/company/aptiv"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Troy",
        "region": "MI",
        "postal_code": "48085",
        "street_address": null,
        "latitude": 42.56294,
        "longitude": -83.154045
    }
}