{"location": {"country": "US", "locality": "Santa Clara", "region": "Santa Clara", "postal_code": "95050", "street_address": null, "latitude": 37.352394, "longitude": -121.95308}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Embedded Software Engineer - C Programming, Hardware, Systems", "industry": "Computer Hardware", "description": "If you are an Embedded Software Engineer with C programming experience, please read on!\nWith locations around the world, we're a technology powerhouse on a mission to develop the next generation of cutting-edge, networking products and services for our customers! Due to explosive growth and increased demand for our products/services, we're looking to expand our embedded engineering team with talented programmers with C programming skills for embedded systems (hardware/firmware).\nTop Reasons to Work with Us\nRecognized industry leader!\nCompetitive base salary and benefits!\nOpportunity for professional growth!\nWhat You Will Be Doing\nResponsible for developing, updating, and enhancing subsystems and portions of switch software using C and Python\nAnalyze designs to determine programming, coding, and integration needs based on product, solution, or architecture knowledge\nWriting and executing test plans, protocols, and documentation\nResponsible for software systems design status updates, problem resolution, and project progress\nWhat You Need for this Position\n3+ years of C Programming experience\nEmbedded software development experience\nDesign/architecture of software systems for embedded hardware/firmware\nTesting and debugging skills\nBachelor's degree in Computer Science, Information Systems, or equivalent\nPluses\nNetworking technologies and product experience\nGIT version control\nStrong understanding of product life cycles\nPython\nWhat's In It for You\nBenefits\nFor your hard work and dedication, you will be rewarded with a competitive base salary, RSUs and benefits including but not limited to\nMedical (HDHP + HSA, PPO, HMO, EPO, ACO options)\nDental\nVision\nLife AD&D\n401(k) + Match\nFlexible Spending Account (FSA)\nShort Term and Long Term Disability\nSo, if you are an Embedded Software Engineer with C Programming experience, please apply today!\nEmail Your Resume In Word To\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nPat.Befort@CyberCoders.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : PB2-1635326 -- in the email subject line for your application to be considered.***\nPat Befort - Recruiting Manager - CyberCoders\nApplicants must be authorized to work in the U.S.\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\nYour Right to Work\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.", "employment_type": "FULL_TIME", "date_posted": "2021-07-31T07:01:33.000Z"}, "company": {"name": "CyberCoders", "link": "https://www.linkedin.com/company/cybercoders"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}