{"location": {"country": "US", "locality": "San Diego", "region": "San Diego", "postal_code": "92161", "street_address": null, "latitude": 32.71576, "longitude": -117.16382}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "ONSITE Web Developer - Front End Web Development, HTML5, CSS3", "industry": "Financial Services", "description": "If you are a Web Developer with 2+ years of experience, please read on!\nWe have been around for over 20 years and have gained 3 billion in assets since 2019. We are looking to add team members who are willing to work onsite (essential business).\nCurrently, we are looking for a Web Developer who is self-motivated and accountable that can also work in a collaborative environment. We offer competitive salaries, bonuses (based on individual performance), PTO, and federal holidays to keep you happy - we ENCOURAGE you to take all PTO to keep refreshed and sharp at work. We work hard and play hard!\nWhat You Will Be Doing\nMaintain our current websites, landing pages, and related web properties\nConstruction of new websites\nFront-end design and development\nImplement website personalization and A/B testing\nWork with custom implementations/connections with external web applications\nWebsite Tag Management\nIdentify issues/bugs and troubleshoot accordingly\nCollaborate with and mentor other web developers\nWhat You Need for this Position\n2+ years' front-end web development\nHTML5, CSS3 Utilize organized and semantic code structure with emphasis on current standards and best responsive practices\nJavaScript working knowledge of Vanilla JS, jQuery and JS frameworks such as Angular, React, or Vue\nCMS Knowledge of how to develop custom code for Content Management Systems\nADA Knowledge of and experience developing to the WCAG 2.0 AA level\nExceptional organization with attention to the details while meeting your deadlines\nCreation and maintenance of documentation\nFamiliarity of connecting with CRM systems\nExcellent communication skills, and the ability to work independently, and collaborate with team members on a fast-paced project\nCollege degree in related field or equivalent experience\nWhat's In It for You\nCompetitive Compensation Package\nDental, Medical, and Vision\n401K\nBonuses Semi-Annually Based Off Individual Performance\nSelf Managing - No Micromanagement\nPaid Parking\nPTO 3 Weeks First Year!\n8 Sick Days\nBank Holidays 9-10\nSo, if you are a Web Developer with experience, please apply today!\nEmail Your Resume In Word To\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nWendy.Warner@CyberCoders.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : WW2-1641918 -- in the email subject line for your application to be considered.***\nWendy Warner - Associate Manager - CyberCoders\nApplicants must be authorized to work in the U.S.\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\nYour Right to Work\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.", "employment_type": "FULL_TIME", "date_posted": "2021-08-25T17:32:30.000Z"}, "company": {"name": "CyberCoders", "link": "https://www.linkedin.com/company/cybercoders"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}