{
    "job": {
        "title": "Data Scientist",
        "industry": "Health, Wellness and Fitness,Pharmaceuticals,Retail",
        "description": "Job Summary      Applies advanced data analysis tools and techniques to provide insights and actionable recommendations for the business. Utilizes complex statistical modeling to make predictions about future outcomes and in multiple scenarios. May explain findings to business audience.      Job Responsibilities        -  Responsible for applying advanced data analysis tools and techniques to provide insights and actionable recommendations for the business. Utilizes complex statistical modeling to make predictions about future outcomes and in multiple scenarios.   \n  -  Interprets and applies data in complex analyses, and explains findings to business audiences to improve products and processes.   \n  -  May support or lead the development of data-related commercial offerings and/or other intellectual property (IP)   \n  -  Implements statistical and mathematical analyses to support business resolution making.   \n  -  Develops and/or uses algorithms and statistical predictive models and determines analytical approaches and modeling techniques to evaluate scenarios and potential future outcomes.   \n  -  Applies analytical rigor and statistical methods to analyze large amounts of data, using advanced statistical techniques such as predictive statistical models, customer profiling, segmentation analysis, survey design and analysis, and data mining.   \n  -  Documents projects including business objectives, data gathering and processing, leading approaches, final algorithm, detailed set of results and analytical metrics.   \n  -  Develops materials to explain project findings.   \n  -  Effectively resolves problems and roadblocks as they occur.   \n  -  Interacts with internal and external peers and/or managers to exchange semi-complex information related to assigned activities.   \n  -  Prepares and presents interpretation of findings to internal clients.         \nBasic Qualifications     - Bachelor's degree and at least 2 years of experience in quantitative or computational functions; or graduate degree in a quantitative, computational or technical discipline   \n  - Knowledge of SQL   \n  - Experience in data science, advanced analytics, or statistics. Ability to interrogate data, perform analyses, interpret data, and present to business audiences.   \n  - Knowledge of open source data science and statistics packages such as Python, R, Spark, etc.   \n  - Experience establishing and maintaining key relationships with internal (peers, business partners and leadership) and external (business community, clients and vendors) within a matrix organization to ensure quality standards for service.   \n  - Experience analyzing and reporting data in order to identify issues, trends, or exceptions to drive improvement of results and find solutions.   \n  - Willing to travel up to 10% of the time for business purposes (within state and out of state).         \nPreferred Qualifications     - Graduate degree in a quantitative, computational or technical discipline",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-30T00:00:00.000Z"
    },
    "company": {
        "name": "Walgreens",
        "link": "https://www.linkedin.com/company/walgreens"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Junior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Deerfield",
        "region": "IL",
        "postal_code": "60015",
        "street_address": null,
        "latitude": 42.167313,
        "longitude": -87.84573
    }
}