{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Financial Services",
        "description": "Site Reliability Engineer  Position Summary Site Reliability Engineering (SRE) is what you get when you treat operations as if it is a software problem. Our mission is to protect and provide for the software and systems behind Clearent’s services with an ever-watchful eye on their availability, latency, performance, and capacity. As an SRE you will use your experience in running production-grade software to build automation that allow our systems to run smoothly with minimal intervention. Essential Duties and Responsibilities Automate pipelines to production and make it safe, secure, and repeatable so that development teams can self-service Configure and maintain Rancher clusters containing hundreds of docker microservices on-prem and in Azure Construct and maintain infrastructure-as-code using terraform, puppet, and ansible Solve problems relating to mission critical services and build automation to prevent problem recurrence with the goal of automating response to all non-exceptional service conditions Influence and create new designs, architectures, standards and methods for large-scale distributed systems Build world-class alerting, monitoring, and capacity management systems for the management of our platform’s health Participate in on-call rotations as needed Other duties as assigned by management Qualifications ·       5 years experience in a software development and/or operations role ·       Intermediate experience with Azure DevOps pipelines ·       Professional experience in docker ·       Intermediate experience with scripting (powershell, bash, python preferred) ·       Ability to troubleshoot running applications in a systematic manner ·       Comfortable working with applications on-prem and in Azure ·       Working proficiency with Git ·       Comfortable with Scrum-based development lifecycle ·       Excellent analytical and problem-solving skills ·       Strong and clear written and verbal communication skills ·       Ability to translate complex ideas into diagrams, user stories, and ultimately working software Competencies ·       Forward Thinking - Anticipates how individuals and groups will react to situations and information and plans accordingly. Anticipates the consequences of situations and plans accordingly. Notices trends in the industry or marketplace and develops plans to prepare for opportunities or problems. Anticipates possible problems and develops contingency plans in advance. ·       Drives Performance - Develops challenging but achievable goals. Maintains commitment to goals in the face of obstacles and frustrations. Finds or creates ways to measure performance against goals. Has a strong sense of urgency about solving problems and getting work done. Creates momentum and drives behavior change when necessary. ·       Adaptability - Adapts to new ideas and initiatives across a wide variety of issues or situations. Adapts interpersonal style to highly diverse individuals and groups in a range of situations. Supports major changes that challenge traditional ways of operating. Anticipates change in order to adapt own plans and priorities. ·       Fosters Teamwork - Assumes additional responsibilities to facilitate the achievement of team goals. Seeks input from other team members on matters that affect them. Shares all relevant information with others. ·       Open + Transparent Communication - Recalls others' main points, taking them into account in own communication. Checks own understanding of others' communication (e.g., paraphrases, asks questions). Elicits comments or feedback on what has been said. Maintains continuous, open and consistent communication with others. ·       Technical Expertise - With guidance, completes common tasks, which present limited difficulties. Reads standard documents to extract key information. Assists team in carrying out complex tasks.  ",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T18:45:58.000Z"
    },
    "company": {
        "name": "Clearent",
        "link": "https://www.linkedin.com/company/clearent"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Greater St. Louis",
        "region": null,
        "postal_code": "63101",
        "street_address": null,
        "latitude": 38.62262,
        "longitude": -90.192986
    }
}