{"location": {"country": "US", "locality": "Chantilly", "region": "Chantilly", "postal_code": "22022", "street_address": null, "latitude": 38.888687, "longitude": -77.417496}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "DevOps Engineer", "industry": "Information Technology and Services,Computer Software,Financial Services", "description": "Years of Experience\n7 years\nEducation Requirements\nBachelor’s Degree\nPosition Description\nCI/CD Engineer is responsible for the set-up, maintenance, and ongoing development of continuous build/integration infrastructure.\nRequirements\nResponsibilities\nCreate and maintain fully automated CI build processes for multiple environments\nWrite build and deployment scripts\nSupport CI/CD tools integration/ operations/ change management, and maintenance\nSupport full automation of CI/Testing\nDevelop policies, standards, guidelines, governance and related guidance for both CI/CD operations and for work of developers\nOn-board/ train and support developers from source control, through build automation, merge resolution, CI, test automation, deployment based on tools usage and policies, standards\nEnable DevOps by moving code from Dev/Test to Staging and Production. Troubleshoot issues along the CI/CD pipeline\nGood understanding of Quality Control and Test Automation in Agile-based Continuous Integration environments\nRequired Skills\n3-5 years of experience building DevSecOps pipelines for implementing CI/CD for cloud applications.\nPossess deep expertise in scripting languages like Bash, Python and Groovy and are very skilled in troubleshooting deployment issues on AWS.\nHave minimum 3 years of experience managing resources on AWS.\nPossess deep expertise in many tools from the DevSecOps tool chain.\nWorking knowledge of fundamental Linux systems administration.\nWorking knowledge of fundamental Windows Systems administration.\nCertifications\nAWS Solutions Architect (Associate) or Developer (Associate)\nMust be able to obtain a public trust security clearance\nPreferred Skills\nPrevious experience with VA and working on VA legacy systems for Education Service\nSoft Skills\nOrganizational Skills\nCan plan and prioritize work. Follows tasks to their logical conclusion and makes sure that everything has been done to the right standard. Good attention to detail.\nTeam Work\nAble to enthuse and maintain project interest. Comfortable working both individually and as part of a team. Prepared to challenge ideas within a group in a constructive way.\nCommunications\nAbility to communicate clearly and efficiently to team members and clients, verbally and in writing. Able to present ideas in a variety of ways depending upon audience and context. Excellent active listening skills.\nQuantitative Management\nAbility to determine process measures and track to determine process effectiveness and efficiency.\nResults oriented\nAble to drive things forward regardless of personal interest in the task.\nBenefits\nSES provides a competitive salary and the following benefits\nMedical\nDental\nVision\nAD&D\nSTD\nLTD\nCompany paid Life Insurance\n401k with employer contribution\nPaid Time Off", "employment_type": "FULL_TIME", "date_posted": "2021-08-06T15:59:48.000Z"}, "company": {"name": "SES Corporation", "link": "https://www.linkedin.com/company/ses-corporation"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}