{"location": {"country": "US", "locality": "Pittsburgh", "region": "Pittsburgh", "postal_code": "15235", "street_address": null, "latitude": 40.44217, "longitude": -79.99496}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Scientist, New Graduate", "industry": "Marketing and Advertising,Computer Software,Internet", "description": "Our mission at Duolingo is to develop the best education in the world and make it universally available. But we’ve got more left to do — and that’s where you come in!\nDuolingo is the most popular language-learning application in the world, with over 500 million users and over half a billion exercises completed daily. Beyond our core learning product, we have also entered into literacy with Duolingo ABC and English proficiency testing with the Duolingo English Test .\nWe are passionate about educating our users, making fact-based decisions, and finding innovative solutions to complex problems. We offer meaningful work, limitless learning opportunities, and collaboration with world-class minds. Come brighten your life and over half a billion more!\nWhat You’ll Do...\nDerive insights from data to influence product roadmaps and drive business results\nLead product experiments to create and improve user experiences\nApply advanced analytical methods to model user behavior, and collaborate with product teams to develop solutions\nDevelop dashboards, reports, and forecasts\nEnsure the quality of our tracking and data collection\nHelp preserve our culture of fact-based decision making as we scale\nWhat We’re Looking For…\nStrong understanding of consumer digital products and an interest in applying advanced analytics to business outcomes\nPursuing a BS or MS degree in a quantitative field (e.g., statistics, economics, computer science, computational psychology) or commensurate industry experience\nGraduation expected in Spring 2022 (or Fall 2021)\nPrevious experience with analyzing large datasets and presenting results\nSkilled in SQL, R, Python, and/or statistical methods to analyze behavioral data\nExcellent presentation and communication skills\nExceptional Candidates...\nExperience with \"big data\" and cloud computing technologies like Redshift, Hadoop, Hive, BigQuery\nExperience articulating business questions and using available data to find answers that translate into product recommendations\nSelf-starter, with a desire both to learn new techniques and guide others\nProgramming experience in Java or Scala is a plus\nWhy you’ll love working here…\nLanguage learning opportunities\nCatered in-house lunches, and breakfast and dinner options\nCompany-wide Hackathon\nPTO and company holidays\nFrequent company-wide dinners, monthly celebrations, social clubs, and so much more!", "employment_type": "FULL_TIME", "date_posted": "2021-08-07T01:12:55.000Z"}, "company": {"name": "Duolingo", "link": "https://www.linkedin.com/company/duolingo"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}