{
    "job": {
        "title": "Network Engineer",
        "industry": "Information Technology and Services",
        "description": "Local required for Location: Salt Lake City, UTDay one onsite requiredAn Individual in this role will be part of a diverse global network engineering execution team responsible for Implementation, Deployment, Operations and Product Life Cycle management of network infrastructure, including both internal campus/trading network and external facing client and Internet connectivity.Must be a collaborative team-playerAn individual in this role will be part of network engineering execution team responsible for Implementation, Deployment, Operation and Product Life Cycle management of network infrastructure, including both internal campus/trading network and external facing client and Internet connectivity, according to the global network policies and best practices  - Work with a global network team on providing level 1-2 troubleshooting for network incidents.   \n  - Maintains lifecycle management for the network security production environment (installation, upgrades, patches, decommissioning, etc.)   \n  - Provide network input when collaborating on cross platform projects with teams responsible for Voice, Video, Market Data, Compute, Storage, Information Security and Data Centre.   \n  - Maintain accurate network diagrams, inventory and documentation for network infrastructure.   \n  - Own the delivery of a variety of concurrent network projects in varying scale from small to very large   \n  - Follow established network policies and procedures, implementations, upgrades, patches, installation of new applications and equipment, and ticket resolution. Continually assesses network configurations for conciseness, efficiency, and ease of maintenance.   \nBasic Qualification:  - Understanding of networking technologies, topologies, and protocols. (TCP/IP, Routing, Switching, VLANs, Firewalls, Carrier Circuits, Ethernet)   \n  - Technical experience using any of the following: Cisco Routers & Switches, Nexus, ASR, ISR product lines, Cisco IOS, NX-OS, Juniper and Net screen firewalls, GRE/IPsec   \n  - Hands-on experience in implementing, operating and troubleshooting IP-based Data networks (LAN/WAN/MAN).   \n  - Knowledge and experience working with network management tools such as configuration management, network health check tools, log collectors   \n  - Highly self-motivated and ability to work independently in a global team environment.   \n  - Excellent analytical, problem-solving and decision-making skills   \n  - Good communication, presentation and interpersonal skills   \n  - Experience working in finance industry and multi-national company   \n  - Experience with automating Network functions is a plus. Experience with at least one programming language (Python,   \nG: Other soft skills/aptitude :  - Energetic, self-directed and self-motivated, able to build and sustain long-term relationships with clients and colleagues   \n  - Intuitively coalesce towards problems with an open mind, within the context of a team   \n  - Exceptional analytical skills, able to apply knowledge and experience in decision-making to arrive at creative and commercial solutions   \n  - Strong desire to learn and contribute solutions and ideas to a broad team   \n  - Independent and comfortable in a fast paced, ambiguous and often multi-directional work environments   \n  - Can manage multiple tasks and use sound judgment when prioritizing   \n  - Strong verbal and written communication skills   \n  - Ensures accuracy of the information entered into the production scheduling systems   \n  - Ensures accuracy and timeliness of information entered in problem management systems",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-18T22:16:27.000Z"
    },
    "company": {
        "name": "Indotronix International Corporation",
        "link": "https://www.linkedin.com/company/indotronix-international-corporation"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Salt Lake County",
        "region": "UT",
        "postal_code": "84088",
        "street_address": null,
        "latitude": 40.758476,
        "longitude": -111.888145
    }
}