{"location": {"country": "US", "locality": "Cambridge", "region": "Cambridge", "postal_code": "02239", "street_address": null, "latitude": 42.36525, "longitude": -71.10502}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Scientist", "industry": "Biotechnology", "description": "Satellite Biosciences\nis pioneering the development and implementation of proprietary, off-the-shelf, implantable satellite organs as living therapeutic solutions that can transform the lives of millions of patients who suffer from serious diseases.  Building on 25 years of work in award-winning labs at top academic institutions, the platform is supported by a strong IP portfolio and is backed by a top tier syndicate, led by Polaris Partners.\nWe are seeking an experienced, creative, and motivated\nData Scientist\nto join our rapidly growing team. In this role you will contribute to the company’s platform technology of engineered satellite organs. Specifically, you will contribute towards our efforts to characterize and optimize the satellite organs using data driven approaches and modeling techniques such as unsupervised and supervised machine learning.\nThis role is a unique opportunity to join an early-stage, well-funded Biotech startup. You will report directly to our Senior Data Scientist. The position is full time and offers flexibility for working remotely.\nResponsibilities:\nWrangle data of multi-omic datasets and images in preparation for algorithm development and machine learning\nEvaluate open access databases of sequencing results for disease modeling\nDevelop 2D and 3D image analysis algorithms\nParse sequencing results and use unsupervised, semi-supervised, and machine learning techniques for outcomes prediction\nAnalyze peptide and nucleic acid sequence data sets\nManage cloud relational databases of analysis outputs (e.g., PostgreSQL)\nConstruct and optimize code for machine learning algorithms\nAssist in using convolutional neural networks with and without transfer learning techniques to develop prediction algorithms.\nSupport running statistical hypothesis tests and generate power curves.\nRequired Qualifications & Experience:\nBS, MS, or PhD in a quantitative discipline\n0 to 5 years of experience in the biotechnology industry\nProficiency with Python or Julia\nCompetency with data wrangling from imaging and tabular data (e.g., pandas)\nExperience with machine learning and at least one deep learning library (e.g., Tensorflow, PyTorch, MXNet, Flux) a plus.\nUnderstanding of statistical hypothesis testing with multi-factor and multi-level datasets a plus.\nExperience with at least one of the following:\nImaging analysis and algorithm development\nRNA-Seq datasets and analysis\nMachine learning and convolutional neural networks\nHistology images\nExperience preferred but not required: Linux and Git AWS or other cloud computing platforms\nPossesses documentation skills and attention to detail.\nExcellent communication, presentation, collaboration, time-management, and organizational skills are required.\nThe successful candidate will be an ambitious self-starter, have a strong work ethic, be able to generate high quality work under tight deadlines, and enjoy working in a fast-paced team environment.", "employment_type": "FULL_TIME", "date_posted": "2021-08-20T18:46:12.000Z"}, "company": {"name": "Satellite Bio", "link": "https://www.linkedin.com/company/satellite-bio"}, "education": {"required_credential": null}, "experience": {"months_of_experience": null, "seniority_level": null}}