{"location": {"country": "US", "locality": "United States", "region": "United States", "postal_code": "99999", "street_address": null, "latitude": 39.50355, "longitude": -99.0183}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Front End Cloud Software Developer", "industry": "Information Technology and Services", "description": "Candidate Requirements\nMust be physically located in the United States\nMust be a US Citizen or legally eligible to work in the US without requiring sponsorship\nMust be fluent in written and verbal English\nMinimum of 3 years of SFCC (Commerce Cloud) experience\nResponsibilities - You will:\nProduce excellent code while collaborating with internal development resources at the client.\nPartner with other Red Vanners for QA, Project Management, and troubleshooting development issues.\nParticipate in stand-up meetings, conference calls, track your time, and work through tickets assigned to you within a Jira instance. Lots of tickets.\nWork remotely with the distributed team at Red Van as well as client resources, being available during core business hours.\nAct with urgency and professionalism when interfacing with client resources. Don’t worry, our Project Managers step in to handle the primary communication and resolve conflicts with clients.\nLearn from some of the best on how to develop within the enterprise level e-commerce platform, Salesforce B2C Commerce Cloud.\nSkills and Experience needed for success:\n3-5 years minimum of experience with developing software and technical implementations of customer projects.\nExperience building web applications, especially in the Node.js environment.\nExperience with object-oriented languages and concepts, including development work using .NET, Javascript or other similar languages\nHands-on professional experience in designing, documenting and developing web-based and stand-alone software applications.\nStrong understanding of Front end and Back end web development.\nSome experience evaluating and implementing cloud-based solutions\nExcellent communication skills and a demonstrated ability to work independently.\nPossess analytical, problem-solving, teamwork and communication skills as well as creativity and attention to detail; familiarity with database management, development environment, program testing, and other related software.\nAppreciation for web standards and accessibility (e.g. WCAG Standards, screenreader support, semantic HTML).\nExcitement to play a critical and evolving role in driving technical initiatives to enhance end-user and developer experiences.\nExperienced working with designers to create and maintain style guides & CSS standards across different applications.\nCompensation:\n$90,000, - $120,000 annually\nPerks and Benefits:\nWork fully remote within the US\nComprehensive benefits and health coverage\nAnnual bonus\nPaid vacation, sick leave, and time off to volunteer\nPaid leave for new parents\nWe invest in your future by contributing 3% of your salary to a 401(K), even if you don't\nRecurring stipend to upgrade your home office and equipment", "employment_type": "FULL_TIME", "date_posted": "2021-08-18T22:14:09.000Z"}, "company": {"name": "Red Van Workshop", "link": "https://www.linkedin.com/company/red-van-workshop"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}