{
    "job": {
        "title": "Advisor System Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "DXC Technology (NYSE: DXC) helps global companies run their mission critical systems and operations while modernizing IT, optimizing data architectures, and ensuring security and scalability across public, private and hybrid clouds. The world’s largest companies and public sector organizations trust DXC to deploy services across the Enterprise Technology Stack to drive new levels of performance, competitiveness, and customer experience. Learn more about how we deliver excellence for our customers and colleagues at DXC.com.      Essential Job Functions     - Designs and develops highly complex, integrated solutions to meet business requirements or enhance performance.   \n  - Performs and evaluates cost analyses and vendor comparisons for large scale projects to ensure cost-effective and efficient operations. Measures feasibility of various approaches and makes recommendation(s). Ensures adherence to model created and overall budgetary guidelines.   \n  - Recommends moderately complex systems investment(s) to management and customers based on results of independent assessment of current and future performance, stability, and systems management/life cycle issues.   \n  - Provides escalated, highly complex technical support to customers by investigating and resolving systems-related matters of significance; provides support telephonically and/or electronically.   \n  - Plans, conducts and oversees the technical aspects of projects; coordinates the efforts of technical support staff in the performance of assigned projects.   \n  - Applies advanced methods, theories and research techniques in the investigation and solution of the complex system requirements and problems. Develops training tools and documentation; oversees implementation of same.   \n  - Reviews literature, patents and current practices to support business requirements and/or new industry technology. Prepares reports regarding new technology to communicate to appropriate personnel.   \n  - Provides technical consultation on current and proposed systems to other organizations and clients.   \n  - Provides leadership and work guidance to less experienced personnel.      \nBasic Qualifications     - Bachelor's degree or equivalent combination of education and experience   \n  - Bachelor's degree in systems engineering, computer science, management information systems, or related field preferred   \n  - Nine or more years of experience in systems engineering, software engineering, operating systems programming or naval architecture   \n  - Experience working with computer hardware, operating system software and desktop applications with a specific concentration in one or more areas   \n  - Experience working with one or more structured programming languages   \n  - Experience working with design principles and applications      \nOther Qualifications     - Strong communication skills to communicate systems proposals to management and customers and provide systems diagnoses and resolution for current systems   \n  - Strong organization skills to prioritize work, balance and lead complex projects   \n  - Good interpersonal skills to interact with customers, senior level personnel, subordinates, and team members   \n  - Good leadership skills to guide and mentor the work of less experienced personnel   \n  - Ability to integrate complex hardware and software systems   \n  - Ability to work independently and as part of a global team      \nWork Environment     - Office environment",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T22:17:58.000Z"
    },
    "company": {
        "name": "DXC Technology",
        "link": "https://www.linkedin.com/company/dxctechnology"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 108,
        "seniority_level": "Senior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Colorado Springs",
        "region": "CO",
        "postal_code": "80908",
        "street_address": null,
        "latitude": 38.835224,
        "longitude": -104.8198
    }
}