{
    "job": {
        "title": "Data Scientist",
        "industry": "Internet",
        "description": "Passionate about development in leading technologies? Looking to become a major player on a diverse team in your next career adventure? Koddi Data Scientists drive innovation by embracing challenges and leveraging decision science to solve complex problems in adtech.&amp;nbsp;In this position, you will be responsible for designing, building, and deploying complex systems to model and glean useful insights from billions of rows of data. You will inform decisions based on complex statistical modeling using machine learning, optimizing and forecasting algorithms powered by industry-leading technologies.&amp;nbsp;Candidates for this role may be based out of Fort Worth, TX; Austin, TX; Ann Arbor, MI; or New York, NY; or remote   WHO YOU ARE  - Minimum of&amp;nbsp;2&amp;nbsp;years of working experience as a data scientist&amp;nbsp;with a focus on marketing analytics, machine learning, real-time bidding (RTB) and digital campaign measurement   \n  - You have an advanced degree in statistics, computer science, operational research, engineering or related field.&amp;nbsp;PhD preferred   \n  - You have demonstrated expertise with Python.&amp;nbsp;Experience with Spark and TensorFlow   \n  - You have worked extensively with machine learning techniques and advanced analytics (e.g. regression,&amp;nbsp;deep learning,&amp;nbsp;causal inference, mathematical optimization)   \n  - You have Advanced SQL skills - comfortable working with very large data sets   \n  - Preferably, you have experience&amp;nbsp;with cloud environment such as AWS   \n   WHAT YOU'LL DO  - Build production grade models on large-scale datasets to optimize marketing performance by utilizing advanced statistical modeling, machine learning, or&amp;nbsp;deep learning&amp;nbsp;techniques and marketing science research   \n  - Use models to address key growth challenges and provide meaningful insights on problems such as cross-channel optimization,&amp;nbsp;RTB optimization, and media budget allocation   \n  - Provide thought leadership in applying innovative machine learning techniques to solve complex data science problems   \n  - Work with cross-functional teams to implement and improve data-driven solutions   \n  - Use large scale data processing such as Spark, Hive, and machine learning platforms   \n  - Collaborate with marketing leadership, design, product and engineering teams   \n  - Participate in project planning/prioritization meetings, partner meetings, etc   \n      WHO WE AREKoddi's award-winning ad technology platform provides a robust network for brands to connect with&amp;nbsp;consumers and drive revenue through native sponsored placements, metasearch, and programmatic media campaigns.&amp;nbsp;Based in Fort Worth, Texas, Koddi has additional office locations in New York, Ann Arbor, Austin, San Francisco, and Düsseldorf. We’ve been embracing remote work since 2020 and plan to transition to a hybrid remote model when it’s safe to return to our offices.&amp;nbsp;Koddi has been ranked by Forbes, Deloitte, and the Inc. 5000 as one of the fastest-growing companies in the nation. We’re on a mission to forge a better path to discovery through integrity, insights, inclusivity, and innovation. Come join us!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T16:21:14.000Z"
    },
    "company": {
        "name": "Koddi",
        "link": "https://www.linkedin.com/company/koddi"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}