{"location": {"country": "US", "locality": "Hillsboro", "region": "Hillsboro", "postal_code": "97124", "street_address": null, "latitude": 45.52395, "longitude": -122.98974}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Validation Design Engineer - SOC", "industry": "Electrical/Electronic Manufacturing,Computer Software,Semiconductors", "description": "Job Description\nNow is an exciting time for Intel’s Design Enablement Group! This position is within the Design Enablement (DE) organization of Technology Development (TD). At Intel, Design Enablement is one of the key pillars enabling Intel to deliver winning products in the marketplace. Your work will directly enable design teams to get to market faster with leadership products on cutting edge technologies and partner with Technology Development to deliver cost-effective, competitive design platform.\nIn this position you will help us with one or more of the following responsibilities:\nDesign and integration of Intel’s lead technology-development test chips.\nDefine and design test structures needed for process development.\nWork with TD Process and device experts to define critical Design features and test structures to exercise on the test chips.\nDevelop CAD software/flows that automate physical layout of E-Test Structures\nDevelop layout verification software to implement process design rules using industry standard tools.\nDigital system design using RTL for implementation through logic synthesis & automatic place-and-route\nValidate design IP at the IP and system level\nDevelop and utilize various debug and validation tools and/or methodologies to implement validation plans to ensure a solid design\nBehavioral Traits That We Are Looking For\nWritten and verbal communication skills\nTeamwork, problem-solving, and data analysis\nAbility to work across geographical locations\nBy applying to this posting, you’ll be considered for multiple roles within Design Enablement (DE)\nThis is an entry level position and will be compensated accordingly.\nQualifications\nYou must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Experience listed below would be obtained through a combination of your schoolwork/classes/research and/or relevant previous job and/or internship experiences.\nMinimum Skills And Experience That Will Get You Noticed\nYou should have Bachelor’s degree OR Master's degree OR PhD in Electrical Engineering, Computer Engineering, Computer Science, or other related Electrical Scientific STEM field, with 6+ months of work or educational experience. Must have the required degree or expect the required degree by May of 2022.\nYour experience must be in one or more of the following areas:\nCircuit design and VLSI technology\nComputer architecture, RTL, Verilog, System Verilog, exposure to OVM UVM\nKnowledge of Chip floor planning, layout integration, layout design rules and schematic/layout comparison debug and validation\nExperience with floor planning, layout design, and verification CAD tools\nDigital system RTL based design, including DFT, system architecture, and integration of various IPs into subsystems\nSolving problems using efficient computer algorithm and programming techniques.\nObject oriented programming, data structures, algorithms and digital logic.\nProgramming or scripting in Python, Perl, Tcl, SKILL, C++, or Unix shell.\nPreferred experience in one\nor more\nof the following areas:\nKnowledge of semiconductor device physics, process scaling, and advanced technology nodes.\nIndustry standard CAD tools for schematic entry, circuit simulation, custom layout, and design/layout verification, from vendors such as Cadence, Synopsys, and Siemens.\nDesign Compiler (DC), IC Compiler (ICC2), Fusion Compiler (FC), Genus, or Innovus\nLayout verification using ICV/Calibre.\nPre-silicon or post-silicon validation/verification\nDevelopment of PCells or PyCells\nBy applying to this posting your resume and profile will become visible to Intel Recruiters / Sourcers and will allow them to consider you for current and future job openings aligned with the skills and positions mentioned above.\n#designenablement\n@designenablemnt\nInside this Business Group\nManufacturing and Product Engineering (MPE) is responsible for test development across product segments, supporting 95% of Intel's revenue. We deliver comprehensive pre-production test suites and component/physical debug capabilities to enable high quality, high volume manufacturing.\nOther Locations\nUS, California, Santa Clara; US, California, Folsom; US, Arizona, Phoenix; US, Texas, Austin;\nPosting Statement\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.", "employment_type": "FULL_TIME", "date_posted": "2021-09-12T05:09:56.000Z"}, "company": {"name": "Intel Corporation", "link": "https://www.linkedin.com/company/intel-corporation"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 6, "seniority_level": "Junior"}}