{"location": {"country": "US", "locality": "Phoenix", "region": "Phoenix", "postal_code": "85009", "street_address": null, "latitude": 33.448204, "longitude": -112.072586}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Scientist-REMOTE", "industry": "Information Technology and Services,Computer Software", "description": "This AI Computer Software company located in Palo Alto, CA is looking to hire a sharp Data Science Engineer to join their growing company\nThis Jobot Job is hosted by Taylor Buckelew\nAre you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.\nSalary $135,000 - $170,000 per year\nA Bit About Us\nLocated in the beautiful Palo Alto, CA we are the leading provider of AI- powered software products that transform healthcare claims and payment operations. Our platform has enabled us to develop and deploy, at high speed, industry-specific products.\nWe are looking to hire a strong Data Scientist, that will come in, develop and deploy scalable machine learning solutions to solve problems in the healthcare space.\nWhy join us?\nWe offer a comprehensive compensation package including but not limited to\nA competitive base salary ranging from $135K-$165K (DOE) + EQUITY!\n401k\nBenefits Health, Dental, Vision\nCollaborative team\nTrainings\nPaid time off\nParties and team building events\nJob Details\nYou will be responsible for and MUST have most or ALL of the following\nBachelor's of Master's in Computer Science or related field\nStrong business analysis skills\nExperience in solving real-world business problems involving data-driven optimization\nExperience with developing and deploying machine-learning systems\nStrong experience with a programming language ( Python, SQL, R, etc.)\nExperience building data pipelines\nIF INTERESTED, APPLY DIRECTLY HERE OR EMAIL ME A RESUME AT taylor.buckelew@jobot.com\nInterested in hearing more? Easy Apply now by clicking the \"Apply\" button.", "employment_type": "FULL_TIME", "date_posted": "2021-08-16T21:10:32.000Z"}, "company": {"name": "Jobot", "link": "https://www.linkedin.com/company/jobot"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}