{
    "job": {
        "title": "Senior Site Reliability Engineer",
        "industry": "Financial Services",
        "description": "Want to help everyday Americans invest and build wealth? Financial inequality is increasing, and too many people are getting left behind. At Stash, we are passionate about democratizing wealth creation through education, advice, and products that help customers achieve greater financial freedom.   Our team is looking for a Senior Site Reliability Engineer with a passion for building reliable, scalable, and performant software to power the Stash experience. We've had tremendous growth in the past two years and have an exciting product roadmap ahead of us.If you're interested in solving complex problems associated with scaling a popular consumer facing application and working in an open, diverse, and inclusive environment- Stash might be the fit for you!   What you'll do:  - Assist in building a team of high performing Site Reliability Engineers   \n  - Partner with cross-functional squads in developing the standards of the infrastructure   \n  - lifecycle   \n  - Work with Automation Engineers in testing failures and recoveries   \n  - Work with DevOps Engineers in developing playbooks for various outage and escalation   \n  - scenarios   \n  - Define and own the rollout of SLO budgets with the squads   \n  - Introduce a chaos testing mentality and weekly firedrills   \n  - Standardize SLAs and work with Squads to implement and maintain them   \n  - Create a culture of confidence in the system to deploy anytime, anywhere   \n   What we're looking for:  - 8+ years of professional experience as a Site Reliability Engineer   \n  - An experienced engineer who is looking to build a culture of testing, automation, and   \n  - monitoring on a greenfield project   \n  - &amp;nbsp;Great communicator who is able to collaborate with a lack of ego   \n  - Creative problem solver with a passion for testing, debugging, and quality   \n  - Data-driven decision maker, willing to take risks, fail fast, and iterate quickly   \n  - Passionate advocate of the key objectives of SRE - SLOs, SLIs, and SLAs   \n  - &amp;nbsp;Learning-focused student of modern technology stacks and patterns   \n   Gold Stars:&amp;nbsp;  - Experience building an application at scale   \n  - Experience with asyncronous microservice systems   \n  - Experience with event-based architectures   \n  - Experience building the SRE culture of a new system   \n   At Stash it is our mission to help everyday Americans invest and build wealth. That includes people of all races,&amp;nbsp;genders, and abilities, so it is important to us to acknowledge and address the issues of inequality in financial services head on.&amp;nbsp;   Diversity and inclusion are essential to living our values, promoting innovation, and building the best products. Our success is directly related to our employees and we believe that our team should reflect the diversity of the customers that we serve.&amp;nbsp;As an Equal Opportunity Employer, Stash is committed to building an inclusive environment for people of all backgrounds.   If you require any reasonable accommodations to make your application process more accessible please reach out to recruiting@Stash.com.&amp;nbsp;   Invest in Yourself:&amp;nbsp;  - Equity & Stash Accounts [Invest, Retire, Custodial, Bank]&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;   \n  - Flexible PTO&amp;nbsp;   \n  - Learning & Development Fund&amp;nbsp;   \n  - Work from Home Stipends   \n  - Parental Leave [Primary & Secondary]   \n   Recognition:  - BuiltIn’s Best Places to Work (2019, 2020, 2021)&amp;nbsp;   \n  - Forbes Fintech 50 (2019, 2020, 2021)   \n  - Best Digital Bank, Finovate Awards (2020)   \n  - Tearsheet Challenge Awards, Best Banking Card Product - Stock-Back® Card, 2020   \n  - LendIt Fintech Innovator of the Year (2019 & 2020)   \n   **No recruiters, please**This position may be performed remotely anywhere within the United States except the State of Colorado.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T18:56:16.000Z"
    },
    "company": {
        "name": "Stash",
        "link": "https://www.linkedin.com/company/stashfinancial"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}