{"location": {"country": "US", "locality": "San Francisco Bay Area", "region": "San Francisco Bay Area", "postal_code": "94112", "street_address": null, "latitude": 37.39271, "longitude": -122.042}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Postgres Development DBA - Remote", "industry": "Information Technology and Services,Financial Services", "description": "About Us\nSince 2007, Webgility has helped over 10,000 companies with ecommerce automation. Today, we are the #1 automation software for QuickBooks & NetSuite retailers. Business is booming, and we’re growing at warp speed!\nOur Mission\nEmpower small & medium-sized enterprises to thrive in ecommerce. We integrate their systems, automate their operations & deliver powerful insights so they can move faster, make better decisions and win!\nOur Core Values\nKeep it real.\nWe do amazing work but we're humble, transparent, and accountable. If we make mistakes, we own up and always keep it real. No egos, please.\nStay curious.\nNo matter what we're working on, we give it our 100%. We're always learning and feel connected to our team and our customers.\nLead with data.\nWe focus on results, not activity. We understand—both for ourselves and our customers—that data and software are key. We use them both so our work creates real impact.\nWin as a team.\nWe come for the job and stay for the people. We love good food and drink. There are always laughs to be had, whether a budget meeting or a bowling party.\nEnjoy the journey. Our customers often tell us that our software has changed their lives. We want to change the face of the ecommerce industry by helping businesses easily run back-office operations.\nAs a development DBA for Webgility, you will:\nDesign stable, reliable and effective databases\nCollaborate with a team of world-class developers on their design decisions, giving advice on performance and writing good SQL\nPrepare deployment scripts and produce deployment plans\nPrepare rollback scripts and produce rollback plans\nProvide administration of development, testing and staging servers\nOffer consulting on optimal architecture and data models\nDetermine, enforce and document database policies, procedures and standards\nPerform business requirement analysis with PM\nCreate and manage schema documentation and other technical artifacts relating to development\nWork cross-team with other co-located teams, remote teams, and external partner companies\nRequired Job Skills and Experience\n4+ years work experience as a Database developer building commercial software\nBS Degree in Computer Science, Electrical & Computer Engineering, Mathematics or equivalent job experience\nExtensive experience with PostgreSQL\nIn-depth understanding of data management (e.g. permissions, recovery, security and monitoring)\nExtensive experience working with agile sprint teams to collaborate\nExcellent analytical and organization skills\nAn ability to understand front-end users requirements and a problem-solving attitude\nExcellent verbal and written communication skills\nResearch and suggest new database products, services and protocols\nOther Requirements\nMust be a US citizen or authorized to work in the US. Visa sponsorship currently not available.\nDeep Thoughts\nBe a part of something bigger with more opportunity and ownership of innovative ecommerce solutions. Ecommerce continues to grow at record speeds and you can help disrupt the market. Did you know? In the time it took you to read this, there were 200,000 searches on eBay and over 45,000 autonomous robots now roam Amazon warehouses in search of their next package.", "employment_type": "FULL_TIME", "date_posted": "2021-08-25T17:27:42.000Z"}, "company": {"name": "Webgility, Inc.", "link": "https://www.linkedin.com/company/webgility"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 48, "seniority_level": "Mid-Level"}}