{"location": {"country": "US", "locality": "Los Angeles", "region": "Los Angeles", "postal_code": "90101", "street_address": null, "latitude": 34.05224, "longitude": -118.24335}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Machine Learning Engineer", "industry": "", "description": "Title:\nEngineering Internship (Machine Learning Engineer)\nJob Description\nNoria Water Technologies seeks an intern with experience working in a laboratory environment and basic knowledge of image analysis and machine learning interested in gaining real-world experience. We are a water technology company providing unique solutions for improving operations of water-based processes through real-time monitoring, big data, and analytic capabilities. The candidate must be able to thrive in a dynamic, multi-disciplinary, and hands-on environment that values excellence, creativity, and innovation.\nTerms\nFall 2021 from August to December\nPart-time during the school year: must be able to work 15-20 hours/week\nFlexible schedule can be arranged for part-time work during normal business hours\nResponsibilities\nIn-person laboratory work\nSupport of development projects\nCharacterization of images of fouled/ scaled materials\nSet up and run reverse-osmosis experiments\nSetup image collection system, collect data, and apply image processing and machine learning techniques\nAssists with designs, experiments and assemblies as requested\nBenefits\nPractical experience with a wide variety of water treatment and desalination and data science tasks\nCollaborating hand-in-hand with interdisciplinary team\nShadowing, mentoring, and training opportunities with seasoned professionals\nFlexible schedule for students\nNoria facilities are spacious with strict adherence to COVID-19 protection requirements\nQualifications\nRequired to be currently enrolled in a full-time Bachelor's degree or Graduate degree STEM program at an accredited college or university\nMust work on-site and be fully vaccinated\nLaboratory experience required\nKnowledge of basic data science and ability to use machine learning tools for image analysis\nExcellent analytical and mathematics skills\nGood verbal and written communications skills with ability to work in a team environment\nExperience programming in Python / C / C++, with AWS, or drawing CAD is a plus\nJob Function\nEngineering, Physical Sciences, Research, Science and Mathematics\nLocation\nLos Angeles, California United States\nSalary Level\nPaid\nApproximate Hours Per Week\n20\nStartup\nYes\nDesired Start Date\nAugust 9, 2021\nDuration\nAugust - December 2021", "employment_type": "INTERN", "date_posted": "2021-07-30T23:17:31.000Z"}, "company": {"name": "Noria Water Technologies", "link": "https://www.linkedin.com/company/noria-water-technologies"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}