{"location": {"country": "US", "locality": "Seattle", "region": "Seattle", "postal_code": "98133", "street_address": null, "latitude": 47.60323, "longitude": -122.33028}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer I", "industry": "Health, Wellness and Fitness", "description": "A day in the life…\nWork with a small agile team to design charted to build out the tools and applications necessary to support our government customers.\nInterface with our internal users and beta testers to gather feedback and troubleshoot issues.\nProductize our tools to help create an application platform which can be used to create new applications and features quickly and consistently.\nWork tightly with our DevOps teams to deploy and support our software using cloud services and tools such as Amazon Web Services, GitHub, Shippable, Docker and more.\nMarry business APIs with UX designs to build performant UI using React, Redux, and Less/Sass.\nOperates effectively as a collaborative member of the development team.\nOperates effectively as an individual for quick turnaround of enhancements and fixes.\nResponsible for meeting expectations and deliverables on time with high quality.\nEffectively develops in a clean, well structured, easily maintainable format.\nDemonstrates creative, technical, and analytical skills.\nDemonstrates ability to communicate effectively in both technical and business environments.\nQualifications\nWhat we are looking for…\nCandidate\nmust be a US Citizen\nwho currently holds or is able to attain a public trust or higher-level clearance.\nExperience in designing, evaluating, and developing web applications.\nMinimum of 1-2 years of web development and applications development experience is required.\nSolid understanding of UX and UI design with an emphasis on maximizing usability.\nSolid understanding of building web applications\nProficient at back-end development with experience building web UI.\nProficiency in utilizing modern HTML, CSS, JavaScript, and frameworks.\nPreferred exposure to: Less/Sass, React, Node, Flux, Redux, AngularJS, *nix shell, Docker, npm, AWS\nStrong written and oral communication skills.\nDesire and willingness to work in an Agile, collaborative, innovative, flexible, and team-oriented environment\nDesired Personal Characteristics:\nAn excellent leader with a “can-do” attitude\nHands-on, detail-oriented, methodical & inquisitive\nA motivated self-starter with a solid level of experience that quickly grasps complex challenges.\nA skillful communicator with experience working with technical management teams.\nA strong customer focus and metrics driven.\nA quick learner with a passion to challenge him/herself outside of the comfort zone.\nFantastic collaborator, team player, negotiator, and influencer\nFast fail entrepreneurial and innovative spirit\nThrives in a fast-paced environment where continuous improvement is the norm and the bar for quality is extremely high.\nAdditional Information\nAll your information will be kept confidential according to EEO guidelines.", "employment_type": "FULL_TIME", "date_posted": "2021-08-20T07:26:22.000Z"}, "company": {"name": "Accolade, Inc.", "link": "https://www.linkedin.com/company/accolade-inc-"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 12, "seniority_level": "Junior"}}