{
    "job": {
        "title": "ServiceNow HRSD (HR Service Delivery) Developer/Architect",
        "industry": "Information Services,Information Technology and Services,Financial Services",
        "description": "Net2Source Inc. is an award-winning total workforce solutions company recognized by Staffing Industry Analysts for our accelerated growth of 300% in the last 3 years with over 5500+ employees globally, with over 30+ locations in the US and global operations in 32 countries. We believe in providing staffing solutions to address the current talent gap – Right Talent – Right Time – Right Place – Right Price and acting as a Career Coach to our consultants. Job Title: ServiceNow HRSD (HR Service Delivery) Developer/Architect100 % RemoteFull Time Hire / Permanent Job Description:Certified Implementation Specialist - HRSDServiceNow HR System Architecture - Plugins, HR Table Structure, Application ScopingConfigure and Implement ServiceNow Core HR Applications and Employee Service Center - Users, Groups, Skills, and Roles, Assignment Rules, HR Services, HR Catalog Items, and Record Producers, HR Service Portal BrandingUnderstand how to Configure Security Options to Protect HR DataGood Communication and presentation skills, Client handling.Java Scripting knowledge and hands on experience on it.Hands-on with ITIL Process implementation.Service-now for custom Application Design & Development.Hands-on technical delivery including required documentation of cost-effective Service-now solutions, Ability to create and Modify Workflows.Hands-on design, development and deployment experience with the Service-now platform.Hands-on migrating data from different tools into ServiceNow.Good at creating required information for Reporting and DashboardsKnowledge of ITIL methodologies and processes.Service now Implementation Specialist & AdminProject Management skillsCore module (Normal Incident, MIM, Problem, Knowledge, Change, ESS, CMS (optional))Good Communication and presentation skills, Client handling.Java Scripting knowledge and hands on experience on it.Hands-on with ITIL Process implementation.Service-now for custom Application Design & Development.Hands-on technical delivery including required documentation of cost-effective Service-now solutions, Ability to create and Modify Workflows.Hands-on design, development and deployment experience with the Service-now platform.Hands-on migrating data from different tools into ServiceNow.Provide technical direction for the development, design, and systems integration for client engagement from definition phase through implementation.Review work of development team.Create and execute development plans as appropriate to meet changing needs and requirements.Communicate and enforce coding standardsSubject Matter Expert on the Application Portfolio Management Capabilities and Technical Best PracticesContribute to the thought leadership of the Application Portfolio Management Communities of ExcellenceDevelop and utilize deep platform knowledge and expertise in:Workflow ConfigurationApplication UI ConfigurationDevelopment of client specific reporting and integration requirementsBe accountable to ensure Practice deliverables to GEO Customer Delivery and customers are complete, consistent, of high quality, on time and deliver benefitsContribute to the continual improvement of Global Delivery and Practice business processes as well as the maturing of the IT Business Management portfolio, capabilities, expertise, best practices and solutionsCoaching and mentoring of others and responsible for their career development, education and certification commensurate with the requirements of the practice strategy Why work with us - At Net2Source, we believe everyone has an opportunity to lead. We see the importance of your perspective and your ability to create value. We want you to fit in—with an inclusive culture, focus on work-life fit and well-being, and a supportive, connected environment; but we also want you to stand out—with opportunities to have a strategic impact, innovate, and take necessary steps to make your mark. We help clients with new skilling, talent strategy, leadership development, employee experience, transformational change management and beyond.  Equal Employment Opportunity Statement:Net2Source is an Equal Opportunity Employer. We believe that no one should be discriminated against because of their differences, such as age, disability, ethnicity, gender, gender identity and expression, religion or sexual orientation. Our rich diversity makes us more innovative, more competitive, and more creative, which helps us better serve our clients and our communities. All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law. Awards and Accolades: America's Most Honored Businesses (Top 10%) Awarded by USPAAC for Fastest Growing Business in the US12th Fastest Growing Staffing Company in USA by Staffing industry Analysts in the US (2020, 2019, 2020)Fastest 50 by NJ Biz (2020, 2019, 2020)INC 5000 Fastest growing for 8 consecutive years in a row (only 1.26% companies make it to this list)Top 100 by Dallas Business Journal (2020 and 2019)Proven Supplier of the Year by Workforce Logiq (2020 and 2019)2019 Spirit of Alliance Award by Agile1 2018 Best of the Best Platinum Award by Agile1 2018 TechServe Alliance Excellence Awards Winner 2017 Best of the Best Gold Award by Agile1(Act1 Group) Thanks & Regards Abhishek Kumar Sr. Technical Recruiter 201-365-4885abhishek@net2source.com",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T00:16:48.000Z"
    },
    "company": {
        "name": "Net2Source Inc.",
        "link": "https://www.linkedin.com/company/net2sourceinc"
    },
    "education": {
        "required_credential": ""
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Bridgewater",
        "region": "NJ",
        "postal_code": "08807",
        "street_address": null,
        "latitude": 40.593002,
        "longitude": -74.626434
    }
}