{
    "job": {
        "title": "ServiceNow ITOM Developer/Architect",
        "industry": "Information Services,Information Technology and Services,Financial Services",
        "description": "Net2Source Inc. is an award-winning total workforce solutions company recognized by Staffing Industry Analysts for our accelerated growth of 300% in the last 3 years with over 5500+ employees globally, with over 30+ locations in the US and global operations in 32 countries. We believe in providing staffing solutions to address the current talent gap – Right Talent – Right Time – Right Place – Right Price and acting as a Career Coach to our consultants. Role: ServiceNow ITOM Developer/Architect100% RemoteFull Time Hire / Permanent Job Description: ·        Lead ServiceNow Discovery and Service Mapping project·        Strong hands-on experience in optimizing discovery, tailoring patterns and development.·        Strong hands-on experience across multiple ServiceNow Discovery and Service Mapping projects involving a variety of enterprise and open-source application server, database, network and operating systems.·        Validating discovery results and troubleshooting as required·        Advise customers on ServiceNow ITOM best practices·        Assist with CMDB Processes and Best Practices·        Guide customer configuration/implementations of the ServiceNow ITOM Platform·        Provide documentation and updates to NYCHHC ServiceNow Technical Manager.·        Working with all other aspects of the CMDB·        Assist with working tickets in Teams queue Why work with us - At Net2Source, we believe everyone has an opportunity to lead. We see the importance of your perspective and your ability to create value. We want you to fit in—with an inclusive culture, focus on work-life fit and well-being, and a supportive, connected environment; but we also want you to stand out—with opportunities to have a strategic impact, innovate, and take necessary steps to make your mark. We help clients with new skilling, talent strategy, leadership development, employee experience, transformational change management and beyond.  Equal Employment Opportunity Statement:Net2Source is an Equal Opportunity Employer. We believe that no one should be discriminated against because of their differences, such as age, disability, ethnicity, gender, gender identity and expression, religion or sexual orientation. Our rich diversity makes us more innovative, more competitive, and more creative, which helps us better serve our clients and our communities. All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law. Awards and Accolades: America's Most Honored Businesses (Top 10%)Awarded by USPAAC for Fastest Growing Business in the US12th Fastest Growing Staffing Company in USA by Staffing industry Analysts in the US (2020, 2019, 2020)Fastest 50 by NJ Biz (2020, 2019, 2020)INC 5000 Fastest growing for 8 consecutive years in a row (only 1.26% companies make it to this list)Top 100 by Dallas Business Journal (2020 and 2019)Proven Supplier of the Year by Workforce Logiq (2020 and 2019)2019 Spirit of Alliance Award by Agile12018 Best of the Best Platinum Award by Agile12018 TechServe Alliance Excellence Awards Winner2017 Best of the Best Gold Award by Agile1(Act1 Group) Thanks & RegardsAbhishek KumarSr. Technical Recruiter201-365-4885abhishek@net2source.com",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T00:16:10.000Z"
    },
    "company": {
        "name": "Net2Source Inc.",
        "link": "https://www.linkedin.com/company/net2sourceinc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Bridgewater",
        "region": "NJ",
        "postal_code": "08807",
        "street_address": null,
        "latitude": 40.593002,
        "longitude": -74.626434
    }
}