{
    "job": {
        "title": "Senior QA Automation Engineer  (Java, Selenium, API)",
        "industry": "Entertainment,Broadcast Media,Online Media",
        "description": "Senior QA Automation Engineer&amp;nbsp;We are looking for a Senior QA Engineer to join the team. Are you interested in new media, social activities and television? We are developing the next generation of multimedia and cross-platform entertainment.&amp;nbsp;The team values software which exemplifies simplicity of design, maintainability and foundational robustness.&amp;nbsp;As a Senior QA Engineer, you are expected to think critically and ensure quality throughout the mobile automation system. The ideal candidate will work with developers, product managers, QA team members, and operations team members to ensure deliverables are timely and meet expectations. This role requires the ability to facilitate and manage mobile automation processes including code quality and making overarching technical decisions, as well as managing the QA Engineers already working in the automation team.&amp;nbsp;Responsibilities:  - Oversee Associate QA Engineers to ensure code pushed into the repository is high quality and reviewed.   \n  - Create tools that can make the manual and automation QA teams’ tasks more easily manageable.   \n  - Maintain and adjust the automation roadmap to complement the feature roadmap.   \n  - Work closely with the rest of the QA team to ensure most valuable automation coverage.   \n  - Additional other duties and responsibilities, as assigned.   \n  - Analyze and adjust automation architecture to make it scalable as more features are added, across several different platforms.   \n  - Create system so that tools are accessible as needed to the QA team and other teams, as needed.   \n  - Work with various engineering teams to integrate QA system with all available build systems.   \n  - Define the test automation framework, scripting and make sure the team is delivering them within expected timelines.   \n&amp;nbsp;Requirements:  - 4+ years of experience in advanced Java, Selenium, API automation.   \n  - Coaching, training, and mentoring QA engineers and ensuring that quality standards are met across the entire team (2-5 people).   \n  - Experience using Jenkins or similar CI/CD tools.   \n  - Ability to write/execute test cases/suites for multi-platform application software.   \n  - Experience with Postman, Charles Proxy, and/or Rest Assured.   \n  - Outstanding communication, organizational and interpersonal skills with both a technical and non-technical audience.   \n  - Work to consistently improve testing efficiency – including for regression testing.   \n  - BA/BS in computer science or any related technical field, or equivalent work experience.   \n  - Actively tested for defect across multiple platforms.   \n  - Knowledge of video technologies in both objective C and java.   \n  - Strong understanding of agile test tools and methodologies.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-20T00:12:12.000Z"
    },
    "company": {
        "name": "Cypress HCM",
        "link": "https://www.linkedin.com/company/cypress-hcm"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Senior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Burbank",
        "region": "CA",
        "postal_code": "91505",
        "street_address": null,
        "latitude": 34.171722,
        "longitude": -118.34709
    }
}