{
    "job": {
        "title": "C++ Submarine Sonar Applications Software Engineer",
        "industry": "Defense &amp; Space,Computer Software,Aviation &amp; Aerospace",
        "description": "Responsibilities to Anticipate:  - Develop robust and scalable software in C++ running Linux or UNIX operating systems on a variety of computing platforms using Agile development methods.   \n  - Design, implement, debug and problem solve Submarine Sonar Software Applications while providing feedback to other team members.   \n  - Help improve code quality by supporting software integration, verification, and code reviews.   \n  - Participate in brainstorming sessions and contribute ideas to our technology, algorithms, and products.   \n  - Work in a team environment with the product and design teams to understand end-user requirements, formulate use cases, and then translate that into a pragmatic and effective technical solution.   \n  - Dive into difficult problems and successfully deliver results on schedule along with other duties as assigned   \n   Qualifications you must have:  - Bachelor’s degree in Computer Science, Computer Engineering, Electrical Engineering, Mathematics, Software Engineering, or related STEM field.   \n  - Sonar domain knowledge   \n  - Signal Processing code development   \n  - 5 plus years of experience in Software Engineering to include:   \n  - Experience with C++ and Linux/UNIX and strong Object-Oriented Knowledge   \n  - The ability to obtain and maintain a DoD Security Clearance within in one year. U.S. citizenship is required as only U.S. citizens are eligible for a security clearance.   \n  - Experience developing software in a team-based development environment   \n   Qualifications we value:  - Broad software development experience, including unit testing, real-time, or working in a DoD environment   \n  - Experience in Agile development methods, including Scrum, automated testing and continuous integration   \n  - Strong problem solving ability   \n  - Self-starter and ability to lead development, integration and test activities   \n  - Familiarity with the following Software Tools: Version control tools (e.g. GitHub), Jenkins, Jira, Coverity, Valgrind   \n  - Master's Degree in Computer Science, Computer Engineering, Electrical Engineering, Mathematics, or Software Engineering",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T00:23:14.000Z"
    },
    "company": {
        "name": "Raytheon Missiles &amp; Defense",
        "link": "https://www.linkedin.com/company/raytheonmissilesanddefense"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Portsmouth",
        "region": "RI",
        "postal_code": "02871",
        "street_address": null,
        "latitude": 41.60228,
        "longitude": -71.247765
    }
}