{
    "job": {
        "title": "Registered Behavior Technician (RBT)",
        "industry": "",
        "description": "Who We Are at Sprout Therapy   Sprout Therapy is a tech-forward provider of in-home and online Applied Behavior Analysis (ABA) Therapy. Our mission is to provide personalized, technology-empowered care for the needs of children with autism in the environment best suited to help them grow and thrive — the home.   We’re dedicated to providing easily accessible, high-quality care to the children and families we serve. We’re rapidly growing our team — and looking for values-driven, diverse, caring professionals to help us improve the availability of autism care.   Description:   We are currently seeking qualified, dedicated and compassionate professionals to provide in-home Applied Behavioral Analysis (ABA) services to children, youth, and young adults with Autism Spectrum Disorder or other developmental disabilities who are in need of assistance to reduce challenging behaviors.   Behavior technicians are responsible for assisting Board-Certified Behavior Analysts (BCBAs) to implement behavior plans through in-home direct intervention. They will assist patients with day to day activities, monitor their behavior, record and collect data on patients' progress, and communicate with clients. Other duties may include clerical and administrative duties.   What You'll Do:     - Provide behavior intervention services to individuals diagnosed with Autism Spectrum Disorder and other developmental disorders in the home, school, and in the community   \n  - Implement behavior intervention and skill acquisition plans created by and under the supervision of a Board Certified Behavior Analyst (BCBA)   \n  - Collect and record data   \n  - Complete accurate treatment notes in a timely manner   \n  - Strictly follow BACB guidelines and codes of conduct   \n  - Attend team meetings   \n  - Motivate and encourage clients and staff   \n   What You'll Need:     - Minimum high school degree or equivalent, college preferred   \n  - Must pass background check   \n  - Reliable car, proof of auto insurance and valid driver's license required   \n  - TB test required   \n  - Bachelor's or enrollment in a B.A. or B.S program preferred   \n  - ABA experience preferred   \n  - RBT certification a plus   \n   Physical Requirements:     - Mindful and attentive to the safety of the client and surroundings   \n  - Sustained physical activity may be required for up to 60 minutes   \n  - Behavior therapy activities may require playing interacting with clients on the floor   \n  - Activities may involve walking, running, long periods of standing, kneeling, crawling, bending and lifting up to 50 pounds   \n   Who you are:     - Mission-driven:&amp;nbsp;You are dedicated to our mission and understand that providing excellent care to children with autism is at the core of everything we do.   \n  - Motivated:&amp;nbsp;You take ownership of your projects and are driven to produce the highest quality work product. You meet deadlines and communicate roadblocks. You look for opportunities to add value.   \n  - Creative:&amp;nbsp;You come up with original ideas to solve complex problems.   \n  - Collaborative:&amp;nbsp;You thrive in a team environment. You love listening to feedback and incorporating other people’s opinions into your ideas. You’re willing to work beyond your stated role for the better of the team.   \n  - Compassionate:&amp;nbsp;You care about people. You want others to succeed.   \n   What we offer:     - Flexible Hours   \n  - 10 Days of PTO   \n  - 10 paid National Holidays   \n  - Competitive Medical, Vision, Dental and Life Insurance   \n  - Opportunities for Internal Professional and Clinical Growth   \n  - Company Issued Hardware   \n  - Career Growth for BCBA certification & Supervision Hours   \n   The above job description is meant to describe the general nature and level of work being performed; it is not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required for the position.   Sprout Therapy is an equal opportunity employer that is committed to providing all employees with a work environment free of discrimination and harassment. We celebrate diversity and welcome applicants from every background and life experience.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T00:27:55.000Z"
    },
    "company": {
        "name": "Sprout",
        "link": "https://www.linkedin.com/company/sprout-therapy"
    },
    "education": {
        "required_credential": "associate degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Tampa",
        "region": "FL",
        "postal_code": "33675",
        "street_address": null,
        "latitude": 27.947424,
        "longitude": -82.45878
    }
}