{"location": {"country": "US", "locality": "Orlando", "region": "Orlando", "postal_code": "32889", "street_address": null, "latitude": 28.53833, "longitude": -81.378876}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Junior Software Engineer", "industry": "Information Technology and Services,Computer Software,Financial Services", "description": "Description\nJob Description:\nCome put your software engineering skills into action! The Leidos Defense Group has openings for talented junior Software Engineers to come join our team in Orlando, FL. In this role, you will join dynamic Agile software teams that are singularly focused on providing world class solutions to our customers in an exciting, collaborative, and inclusive environment. You will be challenged and provided a tremendous opportunity for growth in a customer-facing, fast-paced, and engaging environment.\nThese are some of the cool things you will be doing:\nDesign, develop, troubleshoot, and debug mission critical software source code using modern software development languages and tools, such as Java.\nParticipate in the full software development lifecycle, working within broadly defined parameters.\nUse Agile development tools such as Jira, Confluence, and BitBucket/Git to manage work and collaborate with your teams.\nSupport creation and updating of all relevant documentation and specifications for design, development and testing.\nIdentify potential roadblocks and develop around them.\nPlan and estimate development tasks and work to improve performance metrics.\nDevelop maintainable code that matches specification.\nDevelop automated tests leveraging a continuous integration process.\nOwn delivery of small parts of a system or application.\nTo be successful in this role you must have the following experience/skill sets:\nBachelor's degree and less than 2 years of experience in a relevant field.\nExperience with Java/C++ and object oriented programming (applicants will be tested).\nExperience with JavaScript and JS frameworks such as React.\nSolid understanding of software development process fundamentals.\nStrong, self-motivated desire to learn new programming languages, tools, frameworks, and techniques.\nRequires US citizenship and must be able to obtain a DoD Secret Security Clearance.\nYou'll wow us even more if you have any of the following:\nFamiliarity with basic web technologies including HTML, CSS, XML, REST, JSON, SOAP, and WSDL\nFamiliarity with web application technologies, such as Apache Tomcat, JBoss, etc.\nKnowledge of a version control system (e.g., Git).\nKnowledge of Agile Development methodologies.\nFamiliarity with multiple operating systems (Mac OSX, Windows, LINUX, etc.).\nFamiliarity with at least one Relational Database Management System (Oracle, MySQL, PostgreSQL, SQL Server, etc.).\nProficiency with MS Office Products (Word, Excel, Visio, & PowerPoint).\nFamiliarity with NoSql databases (MongoDB, etc.).\nFamiliarity with server-side JavaScript\nActive DoD security clearance.\nExternal Referral Bonus\nEligible\nExternal Referral Bonus $:\n$2,000\nPotential For Telework\nNo\nClearance Level Required\nNone\nTravel\nYes, 10% of the time\nScheduled Weekly Hours\n40\nShift\nDay\nRequisition Category\nProfessional\nJob Family\nSoftware Engineering", "employment_type": "FULL_TIME", "date_posted": "2021-09-02T05:24:00.000Z"}, "company": {"name": "Leidos", "link": "https://www.linkedin.com/company/leidos"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}