{
    "job": {
        "title": "Human Resources Assistant",
        "industry": "Aviation &amp; Aerospace",
        "description": "URGENT REQUIREMENT, URGENT HIRING   Job Title: HR Assistant (Onsite)Location: 669 Goodyear Street, Rockmart, GA 30153Duration: 6 Months contract (Potential Temp to Perm) Pay Rate: $15.00/hr. (Fixed)Shift Time: 1st shift - Schedule M-F 40hrs/Week   A HR Assistant job in Rockmart, Georgia is currently available through Belcan. In this role, you will Communicates effectively through phone, e-mail and correspondence, while maintaining a professional manner.   Description:  - Microsoft office - Word/Excel   \n  - Outlook - Capable of managing staffing inbox and calendar   \n  - Customer Service - comfortable speaking with candidates to schedule plant tours, follow up on requested documentation and filter questions.   \n   Job Designation:The Human Resources Assistant provides administrative support to the Human Resources Team, while aligning tasks with the team’s goals and business objectives. Acts as the first point of reference for all questions from staff and external customers,   Job Core Responsibilities:  - Provides administrative support to the Human Resources Team and acts as the first point of contact for all questions from staff and external customers   \n  - Communicates effectively through phone, e-mail and correspondence, while maintaining a professional manner   \n  - Maintains Human Resources database with current employee information and files employee records for the department   \n  - Supports the HR team to ensure that all Job descriptions are up to date and signed as part of the audit process   \n  - Assists in the recruitment process by distributing resumes, scheduling interviews and meetings as requested by Human Resources staff   \n  - Prepares new employee files and ensures that all required documentation is in the file for completeness   \n  - Provides administrative support for the team with copying, scanning and faxing activities   \n  - Carefully handles sensitive and confidential information/situations and documentation   \n  - Other responsibilities as assigned   \n  - Regular, consistent and punctual attendance is required. May need to work nights and weekends, variable schedule(s) and additional hours as necessary   \n   Job SpecificationsEducation: A Secondary Certificate/High School Diploma or equivalent combination of relevant education and work experience that will allow successful performance of job expectationsYear of Experience: 0 - 2 years or related experience   Skills:  - Knowledge in human resources processes and concepts   \n  - Excellent internal and external customer service skills   \n  - Strong attention to detail, good organizational skills and the ability to prioritize with changing situations   \n  - Ability to recognize and solve typical problems and select solutions from established options   \n  - Good interpersonal, verbal and written communication skills to drive tasks to completion   \n  - Proficient in Microsoft Office Suite",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-20T00:27:31.000Z"
    },
    "company": {
        "name": "Meggitt",
        "link": "https://uk.linkedin.com/company/meggitt-plc"
    },
    "education": {
        "required_credential": "high school"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Rockmart",
        "region": "GA",
        "postal_code": "30153",
        "street_address": null,
        "latitude": 34.003742,
        "longitude": -85.041405
    }
}