{
    "job": {
        "title": "Farsi Speakers - User Study",
        "industry": "Translation and Localization,Information Technology and Services,Retail",
        "description": "Welcome and thank you for your interest in working with&amp;nbsp;TransPerfect!   DataForce is a worldwide data collection and labeling platform that combines technology with a diverse network of more than one million data contributors, scientists, and engineers. DataForce offers companies in technology, automotive, life sciences, and other industries secure and reliable AI services for exceptional structured data and customer experiences.   DataForce is part of the TransPerfect family of companies, the world’s largest provider of language and technology solutions for global business with offices in more than 100 cities worldwide.&amp;nbsp;Currently, we are running a&amp;nbsp;on-site study&amp;nbsp;that will help improve&amp;nbsp;human movement recognition. We are looking for people of different backgrounds and ages (including children from 5 years old) + Adults with&amp;nbsp;Pets&amp;nbsp;+ Participants with&amp;nbsp;Cars.&amp;nbsp;During the study, participants will be video recorded performing basic movements such as walking, sitting, standing up, etc to help improve consumer electronic technology.&amp;nbsp;The test is currently running on-site at various locations throughout the&amp;nbsp;San Francisco Bay Area.&amp;nbsp;Compensation Options(via Check, PayPal, Wire transfer and Gift Card).&amp;nbsp;Adults (18+):- Single Participants will receive&amp;nbsp;$50&amp;nbsp;for a 30 minute session- Participants completing the study with a car will receive&amp;nbsp;$70&amp;nbsp;for 45 minute session- Participants completing the study with a pet will receive&amp;nbsp;$110&amp;nbsp;for a 1 hour session- Participants with both a pet and car will receive&amp;nbsp;$160&amp;nbsp;for a 1 hour sessionParents/Guardians of Children (age 5-17):-&amp;nbsp;Participants completing the study with a minor will receive&amp;nbsp;$175&amp;nbsp;for a 1 hour session.- Participants completing the study with a minor and a car will receive&amp;nbsp;$195&amp;nbsp;for 1 hour session- Participants completing the study with a minor and a&amp;nbsp;pet will receive&amp;nbsp;$215&amp;nbsp;for a 1 hour session- Participants completing the study with a minor, a pet, and car you will receive&amp;nbsp;$235&amp;nbsp;for a 1 hour session&amp;nbsp;Also, if you know someone who might be interested in participating, please help us spread the word by sharing this link. We are offering a&amp;nbsp;$10 referral bonus. *Make sure they list you as a referral when they complete the registration.&amp;nbsp;&amp;nbsp;IMPORTANT:&amp;nbsp;All your data will be kept confidential and access to it will be limited to those who conduct the study.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-20T00:27:26.000Z"
    },
    "company": {
        "name": "TransPerfect",
        "link": "https://www.linkedin.com/company/transperfect"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "San Jose",
        "region": "CA",
        "postal_code": "95148",
        "street_address": null,
        "latitude": 37.334793,
        "longitude": -121.888145
    }
}