{"location": {"country": "US", "locality": "Atlanta", "region": "Atlanta", "postal_code": "30355", "street_address": null, "latitude": 33.748547, "longitude": -84.3915}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Lead Site Reliability Engineer (REMOTE)", "industry": "Information Technology and Services,Computer Software,Financial Services", "description": "If you are a Lead Site Reliability Engineer looking for fully remote work, please read on!\nWe are a publicly traded, leading industrial technology company with roots in North America and Europe, along with a team of 12k+ employees. We're on a quest to become the #1 company in our sector and are looking for someone to Lead our new SRE Team to build fault tolerant systems and reliable software to help us design, deploy, scale, and maintain highly available distributed sensory networks and companion cloud applications.\nWhat You Will Be Doing\nDevelop applications from customer services side/liability - that gear towards application transactions and less in application infrastructure\nIncident response and problem management towards application development and monitoring\nContribute to a light amount of application development, working very closely with development teams on reliability / observability.\nProvide reasoning about application architecture as well as be comfortable looking at code and offering feedback on how it can be improved to increase reliability.\nParticipate and lead incident resolution efforts and subsequent postmortems.\nWork laterally with our other engineering teams to identify root causes, characterize and track problems and collaborate to address them\nDefining required performance and expected load, taking actions to address disruptions and monitoring operation.\nWhat You Need for this Position\n5+ years working experience using either one: Python, C++, Java, Go, or C#\nGood blend of Software Development + Operations (DevOps)\nAzure (deploying / operating solutions)\nIncident response and problem management\nDocker/Kubernetes\nBonus Points For\nExperience leading small teams\nIoT (Internet of Things) networks\nKubernetes, Terraform\nExperience with highly available distributed systems at scale.\nWhat's In It for You\nFully REMOTE\nHUGE room for growth\nCompetitive pay + up to 20% bonus + Generous benefits (Health, Dental, Vision, Life, AD&D, HSA Accounts)\nStock purchase Plans\nHealthy work/life balance\nSo, if you are a Lead Site Reliability Engineer looking for a change - please apply today - INTVs are being scheduled!\nEmail Your Resume In Word To\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nBobby.June@Optello.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : BJ1-1640247 -- in the email subject line for your application to be considered.***\nBobby June - Recruiting Manager - Optello\nApplicants must be authorized to work in the U.S.\nOptello is proud to be an Equal Opportunity Employer\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\nYour Right to Work\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.", "employment_type": "FULL_TIME", "date_posted": "2021-08-06T17:46:32.000Z"}, "company": {"name": "Optello", "link": "https://www.linkedin.com/company/optello-us"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}