{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "",
        "description": "Machine Learning Engineer - Aliso Viejo, CAAWM Smart Shelf is reinventing retail and looking for smart, talented people to work on building exciting applications. The initial focus of this position is working on AWM Frictionless which is a cashierless-shopping solution for shoppers to be able to grab what they want from a store and simply walk out.Our solution uses real-time computer vision and deep learning to determine what shoppers take. We're looking for a Machine Learning Engineer to run with the selection, training, and evaluation of our item and action recognition models.If your ML background is not in image processing, but something like NLP or finance, you may still be a great fit! We’re looking for nimble, practical problem solvers and we value a diversity of perspectives.We tinker, experiment, and hack on many different approaches and love people who aren't afraid to jump around. A successful Machine Learning Engineer will rapidly iterate – failing fast to identify the most promising paths forward.If this sounds like fun, we'd love to hear from you!THE JOBImplement machine learning models for item classification and action recognitionAbility to evaluate model performance and monitor the training processAdapt existing models to better handle problems specific to our domainIntegrate models into our production pipeline for real-time processingTest cutting-edge models on our custom datasetsWHO YOU ARESomeone who executes – a focus on action and results - can self-manage to timelines and deliverPractical coding knowledge (Python preferred) to quickly iterate on training and testing modelsUnderstanding of CNNs and the tradeoffs of different architecturesKnowledge of best practices in machine learningNICE TO HAVE (but not mandatory)Experience with video dataExperience with distributive training in the cloudExperience with sequence modelingRelevant education in an undergraduate or graduate programWHAT WE OFFERA dynamic environment where you can make an impact using the latest technologiesPaid vacation and sick timeHealth benefitsOpportunity for growth401k planPotential for employee stock option plan participation**PLEASE APPLY TO BE CONSIDERED**",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-19T18:52:16.000Z"
    },
    "company": {
        "name": "AWM Smart Shelf",
        "link": "https://www.linkedin.com/company/awm-smart-shelf"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Aliso Viejo",
        "region": "CA",
        "postal_code": "92656",
        "street_address": null,
        "latitude": 33.569595,
        "longitude": -117.72637
    }
}