{"location": {"country": "US", "locality": "Baltimore", "region": "Baltimore", "postal_code": "21226", "street_address": null, "latitude": 39.290443, "longitude": -76.612335}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Research Associate", "industry": "Biotechnology", "description": "At Pacific Biosciences (NASDAQ: PACB), we are passionate about developing high-quality, innovative technologies and systems that impact areas of critical importance, including human biomedical research, plant and animal sciences, and microbiology and infectious disease studies. Our unique long-read gene sequencing technology generates complete and accurate data, giving scientist more insights. We believe our tools will lead to advances that will create long-lasting benefits for the world and its future.\nThis is an entry level position in which the applicant's primary responsibility will be to support the development and commercialization of PacBio technologies including Nanobind, Short Read Eliminator, and PicoSep. This work will involve significant exposure to various next-generation sequencing platforms, in particular long-read sequencing technologies. Applicants that show a high degree of independence and aptitude can be expected to gain responsibility quickly and acquire new opportunities.\nSpecific responsibilities include:\nSupporting development of Nanobind sample preparation technology\nValidation of extraction chemistries across diverse sample types and extraction conditions\nCharacterization of extracted nucleic acids using spectroscopy, gel electrophoresis, capillary electrophoresis, restriction digests, qPCR, and qRT-PCR, and long-read sequencing\nManufacturing, kitting, QC, and shipping of commercial products\nApplication development using sequencing, PCR, RT-PCR, cloning, etc\nCare and maintenance of mammalian and bacterial cell culture\nDesired skills:\nAseptic technique and maintenance of human, bacterial, and yeast cell cultures\nExperience with molecular biology techniques including UV and fluorescence spectroscopy, qPCR and qRT-PCR, agarose and pulsed field gel electrophoresis, and cloning\nExperience in sample preparation techniques incorporating spin columns, magnetic particles, and precipitation\nExperience in sequencing and library preparation is a plus\nExperience in genetics and epigenetics analysis is a plus\nApplicants don't need to have all the desired skills but should demonstrate eagerness and ability to learn new techniques as necessary\nAnything else to help the company grow and expand!\nBachelor's or Master's degree in related engineering field, biological sciences, or chemical sciences.\nAll listed tasks and responsibilities are deemed as essential functions to this position; however, business conditions may require reasonable accommodations for additional tasks and responsibilities.\nAll qualified applicants will receive consideration for employment without regard to race, sex, color, religion, national origin, protected veteran status, or on the basis of disability, gender identity, and sexual orientation.", "employment_type": "FULL_TIME", "date_posted": "2021-08-30T23:52:17.000Z"}, "company": {"name": "Pacific Biosciences", "link": "https://www.linkedin.com/company/pacific-biosciences"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}