{"location": {"country": "US", "locality": "Seattle", "region": "Seattle", "postal_code": "98133", "street_address": null, "latitude": 47.60323, "longitude": -122.33028}, "salary": {"currency": "USD", "min_value": 113000, "max_value": 150000, "unit": "YEAR"}, "job": {"title": "Data Scientist", "industry": "Computer Software,Information Technology and Services,Internet", "description": "Description\nThe Amazon Fire TV Team is looking for a passionate and solution oriented Data Scientist to help redefine and build new, science-driven experiences for customers enjoying Fire TV across the world.\nA day in the life\nAs a key member of the team, you will provide machine learning expertise that helps accelerate the business. You will build various data and machine learning models that help us innovate different ways to enhance the customer experience. You will need to be entrepreneurial, wear many hats, and work in a highly collaborative environment across engineer, product, marketing and BI. We like to move fast, experiment, iterate and then scale quickly, thoughtfully balancing speed and quality.\nAbout The Hiring Group\nThe Amazon Fire TV Team is looking for a passionate and solution oriented Data Scientist to help redefine and build new, science-driven experiences for customers enjoying Fire TV across the world.\nJob responsibilities\nThe Amazon Fire TV Team is looking for a passionate and solution oriented Data Scientist to help redefine and build new, science-driven experiences for customers enjoying Fire TV across the world.\nAs a key member of the team, you will provide machine learning expertise that helps accelerate the business. You will build various data and machine learning models that help us innovate different ways to enhance the customer experience. You will need to be entrepreneurial, wear many hats, and work in a highly collaborative environment across engineer, product, marketing and BI. We like to move fast, experiment, iterate and then scale quickly, thoughtfully balancing speed and quality.\nAn ideal candidate will be an expert in the areas of machine learning and statistics who will have expertise in applying theoretical models in an applied environment. The candidate will be expected to work on numerous aspects of Machine Learning such as feature engineering, predictive modeling, probabilistic modeling, hyper-parameter tuning, scalable inference methods and reinforcement learning. We deal with HUGE volume of data, including clickstream, Alexa, Prime Video, and retail, so challenges will involve dealing with very large data sets and requirements on throughput.\nResponsibilities Include\nDesign, implement, test, deploy, and maintain innovative data and machine learning solutions to accelerate our business.\nCreate experiments and prototype implementations of new learning algorithms and prediction techniques\nCollaborate with scientists, engineers, product managers, and stockholders to design and implement software solutions for science problems\nUse machine learning best practices to ensure a high standard of quality for all of the team deliverables\nProficiency in model development, model validation and model implementation for large-scale applications\nAbility to convey mathematical results to non-science stakeholders. Strength in clarifying and formalizing complex problems\nSuperior verbal and written communication and presentation skills, ability to convey rigorous mathematical concepts and considerations to non-experts\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.\nBasic Qualifications\nBachelor's Degree\n3+ years of experience with data scripting languages (e.g SQL, Python, R etc.) or statistical/mathematical software (e.g. R, SAS, or Matlab)\n2 years working as a Data Scientist\n2+ years of experience of building machine learning models for business application\nExperience programming in SQL, C++, Python or related language\nBachelor’s degree in math, statistics, computer science, or finance or equivalent experience.\n5+ years of professional experience in data modeling / advanced business analytics\nExperience in ETL and databases in a business environment with large-scale, complex datasets\nKnowledge of SQL and experience with efficient processing of large data sets\nKnowledge of columnar databases like Redshift; Understand database optimization\nExperience in designing and building data infrastructure/automated reporting tools (Tableau)\nExperience in advanced business/customer analytics\nExperience conveying key insights from complex analysis in summarized business terms\nPreferred Qualifications\nMaster's degree in Computer Science, Machine Learning, Operational Research, Statistics or a related quantitative field\n7+ years of hands-on experience applying theoretical models in an applied environment\nExtensive knowledge and practical experience in several of the following areas: machine learning, statistics, deep learning, Natural Language Processing, recommendation systems, dialogue systems, informational retrieval\nSignificant peer reviewed scientific contributions in premier journals and conferences\nStrong CS fundamentals in data structures, problem-solving, algorithm design and complexity analysis\nExperience with defining research and development practices in an applied environment\nProven track record in technically leading and mentoring scientists\nCompany\n- Amazon.com Services LLC\nJob ID: A1627020", "employment_type": "FULL_TIME", "date_posted": "2021-07-09T13:33:48.000Z"}, "company": {"name": "Amazon", "link": "https://www.linkedin.com/company/amazon"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 84, "seniority_level": "Senior"}}