{"location": {"country": "US", "locality": "New York", "region": "New York", "postal_code": "10132", "street_address": null, "latitude": 40.713047, "longitude": -74.00723}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Senior Software Engineer, Backend (Junior to Senior)", "industry": "Computer Software", "description": "We have the benefits of large company revenue but operate like a nimble startup with very little Engineering attrition (and over the course of a decade no less)! We have offices in Los Angeles, Seattle & NYC should you want to be onsite post covid but are 100% HAPPY to hire REMOTE! Currently, we are working with top brands in the world to evolve online marketing engagements. With more of a direct communication platform, we are creating a stronger consumer experience in hot industries such as music, sports, and gaming.\nWhat You Will Be Doing\nIn This Job, You Will\nÏ Develop the state of the art, scalable technology\nÏ Be an active and engaged owner of the product and customer experience, collaborating\neffectively with Product Management, Data Engineering, Data Science, and other disciplines\nÏ Maintain high standards of code quality, including tests and documentation, and encourage\nthe same by providing constructive code reviews to collaborators\nÏ Work closely with other engineers to investigate design approaches, prototype new\ntechnology and evaluate technical feasibility of new features\nÏ Manage multiple competing priorities in a fast-paced, exciting environment\nÏ Troubleshoot and resolve issues, problems, and errors encountered across our various\nendpoints\nWhat You Need for this Position\nQualifications\nÏ Bachelors Degree in Computer Science or equivalent experience in the software\ndevelopment field\nÏ 5+ years of complete software lifecycle experience\nÏ Proven experience with Ruby, Scala, Rust, Golang or NodeJS and/or other modern languages\nÏ Prior experience delivering highly resilient, distributed services on cloud infrastructures\nÏ Experience working with AWS services like EC2, Kinesis, DynamoDB, S3, etc.\nÏ Experience working in Agile teams\nÏ Great team player with can do attitude and sterling sense of ownership\nWhat's In It for You\n100% company-paid health, dental, and vision coverage for you and your dependents, as well as life insurance and disability coverage\nUnlimited PTO\nOpportunities for profit sharing, bonuses, and ownership\n401(k) plus match\nCell phone reimbursement and subsidized gym membership\nAnnual professional development stipend\nSo, if you are a Senior Software Engineer with Backend experience, please apply today!\nEmail Your Resume In Word To\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nRajeev.Peterson@CyberCoders.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : RP6-1629395 -- in the email subject line for your application to be considered.***\nRajeev Peterson - Sr. Executive Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\nYour Right to Work\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\nCyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.", "employment_type": "FULL_TIME", "date_posted": "2021-07-09T17:42:54.000Z"}, "company": {"name": "CyberCoders", "link": "https://www.linkedin.com/company/cybercoders"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}