{"location": {"country": "US", "locality": "Greater St. Louis", "region": "Greater St. Louis", "postal_code": "63101", "street_address": null, "latitude": 38.62262, "longitude": -90.192986}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Site Reliability Engineer", "industry": "Information Technology and Services", "description": "Applicant must be located in St. Louis, MO. Some remote work is okay, but candidate must be able to come to the office for meetings and other on-site requirements.\nThe Site Reliability Engineer (SRE) is key role within the client company. They provide a SaaS Order Management System (OMS) that is used by top name-brand retailer across the globe. The SRE Lead will be responsible for ensuring that the company’s solutions are functioning at peak performance 24x7.\nOur client is a fast growing and dynamic company looking for an SRE leader to take them to the next level. The role will focus on ensuring that cloud deployed solutions are running at peak performance and optimally using the cloud to provide rock-solid reliability. The role is also responsible for engaging closely with the engineering team to ensure that there is an efficient and reliable CI/CD process producing high-quality code on a predictable cadence. They are looking for a leader who thrives in a fast-paced, high-growth, team-focused environment where everybody makes a difference every day.\nThe Successful Candidate Should Have the Following Skills & Experience:\nBachelor’s Degree in Computer Science (Master’s Degree preferred).\n5+ years of experience in a development role with lead or architect experience.\n2-3 years hands-on experience with cloud technology architecture and web application deployment models (Azure experience preferred).\n3-5 years as a senior developer or application architect.\nExperience with enterprise level system monitoring tools (e.g., Datadog).\nUnderstanding of major CI/CD approaches.\nCommand of automation technologies and tools.\nHighly innovative with a drive for operational excellence.\nHighly collaborative but not hesitant take ownership and move fast.\nStrong desire to be part of a highly dynamic and talented technology team!\nAbility to provide emergency support 24/7 if required.\nPrimary Responsibilities include the following:\nOperational Health & Automation- uptime, performance, redundancy, fault-detection.\nDeploy and manage tooling to monitor Azure based production systems relative to performance, reliability, and scale.\nEnsure that architecture and deployment models are sufficient to support SLA commitments.\nLeverage cloud technology and platform capabilities to provide operationally sustainable solutions that are robust and cost effective.\nProvide regular updates and recommendations to Sr Leadership on health and performance of production systems.\nCI/CD Environment\nWork with development team and build process to ensure tools and automation is in place to ensure reliable and quality code deployments.\nEstablish a CI/CD framework through tight engagement with engineering team.\nEngage with QA team to establish and manage an automated test framework.\nProvide regular updates and recommendations to Sr Leadership regarding reliability and effectiveness of the CI/CD environment.\nSupport Team Tooling & Automation\nEngage with product support team to identify and provide self-service tooling and automation that drive efficiencies, scale, and overall customer experience.", "employment_type": "FULL_TIME", "date_posted": "2021-07-29T16:04:44.000Z"}, "company": {"name": "VantageLinks, LLC", "link": "https://www.linkedin.com/company/vantagelinks-llc"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}