{"location": {"country": "US", "locality": "Columbus", "region": "Columbus", "postal_code": "43272", "street_address": null, "latitude": 39.96276, "longitude": -82.99629}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Junior Software Engineer", "industry": "Information Technology and Services", "description": "Purpose of Positions\nWorks on a team developing, testing, debugging, and supporting new software or enhancements to existing software in support of a very complex business model. Role includes meeting with customers to understand their business processes and needs with the objective of determining solutions to support the business. This will sometimes require filling multiple roles to turn the customer's needs into actual solutions. Takes initiative, owns issues from start to finish, proactive communicator. Daily activities include typical software development activities (developing, testing, debugging, supporting).\nGeneral Tasks and Responsibilities\nSoftware analysis activities for new software or enhancements to existing software to include providing high level estimates based on limited information in support of the project governance process.\nSoftware development activities for new software or enhancements to existing software.\nSupport of new and existing software.\nInteraction/communication with business users regarding requirements, design reviews, prototype presentations, etc. This position may or may not manage employees based on location of incumbent.\nEducation\nBachelor's in Computer Science\nCertifications and Licenses\nYears of Experience\n0-3 years of experience\nCore Competencies\nAdaptability\nCollaboration\nStrives for Positive Results\nService-Oriented", "employment_type": "FULL_TIME", "date_posted": "2021-07-29T14:29:20.000Z"}, "company": {"name": "Brooksource", "link": "https://www.linkedin.com/company/brooksource"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}