{"location": {"country": "US", "locality": "Boston", "region": "Boston", "postal_code": "02118", "street_address": null, "latitude": 42.358994, "longitude": -71.05863}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer", "industry": "", "description": "Location:\nBoston, MA (100% Remote)\nJob Type:\nFull-time Emplyment (FTE)\nONCE IN A LIFETIME FULL-TIME JOB OPPORTUNITY FOR SOFTWARE ENGINEERS\n!\nOur\ndirect\nclient is currently searching for all levels of Software Engineers from 3-20+ years of experience. (Mid-Level, Senior, Principal, Technical Lead, Architect)\nBase Salary: $150,000-$250,000+ per year\n100% REMOTE (Headquartered in Boston)\nUNLIMITED PTO\nRSU's available! (Restricted Stock Units)!!\nJob Details:\nWildly successful and rapidly growing client is building and maintaining cutting-edge E-Commerce platforms from the ground up comparable to the likes of Facebook, Twitter, UBER, Amazon, WAYFAIR, and more. There are many concurrent projects going on with teams of proven experts, and now they're looking for additional top talent to bolster their growing teams to keep up with increasing demand!\nClient is an extremely well-funded E-Commerce company currently valued at $15B.\nCritical Backgroung We’re Looking For:\nExperience from a fast-moving e-commerce software firm (start-ups okay)\nExperience with areas like shopping cart, logistics, consumer experience, data warehousing, supply chain management, fulfillment, storefront design, code internationalization and more.\nExperienced in multiple technology stacks (not looking for strictly .NET of Java folks)\nPrimary languages include Javascript’Tyoscript & Java Microservices (not J2EE)\nDesired IU Libraries: React Native and Graphql, but all are welcome\nDesired back-end technologies include: Micronaut, Dropwizard and Spring Boot (in that order), a mix of the above would be ideal.\nA passion for software design/development - any and all languages are welcome, they use predominantly Java, go, kubernetes, react, etc.\nAny experience with Golang is a bonus!\nOur client is definitely not a start-up, but they love people who have lived and learned from them and bring that collaborative mentality and passion along with them to get stuff done!\nPlease Contact:\nChris Thelen – VP of Sales\nGrowe Technologies, Inc.\nPhone: 612-619-3092\nEmail: cthelen@growetech.com", "employment_type": "FULL_TIME", "date_posted": "2021-08-18T18:03:54.000Z"}, "company": {"name": "Growe Technologies, Inc.", "link": "https://www.linkedin.com/company/growe-technologies"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}