{"location": {"country": "US", "locality": "San Francisco", "region": "San Francisco", "postal_code": "94121", "street_address": null, "latitude": 37.78008, "longitude": -122.42016}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer, Frontend", "industry": "Information Technology and Services,Computer Software,Internet", "description": "Magic is an early stage, fast-growing challenger to transform the antiquated user identity space by eliminating the need for passwords, with backing from top investors such as Lightspeed Ventures, SV Angel, Social Capital, Placeholder, and Naval Ravikant. We’re looking for an exceptional new team member to own the recruiting pipeline and help scale Magic into a household name for developers worldwide.\nOur mission is to safeguard the trust between users and Internet services by establishing secure and authentic digital identity. Magic’s vision is to build the passport of the internet. We are seeking team members who are not afraid to push beyond the status quo and create the simplest, most secure, and most long-term sustainable identity solution for app developers and end-users.\nWe are looking for a Frontend Engineer who will help us disrupt the world of authentication and radically simplify how developers implement passwordless authentication in their applications - uncompromising on user-experience, reliability, and security.\nYou should be able to build high-quality, innovative and performant web experiences that delight users. We are pursuing a vision of bringing about a more authentic internet, and are not afraid to embrace the very real challenges that must be overcome in order to achieve it. We’re big dreamers but also pragmatists. As such, we rely on state-of-the-art web technologies to build products that exist nowhere else in the industry today.\n\"Any sufficiently advanced technology is indistinguishable from magic.\" - Arthur C. Clarke\nRequirements\nIn this role, you will\nEmpathy with customers, developers, and users who rely on our services\nA passion for improving developer experience and reducing user friction\nAttention to detail and the creativity to bring static mock-ups to life\nKnowledge of security best practices, especially the pitfalls that come with developing secure applications for the web\nAn ability to write well-designed, testable, and efficient code while balancing feasibility with ambition\nKnowledge and expertise in following the Agile Software Development Life Cycle\nStrong opinions, loosely held\nWe are looking for someone who has\nIdeally 1+ years experience of working within an agile software development team\nExperience in ES6+ JavaScript (Bonus points for TypeScript experience)\nExperience in CSS (Bonus points for CSS preprocessors like LESS or SCSS)\nExperience with React, (Bonus points for React Hooks, and Redux)\nStrong interpersonal skills that demonstrate empathy and the ability to distill technical concepts into digestible pieces\nBonus\nStrong technical writing skills\nExperience developing open source software and developer tools\nKeen awareness of application security, and knowledge of Open Web Application Security Project (OWASP) top 10 vulnerabilities\nMagic is remote-friendly, though we would prefer this role specifically to be in a timezone where we can have more hours overlap with the North American team members due to the need for frequent communication and collaboration.\nAt Magic, we're looking for team players with passion, empathy, perseverance, and integrity. You're encouraged to apply to this position, even if your experience doesn't precisely match the job description. Your talent and merits will stand out. At Magic, we welcome diverse perspectives and people who aren't afraid to challenge assumptions and the status quo.", "employment_type": "FULL_TIME", "date_posted": "2021-08-08T06:06:01.000Z"}, "company": {"name": "Magic", "link": "https://www.linkedin.com/company/magiclabs-inc"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 12, "seniority_level": "Junior"}}