{"location": {"country": "US", "locality": "South Bend", "region": "South Bend", "postal_code": "46619", "street_address": null, "latitude": 41.675034, "longitude": -86.25196}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Scientist", "industry": "Information Technology and Services", "description": "Who We Are\nAunalytics\nprovides a leading-edge cloud platform, where businesses run their core applications on secure, high performance computing infrastructure, create integrated data-marts using enterprise analytics software, and gain on-demand access to technology and data science experts to develop algorithms that drive digital transformation.\nPosition Overview\nAs a member of the Data Science team, you will help client companies leverage massive amounts of disparate data to solve their toughest problems and arrive at data-driven answers with greater speed and accuracy. You will work with clients to develop customized algorithms that are used to answer their most pressing business questions—providing insights that increase their ROI.\nEssential Duties & Responsibilities:\nUse Machine Learning and AI to model complex problems, discover insights, and identify opportunities\nIntegrate and prepare large, varied datasets; architect specialized database and computing environments; and communicate results\nDevelop experimental design approaches to validate finding or test hypotheses\nSolve client analytics’ problems and communicates results and methodologies in an easy to understandable manner\nResearch new approaches/methods to improve, optimize, and test targeted questions\nWork closely with business analysts to gain an understanding of client business and problems\nAdditional duties as assigned to ensure client and company success\nRequired Skills:\nM.S., or PhD in a quantitative discipline: computer science, statistics, operations research, applied mathematics, engineering, mathematics or related quantitative fields\nProficient in programming environment and languages such as: Node.js, Python, R, Javascript, SQL, and deep knowledge of analytic packages available for above languages\nPrior research or development experience working with data, solving problems with data, and experience building advanced analytic models\nStrong working knowledge of machine learning and statistics\nAbility to communicate your ideas (verbal and written) so that team members and clients can understand them\nAbility to defend your professional decisions and organize proof that your ideas and processes are correct\nResourceful in getting things done, self-starter, productive working independently or collaboratively – ours is a fast-pace entrepreneurial environment with performance expectations and deadlines\nInquisitiveness and an eagerness to learn new technologies and apply concepts to real world problems\nShare our values:  growth, relationships, integrity, and true grit\nWhat's in it for You?\nOpportunity to work with a rapidly expanding tech company in the booming field of data science and cloud computing, alongside some of the brightest minds in the industry\nOpportunity to work with cutting-edge technology in a casual, fun environment\nOpportunity to be a part of a local company committed to making a difference in our community\nChance to work with a rapidly expanding tech company\nFlexible schedule and paid time off\nFree snacks and an unlimited supply of coffee\nSocial events such as happy hours, game nights, holiday parties, birthday celebrations, movie days, ice cream sundae bars, fancy coffee carts, company softball team, etc.\nCompetitive salary and benefits package including health, vision, dental, and life insurance", "employment_type": "FULL_TIME", "date_posted": "2021-08-23T14:01:37.000Z"}, "company": {"name": "Aunalytics", "link": "https://www.linkedin.com/company/aunalytics"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}