{"location": {"country": "US", "locality": "United States", "region": "United States", "postal_code": "99999", "street_address": null, "latitude": 39.50355, "longitude": -99.0183}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Machine Learning Engineer", "industry": "", "description": "Senior Machine Learning Engineer @ Foxy AI\nRemote · Full Time\nWe are a passionate team solving the most fundamental problems in real estate, using AI to paint a complete picture of the home, from the ground up.\nJob Description\nWHO WE ARE LOOKING FOR\nFoxy AI is looking for a Senior ML Engineer that is eager to build computer vision and ML models for real estate. Foxy AI uses cutting-edge artificial intelligence and computer vision to convert everyday real estate photos into treasure troves of data. Our models help investors, startups, and public companies streamline workflows and improve quality assurance, generate new insights, and sharpen the accuracy of Automated Valuation Models (AVMs). This is an opportunity to get on the ground floor with a fast-paced team delivering revolutionary solutions to a long-established industry.\nConsulting with our ML advisor, you will own our ML pipeline, an integral piece of the product. You will be responsible for building and productionizing new models from the ground up as well as expanding upon existing models. You must have the ability to implement models in production to solve actual business problems. You must have a comfortable understanding of Docker, and Dockerizing microservices on GPUs, interacting with our frontend React code, optimizing our pipelines, and deploying and maintaining on AWS.\nWe're a small team so wearing many hats is necessary, and we are looking for somebody who is both excited by the possibility of stepping into a new machine learning startup as a self-starter and a quick learner. As the team grows, you will help recruit junior engineers and be responsible for managing those on your team. The candidate would not only be a part of development, but an integral part of the team, contributing to ideas and IP of a web-scale Computer Vision application. Everyone on the engineering team contributes to the full product vision.\nYou should absolutely love what you do.\nCANDIDATE MUST HAVE\nThe candidate must have the ability to implement deep learning algorithms in production to solve actual business problems.\nIdeally 5+ years of experience with deep learning and computer vision. Experience with application in a product that has been commercialized.\nThe ability to think at a high level about product strategy and vision.\nSelf-motivated and able to efficiently run with a project without close supervision.\nThe ability to research and develop novel algorithms to solve cutting edge computer vision problems, such as semantic segmentation, object recognition, image/video understanding, product recommendation, Approximate Nearest Neighbor/ KNN indexes, photogrammetry, and SLAM.\nStrong background in applied mathematics, statistics and probability.\nDeep familiarity with latest Deep Learning and Computer Vision techniques and libraries.\nDeep familiarity with Python.\nDeep familiarity with AWS, AWS Sagemaker, and Docker.\nDeep familiarity in handling and processing images.\nComfortable with the popular deep learning frameworks like pytorch, tensorflow, and keras.\nStrong skills in written and verbal communication of technical concepts.\nExperience with LiDAR, AR, and 3D modeling is a plus.\nJOB RESPONSIBILITIES\nIdentify, acquire, generate, process and/or prepare relevant datasets.\nResearch and develop AI/DL/ML algorithms to solve challenging computer vision tasks\nValidate algorithms and/or models in a mathematically disciplined and statistically meaningful manner.\nProductionize algorithms to solve business problems.\nDevelop clear, commented and understandable code for integration into production systems.\nDefine and document effective domain specific methodologies.\nGenerate and present analysis results and reports tailored to target audience (scientists, software engineers, business strategists, investors, etc.).\nCollaborate with fellow scientists and software engineers.\nCollaborate with fellow product engineers to put the AI model in product pipeline and implementation.\nWhat We're Building\nFoxy solves critical pain points in real estate by turning property photos into treasure troves of data. Our suite of AI-powered real estate tools, available through our API, can instantly compute quality and condition, renovation costs, detect objects and materials, and more. These tools help solve crucial problems in every aspect of the real estate business.\nwww.FoxyAI.com", "employment_type": "FULL_TIME", "date_posted": "2021-07-15T14:30:02.000Z"}, "company": {"name": "Foxy AI", "link": "https://www.linkedin.com/company/foxy-ai"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}