{"location": {"country": "US", "locality": "Los Angeles", "region": "Los Angeles", "postal_code": "90101", "street_address": null, "latitude": 34.05224, "longitude": -118.24335}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Engineer", "industry": "Information Technology and Services", "description": "Cloud Data Engineer\nAre you an experienced data engineer looking for a new challenge? SGI is helping a respected company recruit a Cloud Data Engineer. This is a remote, contract role!\nIf you were already working in this IT Management role, here are some of the things you would have done this week:\nCreate scalable ETL and reporting solutions\nReview, analyse, and evaluate the scope of business problems\nDevelop ETL and data warehousing solutions\nEnsure data integrity, performance quality, and resolution of data load failures\nCreate detailed technical specification\nTo succeed in this data capture position, you should be proficient in HDFS, HBase, YARN, SPARK, Oozie, and shell scripting and have a background in all aspects of software engineering with good skills in parallel data processing, data flows, REST APIs, JSON, XML, and microservice architecture. You will also need:\nExperience in RDBMS technologies and concepts\nExperience working with Teradata, Netezza, Oracle, DB2 databases\nAn understanding of File Formats - ORC, Parquet, Avro File formats\nProgramming/scripting experience skills - UNIX shell, Python, Perl, and JavaScript\nExperience working on large data sets with performance tuning and troubleshooting\nOther essential attributes include knowledge of Spark, Spark Streaming, Spark SQL, and Kafka, experience working with Databricks, Snowflake, Big Query, or Red Shift and as a data engineer, excellent communication skills, and the ability to work independently.\nIf this remote Cloud Data Engineer job excites and motivates you, please apply with SGI today.\nAward-Winning International Recruitment Specialists Source Group International - bring together 3 recruitment businesses within Technology & Life Sciences. As a business, we believe in doing better every day. It's who we are; it's what unites us. Our inclusive and collaborative culture, commission structure, incentives, working environment, and opportunities to progress are exceptional.\nDesired Skills and Experience\nHDFS, HBase, YARN, SPARK, Oozie and shell scripting\nBackground in all aspects of software engineering with strong skills in parallel data processing, data flows, REST APIs, JSON, XML, and micro service architecture.\nHands on design and development in Java/Core Java related technologies\nHands on design and development experience on big data related technologies - Spark, Hadoop, Hive, MapReduce & Webservices\nHands on experience in RDBMS technologies and concepts\ngood knowledge of writing SQL and interacting with RDBMS and NoSQL database - HBase programmatically.\nHands on experience working with Teradata, Netezza, Oracle, DB2 databases\nStrong understanding of File Formats - ORC, Parquet, Avro File formats.\nHands-on programming/scripting experience skills - UNIX shell, Python, Perl, and JavaScript.\nWorked on large data sets and experience with performance tuning and troubleshooting.\nKnowledge of Spark, Spark Streaming, Spark SQL, and Kafka is a plus.\nExperience working in the healthcare domain is a plus\nAbility to work in a fast-paced delivery environment\nStrong communicator\nAbility to work independently with minimum involvement from client SMEs\nExperience working with Databricks, Snowflake, Big Query or Red Shift\nExperience working on one or more cloud platforms such as GCP, AWS or Azure\nOverall information technology experience\nETL and ELT tools\nExperience as a data engineer", "employment_type": "FULL_TIME", "date_posted": "2021-10-05T17:32:45.000Z"}, "company": {"name": "Source Technology", "link": "https://uk.linkedin.com/company/source-technology-ltd"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}