{
    "job": {
        "title": "Senior Network Engineer",
        "industry": "",
        "description": "Netris is looking for a Senior Network Engineer to join our TAC team to help our customers worldwide operate their mission-critical networks for private cloud, edge, and local Kubernetes deployments using Netris, automatic NetOps software.As a vital member of the TAC team, you’ll collaborate with network and software architecture teams and assist in creating Netris – the new automatic NetOps software that over-delivers expectations of customers and achieves extraordinary efficiency, stability, empowering networks of the future.It’s an exciting opportunity for Network professionals to work with the latest cloud management technologies such as Kubernetes, Terraform and to get exposed to the latest networking hardware from our ecosystem hardware vendors such as Nvidia.You will be expected to iterate rapidly while delivering high-quality output.What You’ll Do: Architect Solutions: Understand user’s goals and architect production-grade networks. Support customers during their deployent/migration process.Problem-solve: Troubleshoot complex problems in distributed remote networks. Be creative and suggest solutions to avoid and minimize impact. Reproduce unique issues in the lab environment. Communicate: Communicate professionally with users over slack, e-mail, and phone. Document customer interactions in ticketing systems.Knowledge base: Use, create, share learnings and knowledge. Create internal and external manuals, guides, knowledge-base. Guide: Mentor less experienced colleagues.Have fun: Be part of a vibrant team, work with fantastic users, create the networks of the future. Key Requirements5+ years of experience in networking engineering/architecture (experience in TAC/L3 support teams of a network vendor is huge plus)Solid understanding of Network Fundamentals.Experience working with BGP routing.Excellent knowledge of Linux.Knowledge of Linux networking is a plus.Excellent problem-solving, troubleshooting, and analytical thinking skills.Ability to deliver and passion to challenge the status quo.Ability to communicate effectively and work collaboratively with the team and internal/external organizations.Willing to learn and deep dive into complex technical thingsFluent in written and verbal English.We need amazing people like you to help us challenge the conventional and think differently about the problems we’re solving. Benefits at Netris:Competitive compensationStock optionsLearning and development assistanceHealth, dental and vision insuranceUnlimited Paid Time Off and Sick Time OffPaid Parental LeaveWork from anywhere (remote work initiatives)",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T22:51:44.000Z"
    },
    "company": {
        "name": "Netris",
        "link": "https://www.linkedin.com/company/netrisai"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}