{
    "job": {
        "title": "Software Engineer, 2021 New Grad",
        "industry": "",
        "description": "We’d love to hear from you if you are looking for a tech company with the following:  - Huge market&amp;nbsp;($800 billion market size), we are building the first AI-powered super app to help people owning a car;   \n  - Open, transparent, merit-based culture;   \n  - Hyper growth -&amp;nbsp;10X revenue growth in 2020;   \n  - Best user experience:&amp;nbsp;#1 ranked app&amp;nbsp;in the insurance comparison category;   \n  - Strong leadership: from Amazon, Microsoft, Facebook, Nvidia, Alibaba, etc. and rockstar colleagues;   \n  - Approaching series C with&amp;nbsp;$100M+&amp;nbsp;total financing, backed by top VCs such as Y-Combinator, Goodwater, SV Angel, Funders Club, and Bow Capital, etc.   \n&amp;nbsp;About jerry.ai:Jerry.ai is building the first SUPER app for your car that helps people optimize the cost and experience of owning a car (making ownership easy & affordable). Having built the #1 ranked app and the fastest growth app in the insurance comparison category, we are tackling other areas of car ownership and looking for engineering talents to join us in expanding our product offerings. Headquartered in Silicon Valley, CA, we have offices in the U.S., China, and Canada.&amp;nbsp;A few examples of the exciting projects that we are working on:  - Create a smart prediction engine for customer’s insurance coverage needs   \n  - Build predictive models on customer purchase behavior based on a large data set   \n  - Use telematics tracking to build customer driving risk profile   \n&amp;nbsp;About YOU:  - You love tackling convoluted problems and coming up with clean, stable solutions that scale.   \n  - You have a genuine passion for designing and implementing elegant software solutions.   \n  - You are intimately familiar (and up to date) with development ecosystem and make sound decisions when choosing the right tool or library for the job.   \n  - You will contribute across the entire product stack, as well as collectively oversee the integrity of the codebase.   \n&amp;nbsp;A few more specifics about YOU:  - 1 + years of full-time software development experience.   \n  - B.S. degree in Computer Science or related discipline.   \n  - Strong software development fundamentals (data structures, algorithms, etc.).   \n  - Proficient with modern web application development with knowledge of JS ecosystems and open source web frameworks (e.g. NodeJS / React / GraphQL / PostgreSQL / Redshift / Redis / Kubernetes).   \n  - Knowledge of good practices, preferred design patterns, and writing idiomatic Javascript code.   \n  - Solid understanding of performance implications and scalability of code.   \n  - Keenness for writing good, meaningful tests and maintaining thorough test coverage.   \n  - Experience with large, complex codebases and know how to maintain them.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-12T23:07:15.000Z"
    },
    "company": {
        "name": "Jerry",
        "link": "https://www.linkedin.com/company/jerryinc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Junior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}