{
    "job": {
        "title": " Data Scientist, Contractor, 100% Remote",
        "industry": "Biotechnology",
        "description": "Satellite Biosciences&amp;nbsp;is pioneering the development and implementation of proprietary, off-the-shelf, implantable satellite organs as living therapeutic solutions that can transform the lives of millions of patients who suffer from serious diseases.&amp;nbsp;&amp;nbsp;Building on 25 years of work in award-winning labs&amp;nbsp;at top academic institutions, the platform is supported by a strong IP portfolio and is backed by a top tier syndicate, led by Polaris Partners, Lightspeed Ventures, and aMoon.   We are seeking an experienced, creative, and motivated&amp;nbsp;Data Scientist (Contractor, 100% remote)&amp;nbsp;to join our rapidly growing team. In this role you will contribute to the company’s platform technology of engineered satellite organs. Specifically, you will contribute towards our efforts to characterize and optimize the satellite organs using data driven approaches and modeling techniques such as unsupervised and supervised machine learning.   This role is a unique opportunity to join an early-stage, well-funded Biotech startup. You will initially report directly to our Senior Data Scientist. The position is 100% remote with work&amp;nbsp;up to 20 hours per week.   Responsibilities:     - Wrangle data of multi-omic datasets and images in preparation for algorithm development and machine learning   \n  - Evaluate open access databases of sequencing results for disease modeling   \n  - Develop 2D and 3D image analysis algorithms   \n  - Parse sequencing results and use unsupervised, semi-supervised, and machine learning techniques for outcomes prediction   \n  - Analyze peptide and nucleic acid sequence data sets   \n  - Manage cloud relational databases of analysis outputs (e.g., PostgreSQL)   \n  - Construct and optimize code for machine learning algorithms   \n      Required Qualifications and Experience     - BS, MS, or PhD in a quantitative discipline   \n  - 0 to 5 years of experience in the biotechnology industry   \n  - Proficiency with Python or Julia   \n  - Competency with data wrangling from imaging and tabular data (e.g., pandas)   \n   Experience with at least one of the following:  - Imaging analysis and algorithm development   \n  - RNA-Seq datasets and analysis   \n  - Machine learning and convolutional neural networks   \n  - Experience preferred but not required: Linux and Git AWS or other cloud computing platforms   \n      Please submit your resume (.pdf format) to&amp;nbsp;HR@satellite.bio",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-20T15:48:42.000Z"
    },
    "company": {
        "name": "Satellite Bio",
        "link": "https://www.linkedin.com/company/satellite-bio"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": "Senior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Cambridge",
        "region": "MA",
        "postal_code": "02239",
        "street_address": null,
        "latitude": 42.36525,
        "longitude": -71.10502
    }
}