{"location": {"country": "US", "locality": "Portland", "region": "Portland", "postal_code": "97215", "street_address": null, "latitude": 45.553497, "longitude": -122.90853}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Scientist", "industry": "Computer &amp; Network Security", "description": "Data Scientist\nOur client is looking for a Data Scientist to collaborate with our team on current projects and contribute to the architecture, design, and development of their AIML powered Passwordless Continuous Authentication. Your primary focus will be on applying data mining techniques, doing statistical analysis, and building high-quality prediction systems integrated with our products.?\nThis position may require participation in customer meetings to discuss the software requirements, and present solution architectures and designs to our customers. Therefore, strong verbal and written communication skills, as well as good presentation skills, are required for this position.\nResponsibilities Include:\nCalculate and automate scoring using machine learning techniques.\nBuild recommendation systems.\nImprove and extend the features used by the existing data classifier.\nDevelop and test AIML algorithms.\nBuild a system for automated fraud detection.\nSelecting features, building and optimizing classifiers using machine learning techniques.\nData mining using state-of-the-art methods.\nExtending the company’s data with third party sources of information when needed.\nEnhancing data collection procedures to include information that is relevant for building analytic systems.\nProcessing, cleansing, and verifying the integrity of data used for analysis.\nDoing ad-hoc analysis and presenting results in a clear manner.\nCreating automated anomaly detection systems and constant tracking of its performance\nSkills & Experience We’re Looking For:\n2+ years of hands-on experience in data science, data analytics, or a related quantitative field.\nMS degree in a quantitative discipline (applied mathematics, statistics, computer science, operations research, or related fields).\nStrong knowledge of Python programming language (extensive experience working with Numpy and Pandas and additional experience in one or more of scikit-learn, PyTorch, or Tensorflow) and ability to write neat and well-documented code.\nProficiency in using query languages such as SQL.\nSolid knowledge of machine learning techniques (Clustering, Neural Networks, decision trees, Naive Bayes, SVM, etc) and their advantages/drawbacks.\nStrong mathematical skills and working knowledge of applied statistics (regression, distributions, statistical tests, time series, etc.) and their applications.\nComfortable working with git version controlling and command-line interface.\nExcellent verbal and written communication skills.\nNice to have:\nKnowledge of semi-supervised learning methods.\nKnowledge of operations research.\nSoftware development experience in Python.\nStrong knowledge of cybersecurity.", "employment_type": "FULL_TIME", "date_posted": "2021-08-18T20:33:53.000Z"}, "company": {"name": "VanderHouwen", "link": "https://www.linkedin.com/company/vanderhouwen"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}