{"location": {"country": "US", "locality": "Seattle", "region": "Seattle", "postal_code": "98133", "street_address": null, "latitude": 47.60323, "longitude": -122.33028}, "salary": {"currency": "USD", "min_value": 84200, "max_value": 144000, "unit": "YEAR"}, "job": {"title": "lead site reliability engineer- Starbucks Technology", "industry": "Consumer Goods,Food &amp; Beverages,Retail", "description": "Job Summary And Mission\nIf you’ve got what it takes to help transform one of the most iconic brands in the world into a lean, efficient and highly automated platform, we’d like to talk to you.\nAs a Lead Site Reliability Engineer - Starbucks Technology, you will be responsible for engineering solutions to address day-to-day maintenance, administration, and reliability of Internet-based enterprise systems. On an ongoing basis, this position will identify root causes of operational issues in order to resolve them. As required, this position will help engineering teams improve quality, reduce time to market, and make web applications faster and more reliable.\nThis role requires your A-Game: deep technical proficiency in both enterprise-scale systems as well as next gen cloud native applications are required. So, if you believe, like we do, that a cup of coffee can change a life and change our world, come check us out and help us deliver that same amazing experience to our customers around the globe.\nSummary Of Key Responsibilities\nAutomate repetitive tasks (Eliminate toil)\nSeek opportunities and implement solutions to improve site reliability (reducing Mean Time to Diagnosis, Mean Time to Resolution, System Self-healing, etc.)\nParticipate in On-Call production support\nSupport Software Releases (CI/CD pipeline support, infrastructure, automation, process improvement.)\nVulnerability Management (Patching systems and implementing security controls in compliance with Starbucks Global Security)\nCreate and maintain systems and infrastructure documentation\nPlan and execute on prioritized project tasks\nProvide technical guidance and training to junior team members\nModels and acts in accordance with Starbucks guiding principles.\nSummary Of Experience\nCoding and Operations experience (8+ years combined)\nDesigning, supporting and deploying mission critical products or services (5+ years)\nOperating complex, large-scale Enterprise guest-facing Applications or web sites (5+ years)\nDeploying containerized workloads into Kubernetes (3+ years)\nPublic cloud experience such as Azure, AWS, GCP (5+ years)\nWriting and maintaining Configuration as Code (3+ years)\nWorked in an environment that implemented Agile or LEAN principals (3+ years)\nBasic Qualifications\n4-8 years of professional industry experience with software engineering\n2-3 years of software engineering and design at high volume or large scale\nBachelor’s degree in Engineering, Computer Science, Computer Information Systems, or related field.\nPreferred Qualifications\nAptitude to pick up new technologies and trends.\nExperience with a variety of build, deployment, and CI tools such as Jenkins, Webpack, Ansible, Puppet, and Octopus Deploy.\nExperience automating deployments with Github.\nExperience in designing, implementing and managing Kubernetes.\nExperience in writing, debugging, and maintaining Helm Charts.\nExperience with Docker and have experience in establishing container image repositories, building Docker files, container images, and using Docker in establishing continuous integration/continuous deployment (CI/CD) deployment pipelines.\nExperience with tools enabling automated testing and integration.\nExpertise in Linux and Windows system installation, configuration, administration, troubleshooting, performance tuning, preventative maintenance, capacity planning, monitoring, and security procedures.\nExperience installing and configuring Azure services using Terraform.\nExperience in at least two relevant scripting or programming languages (Go, Python, Ruby, Perl, Shell, PowerShell, etc.)\nExperience hardening and maintaining secure systems (Safe Harbor or PCI experience a plus!)\nProven ability to participate with other functional teams in systems integration and design including writing operational specifications, test plans and requirements management with attention to detail\nAbility to produce system documentation, including writing requirements, operational specifications, system architecture, test plans and as-built documentation, all with attention to detail\nAbility to build strong relationships and influence others across the organization\nDemonstrated knowledge of Agile/Lean methodologies\nExperience working with ITIL and Service Management best practices is a plus\nCore Competencies\nPuts the Customer First:\nHas a relentless focus on the customer. Understands what the customer wants and how to best deliver the experience.\nWorks Well with Others:\nListens and communicates well with others within and outside of Starbucks. Creates a team environment that is positive and productive.\nLeads Courageously\n: Takes personal responsibility to do the right thing and persists in times of challenge or uncertainty. Adapts quickly to change and makes timely, thoughtful decisions.\nDevelops Continuously:\nContinuously seek opportunities to improve self and others. Leads with trust, honesty and commitment to hire, coach and develop partners to achieve their potential.\nAchieves Results:\nUnderstands what drives overall business success and is accountable to prioritize and deliver quality results. Demonstrates knowledge of core products and processes to get results. Anticipates obstacles and takes action to prevent or minimize their impact.\nStarbucks and its brands are an equal opportunity employer of all qualified individuals, including minorities, women, veterans and individuals with disabilities. Starbucks will consider for employment qualified applicants with criminal histories in a manner consistent with all federal, state, and local ordinances.", "employment_type": "FULL_TIME", "date_posted": "2021-09-02T06:09:45.000Z"}, "company": {"name": "Starbucks", "link": "https://www.linkedin.com/company/starbucks"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 96, "seniority_level": "Senior"}}