{"location": {"country": "US", "locality": "Southfield", "region": "Southfield", "postal_code": "48037", "street_address": null, "latitude": 42.480198, "longitude": -83.241}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Embedded Software Engineer", "industry": "Information Technology and Services,Computer Software,Financial Services", "description": "If you are an Embedded Software Engineer with experience, please read on!\nWhat You Will Be Doing\nPerform as a Software Design engineer working independently to achieve high-quality software design per customer requirements.\nWhat You Need for this Position\nMinimum Bachelors Degree in Electrical Engineering or Computer Engineering\n\" Proficient in C programming\n\" Proficient in System and Software Design\n\" At least 3 years of embedded software experience including the ability to work independently and participate in peer reviews.\n\" Familiarity with CMMI or ASPICE software development process\n\" Excellent communication skills including the ability to communicate technical details and document software design.\n\" At least 5 years of embedded software experience\n\" Automotive Experience with Tier-1 Supplier or OEM (CAN, LIN, Diagnostics)\n\" Experience in AUTOSAR software development\nMatlab, Stateflow and Simulink experience\nStrong embedded programming experience in C\nExperience in multiple processor environment is a plus, not necessary\nExperience in Automotive environment is a plus , not necessary\nExperience in Autosar is a plus, not necessary\nWhat's In It for You\nThis position is on a contract basis for 12-24 months\nSo, if you are a Automotive Engineer with experience, please apply today!\nEmail Your Resume In Word To\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nWendy.Alvarado@Optello.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : WA1-1604587 -- in the email subject line for your application to be considered.***\nWendy Alvarado - Sr. Executive Recruiter - Optello\nApplicants must be authorized to work in the U.S.\nOptello is proud to be an Equal Opportunity Employer\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\nYour Right to Work\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\nOptello will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.", "employment_type": "FULL_TIME", "date_posted": "2021-08-27T05:29:51.000Z"}, "company": {"name": "Optello", "link": "https://www.linkedin.com/company/optello-us"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}