{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Nonprofit Organization Management,Mental Health Care",
        "description": "Role: Senior Machine Learning EngineerReports to: Machine Learning ManagerLocation: RemoteHours: Full timeAbout TrevorThe Trevor Project is the world’s largest suicide prevention and crisis intervention organization for LGBTQ young people. We are a non-profit that provides 24/7 life-saving support via phone, text, and chat. We also operate the world’s largest safe space social networking site for LGBTQ youth and run innovative research, education, and advocacy programs. We’ve been saving lives every day for over 20 years.Overview of the roleOur Senior Machine Learning Engineer will contribute to The Trevor Project’s life-saving work by developing machine learning and natural language processing models that drive significant increases in quality of care and scalability for our crisis services and other internal processes. This individual will help the team contribute to the development of the machine learning models from concept to productionization, and integrate them across our platforms and services. The successful candidate will work closely with domain experts across The Trevor Project and will leverage advice and expertise from external partners and advisors. Who you areExperienced. You have significant experience in machine learning (using one of these libraries: TensorFlow, PyTorch, Keras, Scikit-learn) and natural language processing in a high-tech environment. You have developed high-performing models from concept to web production and you understand fundamental statistical methodologies.Perpetual Learner. You are energized by learning about new topics and can quickly get up to speed and contribute to initiatives.Innovative. You stay up-to-date on the latest research in AI, but always approach the problem-solving process first with practical, simple, and proven methods.Collaborative. You closely interact with various members of cross-functional teams to accomplish shared goals related to product development. Communicative. People love how you can explain complex concepts in a way that everyone can understand.Organized. You know how to manage multiple projects and prioritize appropriately. You create clear and logical systems and processes to support your work and that of the organization.User Experience. You can put yourself in the shoes of the audience and oversee operations that prioritize their experience.Empathetic. You care and respect those around you regardless of race, ethnic origin, gender, age, sexual orientation, gender identity and physical ability.Passionate. You care about LGBTQ youth. You care about saving lives. You want to come to work and feel inspired every day. You want to change the world.Fun. The work we do is very serious, but that doesn’t mean we don’t have fun. We know how to have a good time and you should too. What you’ll doTrain and test machine learning and natural language processing models (e.g. BERT, GPT-2, etc.) in accordance with internally defined best practicesDevelop solutions and new approaches to a range of other machine learning tasks, including sourcing and labeling training data, evaluating data privacy protection, etc.Assist in deploying machine learning solutions and monitoring for system reliability and fairness in accordance with internally defined standards for fairness, accountability, and transparencyLearn the latest techniques and stay apprised of the latest research in machine learning and natural language processingBrainstorm and work closely with stakeholders to identify areas where machine learning solutions provide valueHave the opportunity to write formal research papers on our machine learning work and submit to conferences and peer-reviewed journalsMentor and guide other members of the machine learning teamAssist in managing relationships with external collaboratorsWork with domain experts to understand our external and internal processesBenefitsGenerous vacation and holidays (like a full day off to celebrate Harvey Milk Day!), including three half-day Fridays during the summerComprehensive health insurance (we pay 100% of your premiums for medical, dental, and life), including gender affirmation surgeryFlexibility to work from anywhere in the U.S. (we provide the technology, a monthly internet stipend and reimbursement to outfit your work-from-home space!)Fun virtual office environment and passionate team Online Subscription to Headspace, a digital meditation platformThe Trevor Project is an equal opportunity employerMeaningful work at an organization that is saving the lives of LGBTQ young people across America every dayYour ApplicationWe’re excited to hear from you! To join Team Trevor, please upload a resume and cover letter. Applications without cover letters will not be considered - use this as an opportunity to convey why you want to be the next Senior Machine Learning Engineer at The Trevor Project!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T00:06:00.000Z"
    },
    "company": {
        "name": "The Trevor Project",
        "link": "https://www.linkedin.com/company/the-trevor-project"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}