{"location": {"country": "US", "locality": "Los Angeles", "region": "Los Angeles", "postal_code": "90101", "street_address": null, "latitude": 34.05224, "longitude": -118.24335}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Cloud Engineer", "industry": "Telecommunications", "description": "If you are a Cloud Engineer with experience, please read on!\nWhat You Will Be Doing\nOn-premise to Azure migrations\nDeploy Azure products (VMs, VPN, Backups, etc)\nTroubleshooting and Maintenance of Azure Environments\nProper documentation (Manuals, KB Articles, Troubleshooting, etc)\nManage ticketing system and escalations\nTechnical support of local user programs (Windows, Office, etc)\nSupport of Azure and VM user experiences\nWhat You Need for this Position\nAzure\nAWS\nMigrations\nData Center\nActive Directory\nVPN\nNetworking\nNetwork Administration\nWhat's In It for You\nCompetitive Salary\nMedical Benefits\nDental and Vision Benefits\nLife Insurance\nShort-Term Disability Insurance\nFlexible Spending Account (FSA)\n401 (K) Program\nPaid Vacation\nPaid Holiday\nPaid Sick Time\nSo, if you are a Cloud Engineer with experience, please apply today!\nEmail Your Resume In Word To\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nClinton.Kertcher@CyberCoders.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : CK8-1644892 -- in the email subject line for your application to be considered.***\nClinton Kertcher - Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\nYour Right to Work\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\nCyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.", "employment_type": "FULL_TIME", "date_posted": "2021-08-25T17:46:31.000Z"}, "company": {"name": "CyberCoders", "link": "https://www.linkedin.com/company/cybercoders"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}