{"location": {"country": "US", "locality": "Bluffdale", "region": "Bluffdale", "postal_code": "84088", "street_address": null, "latitude": 40.489628, "longitude": -111.94002}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Commercial Sales Administrator", "industry": "", "description": "Old Mill Brick is disrupting a growing industry with consumer-first innovation. We are seeking a resourceful individual who wants to make an impact at our company and grow with the company. We are seeking a Commercial Support Administrator to help grow our commercial sales channel.\nThe Commercial Sales Administrator is responsible for handling all inside sales and customer support functions including providing minor technical support, building and maintaining strategic relationships with key decision makers and resolving customer problems.\nLocation:\nBased in Bluffdale, UT (Salt Lake City area)\nEssential Job Functions and Responsibilities:\nPerform all commercial customer service related duties including, but not limited to answering phones, generating quotations, computer entry of orders/debits/credits/returns, providing shipment confirmations, sales orders, invoices and memos.\nUpdate customer relationship management system (CRM - Zendesk Sell), capturing all pertinent customer and project data and coordinating with outside sales force.\nEfficiently manage inbound phone calls to ensure timely handling and accurate routing of transfers.\nFollow up on outstanding leads, quotes and samples.\nMaintain organized customer files, hard copies and electronic files as required.\nDemonstrate personal ownership and accountability for assigned tasks and follow through.\nProfessionally communicate with both customers and cross-functional internal team members.\nAct as the internal subject matter expert for all commercial issues.\nAttend training sessions and travel with experienced company personnel to learn company products/systems, procedures, culture and philosophy of dealing with customers.\nImplement pricing policies within market segments as directed.\nMaintain project tracking files and competitive pricing files.\nAssist in the development of key specification tools and marketing tools that can increase sales and specifications of all Old Mill products.\nInvestigate, document, and report all complaints and claims for service and coordinate with management.\nPerform other duties as assigned.\nJob Requirements/Skills:\nExperience in customer service or inside sales.\nExcellent written, problem-solving, and verbal communication.\nCustomer Service, bookkeeping, or administrative experience.\nDesire to learn and grow professionally.\nAbility to cold call by phone and secure sales/opportunities on targeted lead lists.\nHigh level of self-motivation.\nExcellent interpersonal skills.\nTeam cooperation – maintain positive, cooperative attitude with all employees and customers.\nProficiency with MS office suite with intermediate level proficiency in Excel.\nStrong organizational and time management skills.\nIntermediate knowledge of and functional proficiency in use of CRM systems.\nPhysical ability to lift, move and carry up to 50 pounds.\nValid driver’s license, current automobile insurance, clear credit report and a good driving record.\nSpanish language proficiency (written and verbal) highly preferred.\nMinimum Educational Requirements:\n·        High School Diploma required; Bachelor’s degree preferred.\nTravel:\n·        As needed for industry events or customer support", "employment_type": "FULL_TIME", "date_posted": "2021-08-25T17:29:31.000Z"}, "company": {"name": "Old Mill Brick", "link": "https://www.linkedin.com/company/old-mill-brick"}, "education": {"required_credential": "high school"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}