{"location": {"country": "US", "locality": "Boston", "region": "Boston", "postal_code": "02118", "street_address": null, "latitude": 42.358994, "longitude": -71.05863}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Machine Learning Engineer", "industry": "Information Technology and Services", "description": "Opportunity Overview\nCohere Health is illuminating healthcare for patients, their doctors, and all those who are important in a patient’s healthcare experience, both in and out of the doctors office. Founded in August, 2019, we are obsessed with eliminating wasteful friction patients and doctors experience in areas that have nothing to do with health and treatment, particularly for diagnoses that require expensive procedures or medications. To that end, we build software that is expressly designed to ensure the appropriate plan of care is understood and expeditiously approved, so that patients and doctors can focus on health, rather than payment or administrative hassles.\nIn this role, you’ll join our growing team of world-class engineers, statisticians, and clinical experts to deploy machine learning algorithms that help automate burdensome administrative clinical practices. You will be tasked with finding the most promising opportunities for impact and then delivering on them.\nThis is a unique opportunity to join a high caliber engineering team that is growing quickly. You will build impactful healthcare technology on a modern tech stack.\nWhat You Will Do\nFind the signal in incoherent clinical data\nBuild reliable and scalable production machine learning systems\nWork on feature engineering, statistical analysis, developing novel ML techniques, understanding classifier performance, and ensuring fit-for-purpose.\nWork cross-functionally across diverse stakeholders, including product managers, statisticians, EHR data specialists and physicians.\nWhat You Will Have\nYou have at 5 years experience in applied ML in the industry with a degree or higher (MS/PhD) in computer science, machine learning, mathematics or similar field\nClear understanding of model building, model maintenance and the measures that optimize models for product use\nUnderstand experimental design and can independently perform collection, measurement, and interpretation of results\nExpert in R, SQL,Python or other common analytical data tools\nExpert in linear regression and classification approaches\nHands-On experience with ElasticSearch\nBonus Points If\nHave experience with healthcare data such as claims and EMR data\nHave hands on experience building NLP models using Spacy from clinical narratives\nExperience with TensorFlow is also a plus.\nEqual Opportunity Statement\nCohere Health is an Equal Opportunity Employer. We are committed to fostering an environment of mutual respect where equal employment opportunities are available to all. To us, it’s personal.\nWe can’t wait to learn more about you and meet you at Cohere Health!", "employment_type": "FULL_TIME", "date_posted": "2021-07-28T04:20:05.000Z"}, "company": {"name": "Cohere Health", "link": "https://www.linkedin.com/company/coherehealth"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}