{
    "job": {
        "title": "Data Scientist",
        "industry": "Staffing and Recruiting",
        "description": "Data Scientist18 month contract through Kelly Services Client is in Muskegon MI but open to seeing remote candidates. Preferably in the Eastern timezone to help with working hours.  Offers competitive compensation and full benefits package Responsibilities:• Big data experience • Provide timely response to internal customer inquiries via telephone, business e-mail, meetings, etc. • Perform data analytics using various tools (SAP, BW, Power BI, Python, SAS etc.).• Statistic expertise• May be responsible for several components of a project or a complex component of a larger project. • Contribute to their team or department by applying their knowledge of one or more functional areas. • Responsible for compiling data from multiple databases to extract market trends, sales forecasts, etc. • Support PAP process, month/quarter end sales monitoring and initiatives.• M2M coordination using multiple platforms including EDI, SPEC2000, etc.• Perform Customer Master Data maintenance. • Provide General Business Support, as required. • Other projects as assigned by leadership team. Qualifications:• Fully developed professional with excellent communication and organizational skills and able to work without direct guidance of others.• Must be self-motivated with a strong sense of urgency. Should be able to prioritize and balance workload, plan ahead to ensure deadlines/goals are met, and make sound decisions in a fast-paced environment. • Must possess a ‘customer first’ mindset toward both the client and their customers, always exhibiting the highest level of business support.  • Must be able to perform data analytics using various tools (Power BI, SAP, BW, Python, SAS, etc.) • Excellent MS Office Suite skills (Excel /VBA).• Bachelor’s degree (4-7 years of experience) or Master’s degree (2- 5 years of experience) in Computer Science or Industrial Engineering.• Must be a team player with a passion for excellence.• Must maintain excellent attendance record. ",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T01:32:20.000Z"
    },
    "company": {
        "name": "Kelly",
        "link": "https://www.linkedin.com/company/kellyservices"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Muskegon",
        "region": "MI",
        "postal_code": "49441",
        "street_address": null,
        "latitude": 43.234226,
        "longitude": -86.24656
    }
}