{"location": {"country": "US", "locality": "Plymouth", "region": "Plymouth", "postal_code": "55340", "street_address": null, "latitude": 45.018276, "longitude": -93.47389}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Scientist", "industry": "", "description": "Title: Data Scientist\nJob Classification: Full-Time, Exempt\nDepartment: Consumer Insight and Analytics\nSummary:\nThe Consumer Insight and Analytics group partners with both internal and external clients, and data providers, leveraging predictive analytics and advanced statistical techniques to drive strategic thought and effective decision making. The Data Scientist is responsible for applying and interpreting various statistical and data analysis techniques in support of a variety of analytic solutions. The key objective of this position is to assist internal and external stakeholders in the development of target audience for client or prospect acquisition strategies through data modeling, profiling, and RFM analysis. Proactively promote knowledge and awareness of current and future best practices in the direct marketing arena.\nEssential Duties & Responsibilities:\nProvide quality, statistically valid analysis and related output\nEmploy and interpret appropriate data analysis techniques and statistical methodologies\nExecuting A/B and multi-variate testing, predictive modeling, marketing mix modeling and attribution modeling\nStrategically collaborate with Business Development in assessing prospect marketing strategies and opportunities, especially related to analytics and segmenting\nTake a proactive role in analysis design and execution\nAppropriately account for the timeliness and quality of all assignments\nCollaborate with cross-functional internal resources\nQA/QC data and analysis output to ensure accuracy\nManage multiple projects concurrently\nMonitor project progress relative to timeline and scope\nPresent statistical results to both technical and non-technical audience in a clear manner\nMinimum Qualifications:\nFamiliarity and basic knowledge of open source statistical programs like R & Python\nDemonstrated proficiency in SQL programming\nBachelor's degree in a quantitative discipline (e.g., statistics, economics, mathematics, marketing analytics) or significant relevant coursework\nMinimum of 2 years of related experience\nProficiency with various statistical methodologies such as regression analysis (both linear and non-linear), cluster analysis, CHAID, factor analysis/principal component analysis, time series, survival models, experimental designs using statistical software\nProficiency in MS Office; including PowerPoint, Word, Excel, Access and Outlook\nDesirable Qualifications:\nAdvanced degree (Master's/PhD) in Statistics, Economics or other quantitative discipline\nDatabase marketing experience/knowledge", "employment_type": "FULL_TIME", "date_posted": "2021-08-05T13:54:00.000Z"}, "company": {"name": "Infinity Direct", "link": "https://www.linkedin.com/company/infinity-direct"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}