{"location": {"country": "US", "locality": "Seattle", "region": "Seattle", "postal_code": "98133", "street_address": null, "latitude": 47.60323, "longitude": -122.33028}, "salary": {"currency": "USD", "min_value": 130000, "max_value": 176000, "unit": "YEAR"}, "job": {"title": "Lead Software Engineer - International - Digital Web Applications (SFCC)", "industry": "Marketing and Advertising,Consumer Goods,Retail", "description": "Who We Are\nDescription & Requirements\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth-focused environment for our people.\nAbout This Team\nOur Digital International eCommerce team in the lululemon technology organization is responsible for engineering and deploying technology solutions for EMEA and APAC e-commerce platforms, services to enhance our guest experience.\nA Day In The Life\nDesign solutions that are scalable, adaptable and in-line with digital platform requirements, liaising effectively between IT & Business Leadership. Work closely with our solutions architects and software development teams to support and guide delivery teams implementing solutions and educate teams on corresponding technical aspects.\nProvide technical expertise & lead technical teams and improve software delivery through DevOps and other Agile practices\nInvestigate new technologies and techniques and research ongoing industry developments through a partnership with the Architecture team Support Triage and Resolve Production issues\nGuide delivery teams implementing solutions and educate teams on corresponding technical aspects. Design and review solutions for e-commerce and integrations technologies Work closely with our solutions architects and software development teams to support and guide delivery teams implementing solutions and educate teams on corresponding technical aspects. Actively engages improving software delivery through DevOps and other Agile practices Create technical vision & provide thought leadership for e-commerce & related application.\nQualifications\nMinimum 3 - 4 years of Sales Force Commerce Cloud (SFCC) experience, overall 10+ years of software engineering experience. Experience building microservices is plus\nBachelors Degree in Computer Science Engineering or Engineering background\nUnderstand the e-commerce architecture at lululemon\nGood Knowledge in Salesforce Commerce Cloud application\nGood understanding of E-commerce system integrations\nStrong knowledge of Devops practices\nAbility to work independently with minimal direction be a self-starter with strong initiative, and ability to manage/execute workload to deliver high quality results\nMust Haves\nAcknowledges the presence of choice in every moment and takes personal responsibility for their life.\nPossesses an entrepreneurial spirit and continuously innovates to achieve great results.\nCommunicates with honesty and kindness, and creates the space for others to do the same.\nLeads with courage, knowing the possibility of greatness is bigger than the fear of failure.\nFosters connection by putting people first and building trusting relationships.\nIntegrates fun and joy as a way of being and working, aka doesn’t take themselves too seriously.", "employment_type": "FULL_TIME", "date_posted": "2021-08-31T00:21:22.000Z"}, "company": {"name": "lululemon", "link": "https://ca.linkedin.com/company/lululemon"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}