{"location": {"country": "US", "locality": "Guilford", "region": "Guilford", "postal_code": "06437", "street_address": null, "latitude": 41.281227, "longitude": -72.68165}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Scientist", "industry": "", "description": "InveniAI is a company that is accelerating Drug Discovery and Development with Artificial Intelligence and Machine Learning. Our R&D Engine is significantly improving drug development's clinical and regulatory success. We pride ourselves on resourcefulness, collaboration, and our ability to tackle  Pharma's most demanding problems and look for exceptional talent to help us grow.\nJob Summary\nWe are looking for a Data Scientist that will help us discover the information hidden in vast amounts of data and help us make more intelligent decisions to deliver even better products.\nAs a Data Scientist and Statistician, you will work with a growing multidisciplinary team of Data Scientists, Engineers, and Solutions Experts with deep domain expertise, working to develop new skills and workflows to solve real-world problems of the pharma and healthcare domain. You will have the opportunity to work with unique healthcare data sets that cover all phases of the Pharma/Healthcare industry.\nYour responsibilities will be to apply data mining techniques, statistical analysis and build high-quality prediction systems integrated with our product. You will be helping to ensure that our models are accurate and parsimonious. You will also help to characterize, interpret, and share the results we achieve in our pharma/healthcare research studies.\nResponsibilities\nStrong computational skills and knowledge of machine learning, prediction methods, and/or systems biology\nExtensive background in developing classification and prediction models, including model selection and regularization techniques\nDoing ad-hoc analysis and presenting results in a clear manner\nSupport the development and delivery of analytic models using skills such as data acquisition and management, algorithm design, and model development & refinement\nAcquire a deep understanding of the scientific problems and translate them into appropriate algorithmic representations\nEncode mathematical abstractions into prototype computer programs or models\nEnsure process documentation, overall quality of the data & solutions during the analytic development process\nInterpret results and communicate them to technical and non-technical audiences, cross-functional teams, and executive leadership\nA genuine interest in the scientific questions being investigated in the Center.\nQualifications\n1-4+ years of data analytics experience\nB.Tech/BE/M.Tech/MSc/PhD in IT/CS/Biotech/Bioinformatics/Mathematics/Life Science\nExpert knowledge of Python/KNIME\nKnowledge of NLP(Natural language procession) and NER(Named entity recognition)\nKnowledge of PostgreSQL/MySQL\nExtensive experience with machine learning and statistical modeling is imperative; text mining and topic modeling are a plus.\nComfortable working in an environment where problems are not always well-defined\nInquisitive, proactive, and interested in learning new tools and techniques\nOutstanding communication and collaboration skills. You can learn from and teach others. Strong drive for results.\nWell-organized, independent, and ready to work with minimal supervision\nData-oriented personality with a desire to excel and work with talented people\nExperience working with healthcare data\nAbility to work with the integration of OMICS data with tools of Network Biology.\nExperience with data visualization tools, such as D3.js, GGplot, gephi, cytoscape, R-Shiny.\nDesirable\nExperience in applying advanced mathematics\nGood scripting and programming skills\nFull-time", "employment_type": "FULL_TIME", "date_posted": "2021-08-04T16:55:01.000Z"}, "company": {"name": "InveniAI", "link": "https://www.linkedin.com/company/inveniai"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 12, "seniority_level": "Junior"}}