{"location": {"country": "US", "locality": "Mountain View", "region": "Mountain View", "postal_code": "94040", "street_address": null, "latitude": 37.39008, "longitude": -122.08139}, "salary": {"currency": "USD", "min_value": 80700, "max_value": 150000, "unit": "YEAR"}, "job": {"title": "Data Scientist", "industry": "Internet,Health, Wellness and Fitness,Mental Health Care", "description": "Description\nWho are we and why should you join us?\nWe help people change their lives. BetterHelp is the world’s largest therapy service.\nWe set out on a mission to provide everyone with easy, affordable, and private access to professional counseling: anytime, anywhere. To date, our network of over 15,000 licensed, accredited, and board-certified therapists have assisted more than 1,000,000 people. Every month, our secure website and mobile app facilitate over 5,000,000 messages, chats, voice calls, and video sessions that help people face life’s challenges.\nWe’re taking mental healthcare to the next level.\nWe combine clinical care, cutting-edge technology and data-driven product development to constantly learn, iterate, and improve. We are relentless in our pursuit of better, always questioning the status quo and discovering new ways to get things done and serve our members.\nWe are a community that grows together - both professionally and personally.\nEven with our exponential growth, our team is kept agile and nimble, allowing you to have a huge impact and carve your own path from day one. We invest in our team’s well-being and professional development because we know that business and individual growth go hand-in-hand. You will move fast, remain flexible, and be challenged every day. Join us!\nWhat are we looking for?\nBetterHelp is looking for a Data Scientist to help us scale and increase our impact. You will use data to drive insight into the product and business with a focus on new user growth, retention and quality. The ideal candidate would have experience analyzing large and complex data sets related to web products. You'll be doing plenty of experiment design and post-hoc analysis, both to support product improvements and business decisions, as well as setting up infrastructure and frameworks for more efficient analysis.\nWhat will you do?\nCollaborate with the product team and development team to design effective A/B tests.\nBe the go-to person for product data tracking questions for our engineers\nMonitor and analyze several A/B tests with statistical rigor, present the data and insights to the team and drive product decisions.\nSlice and dice an enormous amount of data to gain insight on how to improve our products.\nLook at complex problems and come up with testable models and algorithms to optimize the platform.\nDevelop theories that can be explored with analysis to help us improve.\nSet up BI tools and regular reporting services and interfaces.\nLive and breathe SQL.\nEnjoy great teamwork, have lots of fun, and take pride in building a world-class product that makes a difference on people's lives.\nWhat will you NOT do?\nYou will NOT worry about \"runway\", \"cash left\", or \"how much time we have until the next round\". We have the startup DNA but we're fully backed and funded, all the way to success.\nYou will NOT be confined to your \"job\". You will get involved in product, marketing, business strategy, and almost everything we do.\nYou will NOT be bogged down by office politics, ego, or bad attitude. Only positive, pleasure-to-work-with people allowed here!\nYou will NOT get yourself burned out. We work hard but we believe in maintaining sustainable work/life balance. Really.\nRequirements\nBSc/MA in a quantitative discipline such as Statistics, Math, Economics, or Engineering\nAt least 1 year of experience in a quantitative data analysis role involving user behavior (e.g. marketing, product) and large data sets\nProven success supporting or making business decisions based on your data analysis\nAdvanced experience with SQL\nAdvanced knowledge of statistics, especially as it relates to hypothesis testing\nExpert in using tools like R and Python for data analysis\nExperience analyzing A/B tests\nExperience with BI tools like Tableau and Looker\nExperience analyzing large and complex data sets to drive business insights and decisions\nGreat grasp of numbers with love for data and analytics, knowledge of statistics\nExcellent communication (oral and written), attention to detail, time management and organizational skills\nBonus (great to have but not required):\nExperience building predictive models\nExperience with b2c, market place products\nExperience in or supporting a growth team\nBenefits\nCompetitive salary & equity compensation\nExcellent health, dental, and vision coverage\n401k benefits with employer matching contribution\nRidiculous perks program\nOffice in the heart of downtown Mountain View, a three-minute walk from Caltrain\nCommuter benefits, FSA accounts, and Employee Stock Purchase Programs\nBuilding something that matters - loved by the people and admired by the press\nAny piece of hardware or software that will make you happy and productive\nAwesome people to work with\nNothing to slow you down\nHelping people live a better life, every day\nAt BetterHelp we thrive on difference and individuality, and as part of the Teladoc Health family, we are proud to be an Equal Opportunity Employer. We never have and never will discriminate against any job candidate or employee due to age, race, ethnicity, religion, sex, color, national origin, gender, gender identity, sexual orientation, medical condition, marital status, parental status, disability, or Veteran status.", "employment_type": "FULL_TIME", "date_posted": "2021-07-16T03:07:45.000Z"}, "company": {"name": "BetterHelp.com", "link": "https://www.linkedin.com/company/betterhelp-com"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 12, "seniority_level": "Junior"}}