{"location": {"country": "US", "locality": "Ann Arbor", "region": "Ann Arbor", "postal_code": "48106", "street_address": null, "latitude": 42.281418, "longitude": -83.748474}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Machine Learning Engineer", "industry": "Computer Software,Information Technology and Services,Outsourcing/Offshoring", "description": "Update: Moving forward and not limited to 2021, Nexient will be supporting fully remote and hybrid work models for all team members***\nWe’re happy to announce that as part of our efforts to embrace, adapt, and provide more flexibility to our team members—Nexient will be adopting a new set of work models. Whether it’s fully remote, hybrid, or full-time at the office—you now have the option to choose the work arrangement that best suits your needs and preferences. You are not locked into any selection and can make changes at any point if needed.\nDon’t only dream about what’s next – come build it with us!\nNexient specializes in bringing a “Product Mindset” to our work, using small, nimble teams, Agile thinking and other techniques from product development to build great custom software people love to use.\nAnd as America’s leading 100% US, 100% Agile software services partner, we’re building it here instead of sending tech jobs offshore.\nPeople are noticing.\nOur clients include some of America’s favorite brands in retail, healthcare, financial services and more – but also some very cool product companies you may not have heard of yet. We’re recognized as a Gartner Cool Vendor, HfS Hot Vendor and the only 100% US tech company in the World’s Top 100 Outsourcers. You might have read about us in The New York Times.\nNexient Combines\nSilicon Valley innovation (through our Bay Area innovation hub, and network of startups and emerging technology partners)\nScalable, Midwest delivery (with 65+ Agile teams in high talent cities like Ann Arbor, Michigan)\nOnsite collaboration (with product managers and other key roles working face-to-face with client teams around the country)\nCome build with us!\nRequired Technical Skills\nSolid understanding of machine learning fundamentals\nOptimization (gradient decent variants, hyperparameter tuning, regularization)\nSome experience in a variety of problems and domains, with depth in at least two (supervised, unsupervised, generative, control/RL, anomaly detection, timeseries, etc.)\nTraditional ML models (k-means, KNN, decision trees, SVM, Bayesian/graphical models, Gaussian process, etc.)\nDeep learning fundamentals (CNN, RNN, attention/memory, Autoregressive) and extensions (Transformer, LSTM, ResNet, etc.)\nExperience coding with popular frameworks\nPython expertise (data structures, coding patterns) along with common data, math and visualization libraries\nAble to configure and work in different coding environments (local, notebooks, containers) and software engineering workflows (testing, code management/Git, CI/CD)\nLoading and saving large data sets and models efficiently\nCustomizing models and optimizing performance\nStructuring code to make it modular and deployable (logging and metrics, adhering to common deployment interfaces/hooks)\nAbility to follow papers/theory and adapt associated models\nNice To Have\nNLP specialization (NLU, NLI, QA, BERT, GPT, T5, XLNet, etc.)\nMLOps and cloud environment (resource configuration, optimization)\nBenefits & Perks\nCompany sponsored health, dental, vision insurance and flexible spending account (FSA) for employees and their families including domestic partners\nPaid Vacation Time and company holidays\n401K plan\nLunch & Learn\nPassionate, collaborative and awesome co-workers\nWorld class training and career mentorship\nNexient is an inclusive equal opportunity employer. At Nexient, your uniqueness makes us better. Your uniqueness is why you are valued, you are heard, you add to our culture, and you belong. Diversity & Inclusion is hard coded into our DNA, and at the core of everything we do. Together, not separately, we strive to become even more diverse to help fuel our innovation and connect us closer with the clients and communities we serve.", "employment_type": "FULL_TIME", "date_posted": "2021-08-30T23:21:39.000Z"}, "company": {"name": "Nexient", "link": "https://www.linkedin.com/company/nexient"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}