{
    "job": {
        "title": "Software Development Engineer - Automation (R3924)",
        "industry": "Computer Software",
        "description": "DescriptionAvalara, Inc., (www.Avalara.com), is the leading provider of cloud-based software that delivers a broad array of compliance solutions related to sales tax and other transactional taxes.What is it like to work at Avalara? Come find out! We are committed to the following success traits that embody our culture and how we work together to accomplish great things: Fun. Passion. Adaptability. Urgency. Simplicity. Curiosity. Humility. Ownership. Optimism.We are building cloud-based tax compliance solutions to handle every transaction in the world. Imagine every transaction you make - every tank of gas, cup of coffee, or pair of sneakers, every movie ticket, or streamed song, every sensor-to-sensor ping. Nearly every time you make a purchase, physical or digital, there is an accompanying unique and nuanced tax compliance calculation.We are seeking a highly motivated, experienced Software Development Engineer - Automation to join our team.About The RoleAvaTech is looking for an experienced Software Development Engineer who has a primary focus on Automation and scalable processes in Corporate Information Technology. The ideal candidate will have experience automating complex workflows and tasks across a variety of systems including integrations with Okta, Active Directory, ServiceNow, and Workday. Automation of Avlarian's integrated systems and design through an employee's lifecycle at Avalara will be the primary focus on this position. You will apply design thinking and next-gen technologies to solve business challenges. You'll work side-by-side with various architecture, managers, engineers, and consultants to build innovative solutions to solve business challenges.Key ResponsibilitiesCollaborate with a diverse set of business customers and technology professionalsUse analytical and problem-solving skills to design efficient and robust automation logicAbility to help architect end-to-end RPA solutionsParticipate in designing Automation scenarios and workflowsDesign, code, configure and test automation logicPrepare test scenarios and perform unit testsWork closely across all of Avalara to design integrated workflows and processesLeverage knowledge of continuous improvement methodsOperate within the agile delivery and continuous improvement methodologiesAbility to understand and utilize common APIsBuild Custom code for integrations throughout a wide range of modern technologiesSelf-starting with the ability to manage multiple automation initiatives in parallelThe applicant must have strong communication, customer service, troubleshooting, and organizational skills, and the ability to complete assigned workAbility to identify and apply best practices, standards, and SDLC concepts to all functional areasQualificationsBachelor's degree in computer science, information technology or related field12+ years of programming/systems development experience8 years of relevant experience with emphasis in process automation development5+ years of experience working development; participation & support for UAT/Other testing phases, and support release management to environmentsAdvanced knowledge of APIs, Okta, PowershellAutomation as a primary focus to scale out Avalara networksExcellent leadership and mentoring skillsHigh level problem-solving and communication skillsAbout AvalaraAvalara helps businesses of all sizes achieve compliance with transactional taxes, including VAT, sales and use, excise, communications, and other tax types. We deliver comprehensive, automated, cloud-based solutions that are fast, accurate, and easy to use.Avalara offers hundreds of pre-built connectors into leading accounting, ERP, ecommerce and other business applications. Each year, the company processes billions of tax transactions for customers and users, files hundreds of thousands of tax compliance documents and tax returns and manages millions of exemption certificates and other compliance related documents.Avalara’s headquarters are in Seattle, WA and it has offices across the U.S. and in Brighton and London, England; Brussels, Belgium; and Pune, India. More information at: www.avalara.comAvalara is an Equal Opportunity Employer. All qualified candidates will receive consideration for employment without regard to race, color, creed, religion, age, gender, national orientation, disability, sexual orientation, US Veteran status, or any other factor protected by law.Avalara is an Equal Opportunity Employer. All qualified candidates will receive consideration for employment without regard to race, color, creed, religion, age, gender, national orientation, disability, sexual orientation, US Veteran status, or any other factor protected by law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T01:36:37.000Z"
    },
    "company": {
        "name": "Avalara",
        "link": "https://www.linkedin.com/company/avalara"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 144,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}