{"location": {"country": "US", "locality": "United States", "region": "United States", "postal_code": "99999", "street_address": null, "latitude": 39.50355, "longitude": -99.0183}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Principal Software Engineer (Ecommerce)", "industry": "Internet", "description": "This direct hire role will be focused on\necommerce retail applications\nutilizing technologies including\nReact JS, Elixir and Kafka,\namong others. Successful candidate will need to have\nexperience architecting and building out a related ecommerce application environment.\nThis person can be based anywhere in the United States but work schedule is Pacific time zone. The client's HQ location is in the Bay area in California.\nAs a\nPrincipal Software Engineer\n, you’ll spend about 40% of your time on application architecture, mentoring, thought leadership, and guiding teams around the company as they establish or update best practices for software development. You’ll participate in guild (community of practice) meetings, architecture review sessions, organize training for engineers, and otherwise help ensure that we maintain a cohesive and modern technology vision while still empowering teams to move fast. You’ll partner with senior technical leadership to establish north stars of our technology vision. You’ll represent the company at conferences and other speaking engagements from time to time. The other 60% of your time, you’ll dive in and actively develop that future! You’ll typically start the work on some of our most challenging projects, laying out the foundational architecture and actively contributing code. In most cases, you’ll bring in other engineers from around the company as these initiatives grow, eventually handing it off to Staff Engineers as you go on to tackle the next challenge.\nSome upcoming projects you’ll be involved in:\nUpgrades to our inventory & catalog system as we transition from a single-SKU model to allow for depth and variants\nAssisting with the strategy as we continue to break apart our existing ruby on rails monolith into services\nPreparation and design for future international expansion\nImprovements to our payout processes\nWhat You Get To Do Every Day\nPropose and build technical architecture and solutions to move our business forward\nAdvise and collaborate with senior engineering leadership on technical vision and strategy across a multi-year timeframe\nBuild a deep understanding of The RealReal’s business model, opportunities, and challenges\nProvide technical direction and mentorship for engineers across the organization\nDrive build vs buy evaluations, including research and initial assessment with vendors\nAssist in coordinating cross-team engineering efforts and determining technical requirements\nReview technical architecture proposals and pull requests and provide constructive feedback\nProduce high-quality, performant, testable code, and systems\nDocument architecture and processes, and uplevel them across the company\nRepresent the company at conferences and other events, helping us to build brand awareness and attract talent\nWhat You Bring To The Role\n10+ years of professional web application/full-stack development experience\n2+ years leading a high-performance engineering team or organization, in a fast-paced environment\nFluency with any of React JS, Elixir, Erlang, or another object-oriented or functional programming language\nStrong understanding of distributed systems and architecture\nStrong understanding of web technologies: HTML5, Javascript, CSS/SASS, REST, JSON\nStrong understanding of web-app performance fundamentals and related dev tools\nStrong database fundamentals and experience with MySql or PostgreSQL; AWS Dynamo DB a plus\nExperience using async message queues such as Kafka or Kinesis\nMastery of Git and Github workflows\nExperience with Microservices architecture\nBachelor of Computer Science degree or equivalent experience\nExperience building E-commerce, Operations, and Logistics applications\nNice to Haves\nExperience with Headless E-commerce APIs\nExperience working with machine learning or related technologies\nExperience with iOS/Android and mobile development\nExperience with GraphQL\nExperience with Docker and Kubernetes\nJob Type: Full-time\nPay: $175,000.00 - $200,000.00 base per year, plus bonus, plus equity", "employment_type": "FULL_TIME", "date_posted": "2021-07-21T01:54:36.000Z"}, "company": {"name": "TriSearch", "link": "https://www.linkedin.com/company/tri-search"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 120, "seniority_level": "Lead"}}