{
    "job": {
        "title": "Software Engineer In Test",
        "industry": "Publishing,Computer Software,Online Media",
        "description": "Job Summary | Major goals and objectives.Meredith Corporation seeks an experienced, detail-oriented SDET II to join our Consumer Engineering team. As a trusted partner to the developers, product owners and project managers, you will ensure that devotees of Meredith’s iconic brands – including People, AllRecipes.com, InStyle, Martha Stewart Living, Better Homes & Gardens, and dozens more – are engaged and delighted by our web sites.   The Software Development Engineer in Test II (SDET II) helps deliver the quality and performance of large scale, big data, custom hardware multi-platform software products that includes; web, API, micro service and mobile application interfaces. Incumbents in this position are experienced, hands on and self-motivated engineer who can work collaboratively in a continuous integration environment. This role involves working closely with Software Developers that includes leveraging shift-left methods to understand a complex domain and product. The SDET II focuses on contributing to the development of automated Functional Integration tests and end-to-end tests through open-source test frameworks for overall system testing within an Agile environment. This position typically works under limited supervision and direction. Incumbents of this position will regularly exercise discretionary and decision-making authority.  - Tests API, web, micro service and mobile based applications that reference large and complex back-end systems   \n  - Creates and maintains automated test cases, executes test suites, reviews and diagnoses reported bugs, and ensures overall system quality prior to a customer release   \n  - Designs, develops, maintains, and troubleshoots automated suites of tests through continuous integration for value added feedback   \n  - Works with the engineering teams to derive testing requirements throughout the development cycle   \n  - Reproduces, debugs, and isolates problems and verify fixes   \n  - Works closely with software developers to create software artifacts including test plans, test cases, test procedures and test reports   \n  - Works cross functional areas with internal partner engineering teams in a disciplined agile environment   \n  - Estimates own testing tasks and works productively with minimum supervision while showing excellent team attitude.   \n   Essential Job FunctionsAccountabilities, Actions and Expected Measurable Results35%&amp;nbsp;Designs, develops, maintains, and troubleshoots automated suites of tests through continuous integration for value added feedback35%&amp;nbsp;Define testable user stories and acceptance criteria and to resolve any defects that may arise.15%&amp;nbsp;Prepare and present test reports to include status and coverage10%&amp;nbsp;Reproduces, debugs, and isolates problems and verify fixes5%&amp;nbsp;Actively collaborate with stakeholders to clarify requirements and define test cases100%   Minimum Qualifications and Job Requirements | All must be met to be considered.Education:  - Four-year college degree in Software Engineering, Computer Science or related technical discipline such as Science or Engineering.   \n   Experience:  - 6 years of experience, preferably in either a Software Development Engineer or (SDET) Software Development Engineer in Test role   \n  - Must have an understanding and ability to develop code in Java, Python, PHP or C++   \n  - Strong experience in API testing   \n  - Strong experience with XML, Databases and SQL   \n  - Hands-on experience with Linux, Windows and/or mobile devices.   \n  - Must have strong analytical and problem-solving skills as well as the ability to analyze complete problems in large systems.   \n  - Experience with Test processes, open-source test frameworks, test design strategies, writing test cases, and automating tests in Java with frameworks like JUnit/TestNG, Selenium, JMeter and Appium is preferred   \n  - Experience with Jenkins or other continuous integration systems   \n  - Experience with tools & applications such as JIRA, Confluence, Bitbucket, Git and Artifactory/Maven   \n  - Must have previous experience with requirements, defect, functional, and performance management systems   \n   Specific Knowledge, Skills and Abilities:  - Ability to develop automated test for a set of stories   \n  - Ability to apply creative solutions to automate the application and/or a service   \n  - Utilize a variety of testing tools and able to use existing framework   \n  - Demonstrates exemplary teamwork and maintains the respect of others.   \n  - Demonstrates a strong drive and intellectual curiosity to investigate complex technical issues   \n  - Ability to collaborate effectively with all team members and with cross-functional teams   \n  - Utilizes a variety of testing tools and able to instruct others on their use.   \n  - Ability to switch context quickly and easily.   \n  - Must be detail oriented, analytical and creative thinker with passion for quality and test automation   \n% Travel Required (Approximate): 0%",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-08T20:57:37.000Z"
    },
    "company": {
        "name": "Meredith Corporation",
        "link": "https://www.linkedin.com/company/meredith"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": "Senior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "New York City Metropolitan Area",
        "region": null,
        "postal_code": "10021",
        "street_address": null,
        "latitude": 40.748295,
        "longitude": -73.98556
    }
}