{
    "job": {
        "title": "Software Test Engineer - 36847",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Overview      Job Description      Alion is looking to put in place a team of engineers to support testing and integration of Minotaur Software program. This team would work out of the office located at Hanover, MD a in the integration labs supporting Navy Airborne SIGINT platform systems.      Summary      The software test engineer would be responsible for testing and integration the Minotaur Software product. Under general supervision runs tests to evaluate the function of products and systems. Develops and implements procedures for Minotaur Software product testing and writes up defects for correction or further investigation.      Duties    Reviewing software requirements and preparing test scenarios.  - Executing tests on software usability.   \n  - Analyzing test results on database impacts, errors or bugs, and usability.   \n  - Preparing reports on all aspects related to the software testing carried out and reporting to the design team.   \n  - Interacting with clients to understand product requirements.   \n  - Participating in design reviews and providing input on requirements, product design, and potential problems         \nProfessional Experience And Education    Bachelor's Degree in Software, Computer Engineering, Electrical Engineering, or related discipline. Years of experience could be substituted for degree.  - 2-4years of experience in software testing.   \n  - US Citizen with a current DOD SECRET clearance with the ability to get TS/SCI clearanceis required.   \n  - Devises and applies testing procedures for both Alion’s Minotaur product and from outside vendors.   \n  - Performs moderately complex analysis and trouble-shooting.   \n  - Evaluates progress and results of project.   \n  - Carries out assignments requiring the improvement of current techniques and procedures.   \n  - Develops and maintains contacts with customers including those at levels above the project monitor.   \n  - Prepares and assists others in the development of status reports, technical memoranda, contact reports, technical analyses or other outputs needed.   \n  - Prepares and provides briefings to staff and customers and participates in technical discussions at project review sessions.   \n  - Excellent communication and interpersonal skills.   \n  - Knowledge of Microsoft Office suite programs, MS Word, Excel and PowerPoint.   \n  - Knowledge of the principles, practices, and procedures used in test engineering.         \nRequires Knowledge In Following Disciplines    Software Engineering (Embedded, Application, Database, User Interface, Operating System(s), Board Support Packages, Network Communications, Mobile Communications, Linux, Microsoft Windows)  - Modeling and Simulation   \n  - C4ISR System Design, Development, Sustainment   \n  - SIGINT/COMINT/ELINT/Direction Finding   \n  - Electronic Warfare   \n  - Communications Systems   \n  - GEOINT, EO/IR/FMV   \n  - RADAR, SAR, GMTI   \n  - User Interface Design and Ergonomics   \n  - Aircraft System Design, Integration, Operation   \n  - Position, Navigation and Timing   \n  - Antenna Design   \n  - Space/Time Adaptive Processing         \nEducation And Experience      Bachelor's Degree in Software, Computer Engineering, Electrical Engineering, or related discipline. Years of experience could be substituted for degree.      2-4years of experience in software testing.      US Citizen with a current DOD SECRET clearance with the ability to get TS/SCI clearanceis required.      Previous experience working with the Minotaur Product is extremely desirable.      #CB        - CJ         \nSecurity Clearance: None   Job Requirements* Bachelor's Degree in Software, Computer Engineering, Electrical Engineering, or related discipline. Years of experience could be substituted for degree., Bachelor's Degree in Software, Computer Engineering, Electrical Engineering, or related discipline. Years of experience could be substituted for degree. 2-4 years of experience in software testing. US Citizen with a current DOD SECRET clearance with the ability to get TS/SCI clearance is required. Previous experience working with the Minotaur Product is extremely desirable.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-01T08:32:39.000Z"
    },
    "company": {
        "name": "ClearedJobs.Net",
        "link": "https://www.linkedin.com/company/clearedjobs-net"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Hanover",
        "region": "MD",
        "postal_code": "21098",
        "street_address": null,
        "latitude": 39.19298,
        "longitude": -76.72437
    }
}