{
    "job": {
        "title": "Software Engineer In Test",
        "industry": "Logistics and Supply Chain",
        "description": "Job Title:  Software Engineer in TestLocation: Alpharetta, Georgia (Flexible/Hybrid)Industry: Supply ChainTerms: PermanentRequirements: JavascriptPreferred: Jest or Jasmin Chai (for assertions)Typescript or JavaScript Visual Studio Code editorSDET Job Summary:Our client is looking for a strong, Software Development Engineer in Test to join its Quality Assurance team. This will be a vital role to the team and the candidate must be self-driven, motivated, and passionate about tackling their next challenge! This role will report to the VP of Solutions and Quality and will have autonomy and decision making responsibilities. SDET Job Responsibilities:Participate in requirement meetings and project-related meetings to gain a thorough understanding of project goals and objectivesAnalyze project requirements, identifying gaps and ensuring acceptability for test case creationOwn and develop automated testing tools for our omnichannel suite of solutionsUtilize automated testing tools for the RESTFUL service tied to marketplace integrationsIdentify specific use cases tied to the individual marketplaces and assist in testing those manually as needed, while working on the longer-term automated solutionDevelop automated acceptance and unit test for the agile teamWork with Jenkins and CI tools to automate development, building, deployment, and testingBe a part of the Scrum team and work closely with product owners to understand the requirementsAnalyze test results from a technical standpoint and provide detailed analysis to technology teamTest related support for production issue troubleshooting in collaboration with DevDevelop all test artifacts required as part of the QA deliverables such as test plans, test scripts, strategy, RTM documents, etc.SDET Job Requirements:Four-year degree in Computer Science/Engineering preferred2+ years experience in software quality testing 2+ years of Agile Experience3 years Java Experience preferredExperience in integration platforms preferredDetailed knowledge of all aspects of the Software Development Life Cycle including requirements gathering, design, and testing with experience using current testing methodologies and toolWorking knowledge on JSON and XML messagingExperience with Atlassian tools like JIRA, Confluence, and etc.Experience developing in agile & with CI tools like GitHubRelational database understanding with the ability to query MySQL database to verify the test resultsExposure/working knowledge with Restful automation tools - JMeter/SoapUI/OtherKnowledge and understanding of at least one OOP language, scripting language a plusAbility to work independently and with a team in a fast-paced and dynamic company environment under tight deadlinesExcellent analytical and organizational skills with the ability to multitask on multiple projects at one timeStrong individual initiative and ownership of projects and quality testing tasksPlus: Jest or JasminChai (for assertions)Typescript or JavaScript Visual Studio Code editorJob Key Words:SDET, Software Engineer in Test, QA, JavascriptFrequently Asked Questions:Benefits? Yes, provided the clientRemote Workers? Allows for 2-3 days per week remote Visa Sponsorship? Not offered Corp-to-Corp? Not eligible How to Apply:For immediate attention please apply online.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T20:21:42.000Z"
    },
    "company": {
        "name": "ettain group",
        "link": "https://www.linkedin.com/company/ettain-group"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Alpharetta",
        "region": "GA",
        "postal_code": "30022",
        "street_address": null,
        "latitude": 34.075615,
        "longitude": -84.29455
    }
}