{"location": {"country": "US", "locality": "Boston", "region": "Boston", "postal_code": "02118", "street_address": null, "latitude": 42.358994, "longitude": -71.05863}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Associate Software Engineer", "industry": "Computer Software", "description": "About Us\nLogicMonitor is the leading SaaS-based performance monitoring platform for enterprise IT.\nWe love going to work and think you should too.\nWe are customer-obsessed, work as one team, and strive to be better every day\n. These are our core values. So it's no surprise that we work hard and genuinely have fun working with each other to achieve great things together.\nWe are located in the busy, technical epicenter of Cambridge, MA.\nWe are looking for you to bring your expertise, drive, and passion as we expand our global presence and achieve record-breaking success.\nLogicMonitor is an equal opportunity employer. We’re committed to creating an inclusive environment for all our employees, where different backgrounds and perspectives are valued and encouraged - regardless of race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, gender identity, or sexual orientation.\nWe encourage all people to come as they are\n.\nWe operate with integrity, esteem diversity and treat each other fairly and with respect.\nWe strive to find our own versions of personal and professional harmony through community building and holistic growth.\nWe hear time and time again that our awesome people are a huge part of why LMers chose LogicMonitor, love their teams, and choose to stay.\nTo learn more about life at LogicMonitor, check out our Careers Page .\nWhat You'll Do\nThe Associate Backend Developer on the Engineering team is responsible for the implementation, design, architecture and quality control of business integrations/general development within the customer-facing product application and internal tools used by development technical operations. This includes troubleshooting bugs and implementing new features as required in existing backend applications; even building new components as needed. A successful Associate Backend Developer will produce all required functionality in a timely manner and will communicate and work with colleagues to solve problems and improve the systems they work with.\nHere's a Closer Look At This Key Role\nPrioritize and plan for deliverables in an iterative development strategy.\nDocument, code, and test technical solutions and enhancements for existing systems, bringing a new perspective and a willingness to improve.\nFollow agile software development methodologies for implementation.\nWork with various teams in LogicMonitor to deliver software products that support LogicMonitor's business growth.\nConstantly work towards career growth and learning opportunities. There will be a lot of technologies to absorb and we want someone who is motivated and able to learn quickly.\nTroubleshoot and resolve product/application issues for escalated support cases.\nWhat You'll Need\nProject experience (~1 year) working in Java in a Linux environment\nBS or above degree in computer science or related field.\nFamiliar with latest Java development framework and open-source tools.\nStrong understanding of web application architectures.\nAble to quickly develop competencies, in numerous technologies (learn fast!)\nAbility to work with a development team and develop strong, reliable, and effective relationships with team members", "employment_type": "FULL_TIME", "date_posted": "2021-08-30T22:32:28.000Z"}, "company": {"name": "LogicMonitor", "link": "https://www.linkedin.com/company/logicmonitor"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}