{"location": {"country": "US", "locality": "Hatfield", "region": "Hatfield", "postal_code": "19440", "street_address": null, "latitude": 40.27963, "longitude": -75.299576}, "salary": {"currency": "USD", "min_value": 42100, "max_value": 82200, "unit": "YEAR"}, "job": {"title": "Software Engineer", "industry": "Electrical/Electronic Manufacturing,Mechanical or Industrial Engineering,Consumer Goods", "description": "Company Description\nBrooks Instrument, a global manufacturer of flow and pressure measurement and control products for critical applications, and a division of ITW (A Fortune 200 Company) is seeking candidates for a\nSoftware Engineer\n.\nBrooks maintains manufacturing, sales, and service center facilities around the world, and our products are used in laboratory and process applications in end markets such as: life sciences, petro-chemicals, semiconductor, analytical instrumentation, nuclear, and solar cells.\nJob Description\nBasic Function\nDesign, develop and implement software applications related to manufacturing flow and pressure instruments for both Sustaining and CBI engineering\nEssential Duties And Responsibilities\nWork with manufacturing and service organizations to implement and validate advance calibration processes into production.\nDevelop and/or interpret equipment specifications, complex drawings, schematics, and machine control software.\nDevelop and support custom software using text-based languages.\nOversee outside contractors in developing software and calibration equipment built to Brooks Instrument specifications.\nProvide support to global service centers and factories in troubleshooting and resolving calibration software and system problems.\nSupport continuous improvement initiatives, particularly as related to product quality.\nDevelop/ support software used in manufacturing and calibration.\nDevelop calibration equipment and processes for flow control devices.\nAssign technical personnel to tasks; follows up on tasks.\nCalibration process requirements gathering.\nDesign verification testing of new equipment.\nImplement and validate new equipment at global manufacturing sites and service centers.\nOther duties as assigned.\nQualifications\nKnowledge, Skills And Abilities\nAbility to create new production and processes through analysis of manufacturing operations.\nAbility to use MS software tools such as Word, Excel, Outlook, Power Point, and Project.\nProgramming ability in multiple text-based languages. C#, VB6, VB.Net\nLabview experience a plus.\nAbility to use basic electronics and laboratory equipment.\nAbility to read and interpret mechanical drawings and electronics schematics.\nAbility to get along with others in a team environment.\nAbility to follow all safety procedures.\nEducation And Experience\nBS in Engineering or Computer Science and 4+ years of experience designing production equipment software is required.\nRelated experience or training in the following areas is desired: industrial instrumentation, metrology, calibration.\nUnderstanding of process control instrumentation.\nUnderstanding of the following engineering methods: process mapping, process variation, root cause analysis and measurement uncertainty analysis.\nExcellent verbal and written English communication skills required.\nAdditional Information\nOur employees enjoy competitive, merit-based salary plus excellent benefits including:\nHealth and dental insurance\nCompany Paid Life Insurance / Short and Long Term Disability\n401K plan with generous company match\nVacation, personal days and holidays\nContinuing education reimbursement program\nFlexible spending accounts\nThe opportunity to join a well-established (70 + years in business) yet dynamically changing organization that works together as a team to meet the challenges of satisfying customers’ needs and managing rapid growth to better compete in a global marketplace.\nPlease visit our website: http://www.brooksinstrument.com/\nITW Company Overview\nITW was built on innovation and the strength of new ideas. These values have helped us expand into multiple platforms in nearly 60 countries. But at each of our businesses, the independent entrepreneurial spirit and freedom to innovate remain strong. It’s the highly talented people at ITW businesses all over the world who drive our success through new products and customer driven solutions. Together, we are ITW—a Fortune 200 company that has prospered for 100 years, and changed the way people live and work, all over the world.\nBrooks Instrument is an Equal Opportunity Employer / Affirmative Action employer. All qualified applicants will receive consideration for employment without required to race, color, religion, sex, national origin, disability, or protected Veteran status.", "employment_type": "FULL_TIME", "date_posted": "2021-08-10T00:00:00.000Z"}, "company": {"name": "Brooks Instrument", "link": "https://www.linkedin.com/company/brooks-instrument"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 48, "seniority_level": "Mid-Level"}}