{
    "job": {
        "title": "Recruiter/Sales Trainee",
        "industry": "Staffing and Recruiting,Consumer Services",
        "description": "Why Aston Carter?Aston Carter is a part of Allegis Group, the #1 Staffing Agency in the United States.&amp;nbsp;We are a privately held organization with 250+ offices nationwide, and work with 95% of the Fortune 500 companies.&amp;nbsp;Working at Aston Carter and why you will love it…We are a team of driven people who push ourselves and those around us to develop personally and professionally. At Aston Carter, you can expect a dynamic and competitive work environment. To ensure your success, you will take part in a comprehensive training program, surrounded by a positive and supportive culture that encourages everyone to help develop themselves and others.&amp;nbsp;Aston Carter promotes exclusively from within; the majority of the people who start as a Recruiter advance into our sales career path.&amp;nbsp;As a Recruiter you will impact both our candidates and customers by finding the right people for the right jobs. You will…  - Identify qualified candidates through various recruiting and sourcing tools   \n  - Screen and interview qualified candidates   \n  - Partner with your Account Manager to identify top accounts, target skill sets, and key market segments   \n  - Build and maintain relationships with industry contacts to gain&amp;nbsp;knowledge and generate referrals and sales leads   \n  - Perform various customer service related activities   \n  - Give back to your community by volunteering and partnering with various philanthropic organizations   \nLet’s talk money and perks!Aston Carter offers a base salary of $45,000 with unlimited earning potential through commissions after the hourly training period.&amp;nbsp;Upon one year of employment, you will also receive a raise in your base salary.&amp;nbsp;Additional benefits include (but not limited to):  - Healthcare benefits   \n  - Dental, Vision & 401(k)   \n  - Paid time off   \n  - Employee discounts   \nPerformance based incentives:  - Quarterly bonuses   \n  - All-expense paid trip   \n  - Company funded investment plan   \nDo you have the following?  - Bachelor’s Degree (preferred)   \n  - Customer or sales focused experience   \n  - Collaborated in a team-oriented environment   \n&amp;nbsp;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:24:43.000Z"
    },
    "company": {
        "name": "Aston Carter",
        "link": "https://www.linkedin.com/company/aston-carter"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Cleveland",
        "region": "OH",
        "postal_code": "44144",
        "street_address": null,
        "latitude": 41.505547,
        "longitude": -81.6915
    }
}