{"location": {"country": "US", "locality": "Haymarket", "region": "Haymarket", "postal_code": "20168", "street_address": null, "latitude": 38.81271, "longitude": -77.63754}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Sr. Applications Developer", "industry": "Internet", "description": "Raytheon is seeking an Applications Developer to support applications development and operations and maintenance of a variety of systems and initiatives focused on streamlining operations, automating processes, and aligning customer solutions to the overarching digital architecture. The ideal candidate will help promote state-of-the-art IT solutions, collaborating with IT mission partners to share technology and lessons learned and ensure records management processes and requirements are included in the early design stages of IT solutions across the Intelligence Community. Additionally, this individual will work in concert with the customer technical interfaces to ensure future plans for technology are in line with the plans for the overall customer architecture. Required Skills:\n10 Years of demonstrated experience dealing with customers;\nMust possess \"people skills\"\nProficient in Java\nExperience with JavaScript / Typescript\nExperience with application frameworks (Spring Boot, NodeJS-NestJS); Experience developing applications with the Node.js framework\nExperience with Python\nMust know to use an IDE to code (ex\nIntelliJ, Eclipse, NetBeans)\nHands on experience with cloud technology (AWS / C2S)\nExperience with web services (REST) and service oriented architecture (SOA)\nSpring Boot, Tomcat\nExperience with relational databases (ex\nOracle / Postgres)\nExperience with interacting in a Linux environment (ex\nBash scripting, VI)\nAbility to work well with others as well as independently (MUST leave ego at the door)\nAbility to work well in a constantly evolving, fast paced work environment\nBS/BA in Software Engineering, Science, Mathematics, or similar OR equivalent combination of education and experience Desired Skills:\nExperience with Microservices\nExperience with front end development using Angular 10\nFamiliarity with Source code management and integration (ex\nGitHub/GitLab, Jenkins)\nExperience in an Agile environment CTSp1 182047 Raytheon is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, sexual orientation, gender orientation, gender identity, national origin, disability, or protected Veteran status.", "employment_type": "FULL_TIME", "date_posted": "2021-08-01T06:41:42.000Z"}, "company": {"name": "JobGet", "link": "https://www.linkedin.com/company/jobget"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 120, "seniority_level": "Lead"}}