{"location": {"country": "US", "locality": "Phoenix", "region": "Phoenix", "postal_code": "85009", "street_address": null, "latitude": 33.448204, "longitude": -112.072586}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Java Software Engineer-Web Services-Mid Level", "industry": "Financial Services,Information Technology and Services", "description": "Purpose of Job\nWe are currently seeking talented Java Software Engineers – Mid Level for our Phoenix, AZ facility, for teams inside our Chief Administrative Office Group.\nUSAA Java Software Engineers create and maintain APIs for our business software applications that our members use. Done well, many may never realize or appreciate how critical these APIs are or how we've made them simpler. Faster. Safer. Yet they help make our members' lives better. It's a great challenge and responsibility.\nHere, you will invent. You'll design and test. You'll take risks. You'll create new technology, but the impact you'll make on our members will be far more significant.\nAs a Java Engineer, it will be your responsibility to maintain code integrity and quality.\nJob Requirements\nAs a Java Engineer, you are expected to be able to function in a fast-paced environment driving innovation through rapid prototyping and iterative development ensuring quality is built into all solutions leveraging TDD. Your responsibilities will require you to be knowledgeable in API development. You will be a part of teams of developers guiding on engineering and architecture best practices as well as demonstrate the ability to partner and engage with other engineers and architects. You will work closely with business clients and UI designers to analyze user requirements, code applications and customize and/or integrate commercial software packages for both internal employees and external member-facing applications across multiple platforms.\nAs a Java Engineer, it will be your responsibility to maintain code integrity and quality.\nThis Job Posting is for multiple openings available in 2021.\nAbout USAA\nUSAA knows what it means to serve. We facilitate the financial security of millions of U.S. military members and their families. This singular mission requires a dedication to innovative thinking at every level.\nUSAA Careers – World Class Benefits (31 seconds)\nPrimary Responsibilities\nIdentifies and manages existing and emerging risks that stem from business activities and the job role.\nEnsures risks associated with business activities are effectively identified, measured, monitored, and controlled.\nFollows written risk and compliance policies and procedures for business activities.\nDesign, develop, code, and test complex technical solutions collaborating with senior engineers.\nMay lead code/design reviews to ensure smooth daily operations and accurate planning at a team level.\nMay begin to organize work and lead team to deliver features and solutions.\nResolves complex production issues with independence by troubleshooting complex applications and systems independently.\nMay begin mentoring junior engineers.\nWhen you apply for this position, you will be required to answer some initial questions. This will take approximately 5 minutes. Once you begin the questions you will not be able to finish them at a later time and you will not be able to change your responses.\nMinimum Requirements\nBachelor's degree in related field of study OR Certification from an approved technical field of study OR 4 additional years of I/T experience beyond the minimum required in lieu of a degree.\nAND, 4+ years of software engineering/development experience utilizing Java with at least 1 years’ experience working with REST Web Services.\nPreferred Experience\n2+ years in REST frameworks with focus on API development\n2+ years in AGILE methodology\n1+ years experience working with JavaScript\n2+ years experience integrating with backend services like JMS, J2C, ORM frameworks (Hibernate, JPA, JDO, etc), JDBC.\nExperience building APIs with Spring Boot\nExperience with event driven frameworks such as Kafka, RabbitMQ, IBM MQ\nAbility to implement container based APIs using a container frameworks OpenShift, Docker, or Kubernetes.\nRelational Database design and optimization with Oracle DB2, MySQL, Postgress\nFamiliar with Gradle, GIT, GitHUB, GITLab, etc. around continuous integration and continuous delivery infrastructure\nExperience testing in REST services\nExperience in design and develop automated test framework\nDesired Characteristics\nUSAA Java Engineers create innovative solutions that impact our members. Collectively, we are:\nCurious and excited by new ideas\nEnergized by a fast-paced environment\nAble to understand and translate business needs into leading-edge technology\nComfortable working as part of a connected team, but self-motivated\nCommunity-focused, dependable and committed\nExceptionally detail-oriented\nThe above description reflects the details considered necessary to describe the principal functions of the job and should not be construed as a detailed description of all the work requirements that may be performed in the job.\nCompensation\nUSAA has an effective process for assessing market data and establishing ranges to ensure we remain competitive. You are paid within the salary range based on your experience and market position. The salary range for this position is: $88,200.00 - $158,900.00 *( this does not include geographic differential it may be applied based on your work location)\nEmployees may be eligible for pay incentives based on overall corporate and individual performance or at the discretion of the USAA Board of Directors.\nGeographical Differential: Geographic pay differential is additional pay provided to eligible employees working in locations where market pay levels are above the national average.\nShift premium:\nwill be addressed on an individual-basis for applicable roles that are consistently scheduled for non-core hours.\nBenefits:\nAt USAA our employees enjoy best-in-class benefits to support their physical, financial, and emotional wellness. These benefits include comprehensive medical, dental and vision plans, 401(k), pension, life insurance, parental benefits, adoption assistance, paid time off program with paid holidays plus 16 paid volunteer hours, and various wellness programs. Additionally, our career path planning and continuing education assists employees with their professional goals.\nPlease click on the link below for more details.\nUSAA Total Rewards\nRelocation\nassistance is\nnot\navailable\nfor this position.", "employment_type": "FULL_TIME", "date_posted": "2021-09-02T06:08:29.000Z"}, "company": {"name": "USAA", "link": "https://www.linkedin.com/company/usaa"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 48, "seniority_level": "Mid-Level"}}