{
    "job": {
        "title": "Software Engineer In Test",
        "industry": "Internet",
        "description": "About GameChanger:We believe sports are important because they encourage leadership, teamwork, responsibility, and confidence—critical life lessons that have the power to propel our youth toward meaningful futures. We recognize that without coaches, parents, and volunteers, organized youth sports could not exist. We celebrate those dedicated heroes and make it our mission to help them do what they do best.GameChanger provides teams across the country with team management and scorekeeping capabilities, as well as live fan experiences that keep parents, family, and friends engaged as games are announced, animated, and video streamed in real-time. With GameChanger, coaches and parents are able to organize and follow their athlete’s journey in a simple and powerful way.Based in downtown Manhattan, GameChanger is a cutting-edge technology company and a proud member of the DICK’S Sporting Goods family.The Position: As an SDET, you will work with our Platform team to ensure that iOS, Android, and web applications meet our high standards for quality. You will be responsible for building test automation frameworks and maintaining the test suites across our platforms. This is a full-time position within GameChanger’s Engineering Department and can be located either remotely throughout the US or at our headquarters in NYC.What You’ll Do:Lead quality assurance on our fast-paced Platform teamEstablish and maintain an automated test environment for UI testing for our Android, iOS, and Web appsIntegrate with test case management, bug tracking, source control, and continuous integration platformsEducate team members on test automationDesign, document, execute and troubleshoot automated test scenariosEstimate test efforts, analyze and communicate test results and participate in QA activities Identify required improvements in the test and development processes and make contributions to our automation tools Coordinate with Platform team and engineers to deliver stable product releasesLearn and understand release processes while improving, and expanding our test coverageContribute to planning sessionsDocument issues using a bug-tracking systemCommunicate issues found, concerns, and feedback back to the team Manage release processesWho You Are:3+ years experience in building automated testing frameworks, including for iOS and Android native appsExperience in test automation scripting using Python, Espresso (Java), XCUI Test (Swift), and Selenium Experience in API testing, load testing, performance testing, and security testingExperience working in an Agile development processExperience testing iOS and Android native appsPositive energy and a friendly collaborative attitudeSelf-starter who has good attention to detail and qualityAbility to trade-off getting tasks done with stepping back to see the big picturePrecision in isolating issues and identifying steps to reproduceSound judgment and problem-solving abilitiesBachelor’s Degree in Computer Science Perks:Work remotely or from our well-furnished, modern office in NYC’s FiDiUnlimited vacation policy.Technology stipend - $3,500 every 2 years to purchase new technology.Full health benefits - medical, dental, vision, prescription, FSA/HRA, etc., as well as coverage for family/dependents.Life insurance - basic life, supplemental life, and dependent life.Disability leave - short-term disability and long-term disability.Retirement savings - 401K plan offered through Vanguard.Generous maternity/paternity leave.Commuter benefits.DICK’S Sporting Goods Teammate Discount.We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.In your cover letter, please tell us why you're interested in the SDET position and GameChanger.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:37:28.000Z"
    },
    "company": {
        "name": "GameChanger",
        "link": "https://www.linkedin.com/company/gamechangermedia"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "New York City Metropolitan Area",
        "region": null,
        "postal_code": "10021",
        "street_address": null,
        "latitude": 40.748295,
        "longitude": -73.98556
    }
}