{
    "job": {
        "title": "React Native Engineer",
        "industry": "Information Technology and Services",
        "description": "Codesmith is hiring driven, curious engineers who have a passion for cranking out amazing applications to join our growing team. We are currently looking for a React Native Engineer. We work as team players, helping our teammates succeed in knocking out amazing features and helping our clients’ ideas come to life by building robust mobile and web applications. Our goal is to build amazing solutions for our clients.&amp;nbsp;We are based just outside Atlanta, GA in Sandy Springs and currently are open to employees working in-office and at home throughout the week if flexibility is needed. We also understand you may not live in our city and want to work Remote full-time, we are open to that as well.&amp;nbsp;   Job Description:     - Architect, build and maintain excellent React Native applications with clean code.   \n  - Implement pixel perfect UI's that match designs.   \n  - Implement clean, modern, smooth animations and transitions that provide an excellent user experience.   \n  - Integrate third-party API’s.   \n  - Write unit and integration tests.   \n  - Release applications to the Apple and Google Play stores.   \n  - Work with native modules when required.   \n  - Work as part of a small team, which will include other native mobile developers, a project manager, development manager,&amp;nbsp;and a UI/UX designers.   \n  - Complete two-week sprints, and participate in sprint retrospectives and daily standups.   \n  - Assist with building estimates.   \n  - Interface with clients via Slack, Zoom, and email.   \n  - Work with modern tools including Jira, Slack, Bitbucket, Google Docs, etc.   \n  - Follow Codesmith’s detailed development process   \n   Requirements:     - 2+ years of professional experience working with React Native.   \n  - 4+ years of professional software development experience.   \n  - Experience working with Swift, Objective C, and Java a plus but not required.   \n  - Meaningful experience working on complex systems.   \n  - Ability to take extreme ownership over your work.&amp;nbsp;   \n  - Ability to identify with the goals of Codesmith’s clients and dedicate yourself to delivering on the commitments you and&amp;nbsp;your team make to them.   \n  - An understanding of React Native best practices and a commitment to following them.   \n  - Ability to work through new and difficult React Native issues and contribute to libraries as needed.   \n  - Ability to create and maintain continuous integration and delivery of React Native applications.   \n  - A positive mindset and can-do attitude.   \n  - Attention to detail.   \n  - English skills (ability to effectively communicate via written and spoken english).   \n  - A passion for software development. It’s not just your career, it’s also your hobby. You’re constantly striving to learn new&amp;nbsp;things and improve.&amp;nbsp;   \n  - You follow industry news, regularly tinker&amp;nbsp;with new technologies, read books&amp;nbsp;and blogs to keep your skills current.   \n   What makes Codesmith a great place to work...     - We are ok with you being yourself!   \n  - We provide Unlimited PTO   \n  - We currently are allowing employees to work Hybrid or Remote. We are flexible!   \n  - We provide great Medical/Dental/Vision insurance options to meet you and/or your family's needs   \n   We are Codesmith   our missionOur mission is to enjoy what we do and deliver a happy work-life balance.&amp;nbsp;   our visionOur vision is for Codesmith to become the most respected and sought-after software professional services agency in Atlanta.   our driving beliefAt Codesmith, we believe in the “concierge” approach to what we do. This involves high communication, high visibility and cost benefit solutions. What is expected is what we deliver. Converting clients to partners is the end game.   our valuesOur value system is the secret recipe for our success and developing long term partnerships.&amp;nbsp;   COMMUNICATION: we are always on the same page.   VISIBILITY: we make sure you are part of the process.&amp;nbsp;   IMPACT: we move the productivity meter.   ENGAGE: we understand, deliver, and drive.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:35:43.000Z"
    },
    "company": {
        "name": "Codesmith",
        "link": "https://www.linkedin.com/company/codesmithdev"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Junior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Atlanta",
        "region": "GA",
        "postal_code": "30355",
        "street_address": null,
        "latitude": 33.748547,
        "longitude": -84.3915
    }
}