{"location": {"country": "US", "locality": "Sunnyvale", "region": "Sunnyvale", "postal_code": "94089", "street_address": null, "latitude": 37.373676, "longitude": -122.036575}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer III", "industry": "Information Technology and Services,Retail,Financial Services", "description": "Position Summary... What You'll Do...\nWhat you'll do...\nImagine working in an environment where one line of code can make life easier for hundreds of millions of people and put a smile on their face. That’s what we do at Walmart Global Tech. We’re a team of 15,000+ software engineers, data scientists and service professionals within Walmart, the world’s largest retailer, delivering innovations that improve how our customers shop and empower our 2.2 million associates. To others, innovation looks like an app, service or some code, but Walmart has always been about people. People are why we innovate, and people power our innovations.\nBeing human led is our true disruption.\nWe're looking for a Software Engineer to join International Cart and Checkout team . Want to change how different countries shop online? Then keep reading!\nAbout You\nYou are a passionate back-end engineer who loves to code. You love to take ideas and build great server-side code with Java, Spring and other frameworks. You might like to talk about obscure computer science topics, but really, you just want to write simple code and ship new products and features to customers (or improve existing ones).\nYour focus is on backend distributed Java code, which is readable, performant, supportable You are curious and are always ready to learn new things and solve hard problems.You are passionate about code reviews and contribute towards high quality code\nThings You will do\nThat Said, Here Are Some Things You'll Do\nWalmart International is a diverse and fast-growing business unit, so you'll get experience on many different projects across the organization.\nBuild reusable artifacts which can be used across micro services.\nRefactor or improve existing code. We constantly find ways to improve all of our Java code and you are all aboard.\nWork closely with our product, design performant solutions for customers\nDemonstrate technical expertise in solving challenging programming and design problems\nShare what you know and learn either one-on-one or with lightning talks to the group.\nWork boldly with a sense of urgency; embrace mistakes, learn from them, and drive the team toward success\nMinimum Qualifications\n2+ years of experience in object-oriented design and software development using Java 8 and above\n1+ Experience with spring boot.\n2+ years of experience with Databases (SQL/NOSQL)\n1+ years of experience in creating and/or consuming RESTful web service using Java , spring based frameworks\nBS/MS in computer science or equivalent work experience\nExperience with messaging (e.g. Kafka, JMS, etc.) and event-driven architecture is plus\nPreferred Requirements\nSolid grasp of various software design patterns and distributed computing.\nPrior knowledge of Junit/TestNG for unit testing application.\nSolid understanding of relational and non-relational database technologies (SQL and Cosmos DB), data modeling and RESTful web APIs.\nFamiliar in working with collaborative environment using Agile SCRUM practices.\nWorking Knowledge of multithreading apis (Completable Future)\nMinimum Qualifications...\nOutlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications.\nBachelor’s degree in Computer Science and 2 years’ experience in software engineering or related field OR 4 years’ experience in software engineering or related field. Preferred Qualifications...\nOutlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications.\nMasters: Computer Science Primary Location...800 W California Ave, Sunnyvale, CA 94086, United States of America", "employment_type": "FULL_TIME", "date_posted": "2021-07-30T05:13:40.000Z"}, "company": {"name": "Walmart", "link": "https://www.linkedin.com/company/walmart"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}