{"location": {"country": "US", "locality": "San Francisco", "region": "San Francisco", "postal_code": "94121", "street_address": null, "latitude": 37.78008, "longitude": -122.42016}, "salary": {"currency": "USD", "min_value": 115000, "max_value": 218000, "unit": "YEAR"}, "job": {"title": "Staff Software Engineer, Data Visibility &amp; Attestation (Security)", "industry": "Computer Software,Internet,Financial Services", "description": "Company Description\nSquare builds common business tools in unconventional ways so more people can start, run, and grow their businesses. When Square started, it was difficult and expensive (or just plain impossible) for some businesses to take credit cards. Square made credit card payments possible for all by turning a mobile phone into a credit card reader. Since then Square has been building an entire business toolkit of both hardware and software products including Square Capital, Square Terminal, Square Payroll, and more. We’re working to find new and better ways to help businesses succeed on their own terms—and we’re looking for people like you to help shape tomorrow at Square.\nJob Description\nAsset management is a core tenet of Information Security, traditionally captured through hardware and software asset management. As the company grows, data increasingly becomes an important asset that requires active tracking and management in order to ensure we are building and maintaining appropriate data protection.\nAs a Tech Lead on the Privacy Engineering team, you will define the broad direction and future of the Data Visibility/Attestation group, which is focused on building out and continuously improving the accuracy of our data inventory as our systems continue to evolve in number and complexity. You will operate on the critical path of surfacing data risk on all Square products and business units, and will have a direct impact on the success of security and privacy of data at Square. In this role, you will closely work with many teams across Square, including other teams within security, as well as platform engineering, product engineering, data science, and counsel.\nYou Should Expect To\nCollaborate with leaders across security, platform, data science, and counsel to translate data visibility requirements into technical solutions\nDesign, develop, and test high-quality services or infrastructure that support long-term data visibility/attestation needs across the organization\nSet broad direction and vision, influence engineering and business strategy, and establish practices to efficiently and effectively address data security and privacy needs across Square’s engineering ecosystem\nProvide mentorship and reviews for engineering teams working with data visibility/attestation technologies\nWork with the engineering manager to oversee the success of the team's projects and deliver quantifiable results\nQualifications\nSome qualifications you may have:\n8+ years of hands on software engineering experience\nExcellent software engineering knowledge and the ability to provide technical mentorship and guidance\nA high bar for writing quality scalable, robust, and testable code\nRelevant engineering experience in data inventorying and classification to support security and privacy processes at scale\nExperience collaborating with security and engineering cross-functional leaders\nAbility to learn new technologies and languages\nAbility to cut across new or existing services, infrastructure, or frameworks to achieve security and privacy goals\nStrong communication skills. You’re adept at understanding complex technical concepts and helping your team make decisions to move forward, as well as communicating those decisions up.\nEffective remote collaboration skills with distributed teams.\nAs a bonus, you may have experience or interest in:\nDeveloping incident response processes or tooling\nDeveloping or maintaining processes to meet data governance needs\nBuilding novel visualizations to understand data flow, access control, and risk\nAdditional Information\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Square is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, veteran status, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible.\nAdditionally, we consider qualified applicants with criminal histories for employment on our team, assessing candidates in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.\nPerks\nAt Square, we want you to be well and thrive. Our global benefits package includes:\nHealthcare coverage\nRetirement Plans\nEmployee Stock Purchase Program\nWellness perks\nPaid parental leave\nPaid time off\nLearning and Development resources\nSquare, Inc. (NYSE: SQ) builds tools to empower businesses and individuals to participate in the economy. Sellers use Square to reach buyers online and in person, manage their business, and access financing. Individuals use Cash App to spend, send, store, and invest money. And TIDAL is a global music and entertainment platform that expands Square's purpose of economic empowerment to artists. Square, Inc. has offices in the United States, Canada, Japan, Australia, Ireland, Spain, Norway, and the UK.", "employment_type": "FULL_TIME", "date_posted": "2021-09-08T03:07:06.000Z"}, "company": {"name": "Square", "link": "https://www.linkedin.com/company/joinsquare"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 96, "seniority_level": "Senior"}}