{"location": {"country": "US", "locality": "Bellefonte", "region": "Bellefonte", "postal_code": "16823", "street_address": null, "latitude": 40.913406, "longitude": -77.76475}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Corporate Controller", "industry": "Chemicals", "description": "Restek\nis hiring a\nCorporate Controlle\nr. The Corporate Controller will direct, maintain and oversee the global finance and accounting operations of the company, including corporate accounting, financial reporting, budget preparation, as well as development of internal control policies and procedures. This position provides leadership and guidance to Accounting and Finance department staff.\nJob Duties\n:\nSupervise and manage Restek’s global accounting and finance team to ensure that transactions are in accordance with generally accepted accounting principles, statutory requirements, and company policy.\nManage all global, accounting operations including Invoicing, A/R, A/P, General Ledger, Cost Accounting, Revenue Recognition and Payroll.\nCoordinate the preparation and publishing of consolidated monthly and annual financial information.\nDevelop and document global business processes and accounting policies to maintain and strengthen internal controls.\nDesign and maintain the cost accounting system, including the development of standard costs and monitoring of variances.\nResponsible for the accuracy and effectiveness of Restek’s global financial systems, including IFS.\nManage the preparation of information and coordinated effort required by Restek’s external auditor for year-end financial reporting.\nCoordinate and direct the preparation of the annual budget.\nEnsure compliance with local, state and federal government reporting requirements and tax filings.\nEnsure the accuracy of internal and external recording and reporting of financial transactions.\nProvide analysis, accounting guidance and strategic insight to the Leadership Team, Company managers and all other internal customers on a proactive and as-requested basis.\nMaintain an in-depth understanding of Restek’s business in order to derive clear and succinct analyses of the ongoing financial performance.\nParticipate in the annual company valuation process, providing financial data to the valuation consultants, reviewing data from the TPA for employee allocation of the company match and ESOP transactions. Participate in related 401k/ESOP audits.\nRecruit, motivate and lead a high performing accounting and finance staff. Serve as a resource to staff in order to facilitate their professional development. Maintain personnel structure and staffing level to accomplish work objectives in an effective and efficient manner.\nExemplify Restek’s Expectations of Leaders. Promote a high level of ethical awareness and conduct.\nPerform other duties as assigned.\nQualifications:\nEducation/Experience:\nBachelor’s degree in Finance or Accounting or related field required, MBA preferred\nProven working experience as a Financial Controller\nAt least 10 years of progressively responsible experience in accounting, preferably in a manufacturing environment\nExperience in working with multiple, international legal entities\nAt least 5 years’ experience leading a Finance team preferred\nKnowledge, Skills, & Abilities:\nKnowledge of US GAAP required\nDemonstrated knowledge of manufacturing accounting processes and procedures\nStrong people manager who can evidence prior development of staff\nExcellent interpersonal and written/verbal communication skills with the ability to relate well and cooperate with others to effectively coordinate activities and accomplish goals\nStrong analytical skills, decision-making skills and up-to-date technical skills\nStrong focus on controls and processes and high attention to detail\nExcellent Microsoft Office skills, including Word, Excel and PowerPoint\nDemonstrated proficiency in a global ERP, preferably IFS\nAbility to work independently and in a team environment\nRestek provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation and gender identity, national origin, age, disability, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state, and local laws.\nRestek complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. As an employer with an Affirmative Action Program, Restek complies with government regulations, including Affirmative Action responsibilities, where they apply. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.", "employment_type": "FULL_TIME", "date_posted": "2021-08-25T17:24:55.000Z"}, "company": {"name": "Restek Corporation", "link": "https://www.linkedin.com/company/restek-corporation"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 120, "seniority_level": "Lead"}}