{"location": {"country": "US", "locality": "Annapolis", "region": "Annapolis", "postal_code": "21403", "street_address": null, "latitude": 38.97829, "longitude": -76.49568}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer (TS/SCI with Full Scope Poly Required)", "industry": "Government Administration", "description": "If you are a Software Engineer with an active, TS/SCI Clearance and a Full Scope Poly, please read on!\nWe're a government contractor based in Maryland that is currently supporting a client who needs a Software Engineer in Annapolis Junction, MD.\nThis person must have an active, TS/SCI Clearance with a Full Scope Poly and be comfortable working on-site.\nWhat's In It for You\nCompetitive salary\nCompany benefits and more!\nWhat You Will Be Doing\nWork with the government, software engineers, and system engineers\nDesign, develop, install, deploy, operate, and manage software systems\nWhat You Need for this Position\n5+ years as a software developer\nActive TS/SCI Clearance with a Full Scope Polygraph\nStrong React.js\nStrong Node.js\nOther Preferred Skills\nMongoDB\nDocker\nElasticsearch\nREduc with selectors\nSo, if you are a Software Engineer with an active, TS/SCI Clearance and a Full Scope Poly, please apply today!\nEmail Your Resume In Word To\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nDaniel.Chavez@CyberCoders.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : DC6-1643898 -- in the email subject line for your application to be considered.***\nDaniel Chavez - Sr. Executive Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\nYour Right to Work\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\nCyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.", "employment_type": "FULL_TIME", "date_posted": "2021-07-31T07:19:59.000Z"}, "company": {"name": "CyberCoders", "link": "https://www.linkedin.com/company/cybercoders"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}