{
    "job": {
        "title": "Data Scientist",
        "industry": "Consumer Goods",
        "description": "ABOUT TTITechtronic Industries is a fast-growing world leader in Power Tools, Accessories, Hand Tools, Outdoor Power Equipment, and Floor Care for Do-It-Yourself (DIY), professional and industrial users in the home improvement, repair, maintenance, construction, and infrastructure industries. The Company is committed to accelerating the transformation of these industries through superior environmentally friendly cordless technology. At TTI Anderson, our brands RYOBI and HART are recognized worldwide for their deep heritage and cordless product platforms of superior quality, outstanding performance, safety, productivity, and compelling innovation.&amp;nbsp;JOB SUMMARYData Scientist will analyze large amounts of raw information to find patterns that will help improve the TTI business. TTI business will rely on the data scientist to build data products to extract valuable business insights.In this role, you should be highly analytical with a knack for analysis, math, and statistics. Critical thinking and problem-solving skills are essential for interpreting data. We also want to see a passion for machine-learning and research. As a Data Scientist, you need to design, develop, and deploy the most relevant solutions for TTI business and share the results with stakeholders. This requires preparing Big Data, implementing relevant data models, and creating databases to support TTI business solution. Your goal will be to help TTI business analyze trends to make better decisions.   RESPONSIBILITIES / SKILLS&amp;nbsp;  - Identify valuable data sources and automate collection processes   \n  - Undertake preprocessing of structured and unstructured data   \n  - Analyze large amounts of information to discover trends and patterns   \n  - Build predictive models and machine-learning algorithms   \n  - Present information using data visualization techniques   \n  - Propose solutions and strategies to business challenges   \n  - Collaborate with engineering and product development teams   \n  - Your goal will be to help our company analyze trends to make better decisions.   \n  - Work with stakeholders to determine how to use business data for valuable business solutions   \n  - Search for ways to get new data sources and assess their accuracy   \n  - Create custom data models and algorithms   \n  - Use predictive models to improve customer experience, ad targeting, revenue generation, and more   \n  - Develop the organization’s test model quality and A/B testing framework   \n  - Coordinate with various technical/functional teams to implement models and monitor results   \n  - Develop processes, techniques, and tools to analyze and monitor model performance while ensuring data accuracy   \nThis job description is intended to be illustrative of the position's duties and should not be construed to be an exhaustive statement of the essential functions of the job.&amp;nbsp;CRITICAL SUCCESS FACTORS  - Interpersonal Skills – ability to quickly establish rapport and credibility with IT project team members and key business contacts.   \n  - Communication Skills – ability to effectively exchange ideas and information with project participants and clearly present issues, findings, recommendations, strategies, and results both orally and in writing to all levels of the organization, and especially to executive levels.   \n  - Business Analysis – ability to gather complex business requirements and translate to technical design specifications.   \n  - Project Management, execution, and delivery skills – successful and timely completion of projects of moderate to large scale complexity through proven project managements tools and techniques.   \n  - Technical Skills – demonstrates knowledge and expertise with state-of-the-art software tools and an ability to evaluate new tools for fit and application to solve evolving business requirements.   \n  - Business Knowledge – awareness of business, particularly in the assigned area of responsibility.   \n  - Decision Making Skills – under general guidance, ability to make effective decisions which are derived by evaluating various alternatives against business and technology requirements.   \n  - Change Management – uses proven methodology to engage business partners in embracing different ways of doing things.   \n  - Analytical Skills – ability to analyze and effectively integrate complex information on business and technology issues and requirements into viable solutions.   \n&amp;nbsp;EDUCATION AND EXPERIENCE&amp;nbsp;  - Proven experience as a Data Scientist or&amp;nbsp;Data Analyst   \n  - Experience in data mining   \n  - Understanding of machine-learning and operations research   \n  - Knowledge of R, SQL, and Python; familiarity with Scala, Java or C++ is an asset   \n  - Experience using business intelligence tools (e.g. Tableau) and data frameworks (e.g. Hadoop)   \n  - Analytical mind and business acumen   \n  - Strong math skills (e.g. statistics, algebra)   \n  - Problem-solving aptitude   \n  - A natural inclination toward solving complex problems   \n  - Experience using and developing data architectures   \n  - Knowledge of Machine Learning techniques, including decision tree learning, clustering, artificial neural networks, etc., and their pros and cons   \n  - Knowledge and application experience in advanced statistical techniques and concepts, including, regression, distribution properties, statistical testing, etc.   \n  - Good communication skills to promote cross-team collaboration   \n  - Impulse to learn and master new technologies   \n  - Experience/knowledge in statistics and data mining techniques, including, random forest, GLM/regression, social network analysis, text mining, etc.   \n  - Experience with major web services, including S3, Spark, Redshift, etc.   \n  - Experience/knowledge in distributed data and computing tools, including, MapReduce, MySQL, Hadoop, Spark, Hive, etc.   \n  - Ability to use data visualization tools to showcase data for stakeholders    \n  - BSc/BA in Computer Science, Statistics, Math, Engineering, or relevant field; graduate degree in Data Science or quantitative field is preferred   \n   OTHER REQUIREMENTS  - Ability to travel (post-COVID) up to 10%.&amp;nbsp;&amp;nbsp;It is anticipated this position will travel 0-10%   \n         PHYSICAL REQUIREMENTS: if applicable, select one & change pounds  - Prolonged periods of sitting at a desk and working on a computer.   \n  - Must be able to lift up to 30 pounds at times.   \n&amp;nbsp;The above statements are intended to describe the general nature and level of work performed by employees assigned to this position. This document is subject to change at any time and is not intended to be exhaustive of all duties, responsibilities, and skills required by employees with this position title.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T15:18:03.000Z"
    },
    "company": {
        "name": "Techtronic Industries - TTI",
        "link": "https://www.linkedin.com/company/techtronic-industries"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Greenville-Spartanburg-Anderson",
        "region": "South Carolina Area",
        "postal_code": "29601",
        "street_address": null,
        "latitude": 34.842274,
        "longitude": -82.408165
    }
}