{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Are you someone who connects the unconnectable? Pioneers new technology and innovation tech with modern thinking? Do you have a copy of CODE COMPLETE book written by Steve McConnell next to your night stand? Then keep reading because ourÂ Software DeveloperÂ position could be just the role for you!*Job in a nutshell:Develop software to integrate with internal back-end systems.Snapshot of what else you will do:Analyze information to determine, recommend, and plan installation of a new system or modification of an existing systemAnalyze software requirements to determine feasibilityConfer with business analyst to design systems and to obtain information on project limitations and capabilities, performance requirements and interfacesImplement integrations between softwareDeploy updates and fixesInvestigate and resolve technical issuesDevelop procedures and tools to reduce occurrences of errors and improve customer experienceDocument integrations and flowsAs a small growing business you will help in these areas:Provide level 2 technical supportAssess server setup and usageModify software programs to improve performanceImprove automationMonitor and improve networks and serversWhat we are looking for:BS in Computer Science, Information technology or related field required. Equivalent work experience and education in lieu of a degree will be considered4 years Software Development/Engineering or relevant work experience requiredExperience in JavaScript, PHP and cloud based infrastructure (AWS strongly desired)Working knowledge of databases and MySQLStrong curiosity and problem-solving attitudeSelf-motivated, accountable, and team mentalityKnowledge of Laravel, Livewire, Tailwind and Salesforce a plusWho we are:AtÂ Pattern, we have a passion for helping doctors. We believe, as doctors and our team make better decisions, lives are changed.Â Tech plays a major role in helping our teamâs success and serving our clients.Â AtÂ Pattern, we have a Fun-fessional culture. Donât let the Fun fool you. We are growing fast and have big goals! We perform at a high level and like having fun together while doing it.Â Still interested?Â GREAT! APPLY NOW, we would love to learn more about you!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T03:45:07.000Z"
    },
    "company": {
        "name": "Club Wealth®",
        "link": "https://www.linkedin.com/company/clubwealth"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Vienna",
        "region": "VA",
        "postal_code": "22184",
        "street_address": null,
        "latitude": 38.903484,
        "longitude": -77.26282
    }
}