{"location": {"country": "US", "locality": "Boulder", "region": "Boulder", "postal_code": "80310", "street_address": null, "latitude": 40.016872, "longitude": -105.279625}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer", "industry": "", "description": "Suite's Story\nSuite is making cloud-based post-production easy and accessible to all post-production studios. With over 10 years of experience in the post-production world, our founders have worked with hundreds of studios that face the same problems because they are locked into physical infrastructure and outdated workflows. At Suite, we are creating a highly intelligent platform built from small, distributed, and composable pieces of functionality that come together to provide a revolutionary service for post-production - and we’re looking for amazing people to help us build it!\nWe are a team that prioritizes people, recognizing that diverse backgrounds and a healthy work-life balance produce the best results. We communicate openly, ensuring ideas and feedback are shared early and often. Our team succeeds together, encouraging one another to be our best by offering support when it's needed and celebrating our wins together. Most importantly, our team loves what they do and has fun doing it.\nYour Story\nYou are a highly motivated individual who carries a \"think like an owner\" mentality. Not only are you passionate about the vision, but you take pride in your work and one day see yourself leading a team that takes pride in theirs. You are a high integrity teammate who accepts others and encourages excellence. If you were to recap your story, you would include...\n2+ years of production software engineer experience\nWork that you can demonstrate and describe why you made the decisions that you did\nExcited to learn and grow as a software engineer\nAn exceptional drive for individual contribution and collaboration\nYou are open to suggestions with a team-first attitude and willing to take mitigated risks to move a project forward\nYou like to learn and dive into challenges, especially the hard ones, and you always look for new or innovative ways to solve problems\nOutstanding written and verbal communications skills with the ability to translate complex technology concepts into simple and intuitive material\nYou live by the same values as Suite and prioritize people, communicate openly, succeed as a team, think like an owner, and have fun.\nBonus:\nExperience in Post Production technology and workflows\nYour Skills\nExperience with AWS serverless offerings in a production environment\nExperience with building and testing microservices\nExperience with GraphQL\nExperience with DynamoDB\nExperience with Typescript preferred or strongly typed languages\nYour Day to Day\nAs an early hire, you will be a critical member of the Suite team with a lot of influence over our future direction. Not only will you be critically involved in building our platform, but you will be a key player in shaping the future of the post-production industry. The technology you help build will allow studios to create without boundaries, leveling the playing field for artists and democratizing the post-production industry. You will have ownership over our products as well as the ability to influence the ideation, design, and execution of future products. You will be sharing feedback and working closely with the other engineers to ensure that we create maintainable, scalable, and exceptionally high-quality code throughout all layers of our platform.\nWork with the engineering team to improve code quality and adhere to the team's best practices\nWrite outstanding code demonstrating best practices in testing, maintainability and performance\nCreate and maintain thoughtful documentation that captures design decisions, behavior, trade-offs, and limitations\nPerform thorough and thoughtful code reviews in order to mentor and grow teammates\nYour Future\nPay:\n90-110k\nEquity:\nAbsolutely\nBenefits:\nHealth & Dental\nVacation:\nUnlimited\nAdditional Perks:\nEarly Hire, help build the company from the ground up\nFlexible work from home policy\nCasual Dress\nUnlimited free beer, hard seltzers, and delicious coffee\nTaco Tuesdays, every Tuesday\nAWS Lectures live-streamed to office TV", "employment_type": "FULL_TIME", "date_posted": "2021-08-26T21:59:28.000Z"}, "company": {"name": "Suite Studios", "link": "https://www.linkedin.com/company/suite-studios"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 120, "seniority_level": "Lead"}}