{
    "job": {
        "title": "Software Engineer (US)",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Fortanix is a dynamic start-up solving some of the world’s most demanding data protection challenges for companies and governments around the world. Our disruptive technology maintains data privacy across its entire lifecycle -- at rest, in motion, and in use across any enterprise IT infrastructure -- public cloud, on-premise, hybrid cloud, and SaaS. With key strategic partners like Intel and Equinix, Fortanix customers like PayPal, Google & Addidas are reaping the benefits. Recognized by Gartner as a “Cool Vendor”, Fortanix is revolutionizing cyber security.Join the revolution!You will Contribute to a friendly and helpful company cultureDesign, implement, test, and maintain one or more ofThe backend of our cloud security platform, written in Rust, COur Runtime Encryption® software for SGX, written in Rust and CHelp deploy, monitor, and tune the performance of our softwareParticipate in peer code review, which we believe results in a higher-quality productFollow security best practices (don’t worry, we’ll tell you what they are)RequirementsYou are someone whoExhibits uncompromising integrityPays attention to detailThinks critically about complex technical problemsCan work independently, while also being an effective member of a teamYou have2 to 5 years experience.Experience in Rust, C/C++, Java, Python, or G.Coursework and/or professional experience in computer architecture and operating systemsA bachelor’s degree in Computer Science, Information Systems, or related field, or equivalent training or work experienceSecurity experience is a plus, but is not requiredBenefitsBenefitsFree catered lunch every dayUnlimited PTO (it’s between you and your work)Friendly culture that brings the best out of everybodyGreat working environment, we believe this in its truest form, \"Never Doubt that a small group of thoughtful committed technologists can change the world. Indeed, it is the only thing that ever has\" - Margaret Mead",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T03:41:11.000Z"
    },
    "company": {
        "name": "Fortanix",
        "link": "https://www.linkedin.com/company/fortanix"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Mountain View",
        "region": "CA",
        "postal_code": "94040",
        "street_address": null,
        "latitude": 37.39008,
        "longitude": -122.08139
    }
}