{"location": {"country": "US", "locality": "Florida", "region": "Florida", "postal_code": "33805", "street_address": null, "latitude": 28.595512, "longitude": -82.48734}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Senior Site Reliability Engineer", "industry": "Staffing and Recruiting", "description": "PreciseSource, a nationwide professional recruitment firm, is currently undertaking a search for a Sr. Site Reliability Engineer to run a large-scale, massively distributed, and fault-tolerant systems for an established an growing cloud services company. The Engineer will have the opportunity to manage the complex challenges of scale, while using expertise in coding, algorithms, complexity analysis, and large-scale system design. This is a new role as part of the company's East Coast expansion. This role will be located in Miami, FL, but will work remote for the foreseeable future. This is a full-time, direct hire role offering a great base salary, stock options, and great benefits including unlimited PTO.\nCandidate should:\nHave a strong foundation in developing, deploying and operating high performance distributed Web services.\nHave Automation first mindset.\nHave the ability to design systems from ground up providing detailed technical analysis or the pros and cons of each approach.\nHands-on knowledge of Docker technologies.\nHave expertise in Azure technologies - Compute, Storage, Database.\nGood understanding of security practices while developing software will be helpful.\nHave a sound understanding of OS concepts especially *nix OSes, and tools especially those related to performance benchmarking, profiling, troubleshooting and measurement.\nHave the ability to work in a fast-paced, agile development environment with small, focused teams delivering product regularly.\nBe a solid team player. Excellent interpersonal and oral/written communication skills.\nLeads teams focused on quality and continuous improvement initiatives across business units within the company.\nExperience of operating in a Continuous delivery environment.\nKnowledge of Git, Jenkins, and CI/CD.\nBuild, design and support cloud-based infrastructure.\nSupport 24/7 operations of the company's SaaS service.\nInfluence future product features and requirements.\nContribute to existing documentation.\nParticipate in on-call rotation.\n5 to 10 years supporting large scale, distributed installations\nYour Past Experience & Future Success:\nBachelor’s degree in Computer Science or closely related field.\n5 to 10 years supporting large scale, distributed installations with cloud experience.\nExposure to and experience with the following tools Ansible, Docker, Kubernetes, Python, Terraform / Terragrun.\nParticipating in and contributing to agile methodologies and best practices.\nArticulate and personable with strong spoken and written language abilities.\nYou engender a sense of mentoring and knowledge sharing amongst your team, creating a synergistic learning environment.\nExperience working and collaborate with a distributed SRE and Engineering team.\nSelf motivated and sensitive about on-time delivery.\nWe would be thrilled if you had experience with:\n-Jenkins and CI/CD pipeline\n-Apache Cassandra, Apache Kafka\n-Open Source Software Development\n-ElasticSearch / OpenDistro / OpenSearchHashiCorp Vault", "employment_type": "FULL_TIME", "date_posted": "2021-08-18T19:23:18.000Z"}, "company": {"name": "PreciseSource, LLC", "link": "https://www.linkedin.com/company/precisesource-llc"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}