{"location": {"country": "US", "locality": "Pittsburgh", "region": "Pittsburgh", "postal_code": "15235", "street_address": null, "latitude": 40.44217, "longitude": -79.99496}, "salary": {"currency": "USD", "min_value": 53900, "max_value": 85600, "unit": "YEAR"}, "job": {"title": "Software Engineer", "industry": "Electrical/Electronic Manufacturing,Construction,Computer Software", "description": "RE2 Robotics\nhas multiple\nSoftware Engineering\npositions currently available. A\nSoftware Engineer\nat RE2 is a member of a multi-disciplinary team working on designing and implementing robotic systems, including manipulators, sensors, and systems integration. The ideal applicant for this position has a positive attitude and the aptitude to write software for complex systems.\nPosition Requirements\nB.S. in Computer Science (or equivalent experience)\nProficiency in GIT\nProficiency in at least one of the following languages: C, C++, C#, or Python.\nProficiency in the use of multiple operating systems, especially Windows and Linux.\nU.S. Citizenship or permanent residency in order to comply with government contract requirements\nWhile top-notch technical skills are important, what we value most is a passion for making the world a better place and the ability to work closely with our team members to create amazing technology.\nResponsibilities\nThe\nSoftware Engineer\n(SE) reports to the software engineering department manager and is responsible for carrying out development assignments with supervision. Working on collaborative cross-discipline project teams, the SE will serve as a technical member related to the software design on one or multiple concurrent projects. This expertise runs through all stages of the development process from requirements definition through design, development, integration, and verification.\nSkills And Experience\nExperience / coursework in one or more of the following areas:\nRobotic manipulation\nMobile robotics\nComputer vision\nControl theory\nArtificial intelligence\nEmbedded systems programming experience (microcontrollers and / or ARM)\nROS experience\nIntegration experience with third-party software tools\nExperience with hardware systems and sensors\nExperience in using Continuous Integration servers\nExperience with development of Quality Assurance tests\nExperience working with multidisciplinary teams\nBenefits And Perks\nRE2 offers competitive salaries and a comprehensive benefits package including maternity/paternity leave, flexible schedules, half-day Fridays, stock options, 401k plan, training and professional development stipends, paid time off, and medical/dental/vision/life and disability insurance for all regular full-time employees.\nRE2 also offers our monthly Taco Tuesday lunches, free snacks, coffee, and espresso, weekly fresh fruit delivery, holiday and summer parties, birthday bonuses, cell phone stipend, and more!\nRE2 is an Equal Opportunity / Affirmative Action employer. We believe there is great value in having a diverse workforce and we take pride in being an inclusive and accepting work environment for all people.\nRESUMES ACCEPTED IN PDF FORMAT ONLY.\nPowered by JazzHR\ntdAOO6Zvht", "employment_type": "FULL_TIME", "date_posted": "2021-08-31T19:07:16.000Z"}, "company": {"name": "RE2 Robotics", "link": "https://www.linkedin.com/company/re2"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}