{"location": {"country": "US", "locality": "San Diego", "region": "San Diego", "postal_code": "92161", "street_address": null, "latitude": 32.71576, "longitude": -117.16382}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Machine Learning Test Software Development Engineer", "industry": "Computer Software,Semiconductors,Wireless", "description": "Company:\nQualcomm Technologies, Inc.\nJob Area:\nEngineering Group, Engineering Group > Systems Test Engineering\nJob Overview:\nQualcomm is a company of inventors that unlocked 5G ushering in an age of rapid acceleration in connectivity and new possibilities that will transform industries, create jobs, and enrich lives. But this is just the beginning. It takes inventive minds with diverse skills, backgrounds, and cultures to transform 5Gs potential into world-changing technologies and products. This is the Invention Age - and this is where you come in.\nGeneral Summary\nQualcomm is a company of inventors that unlocked 5G ushering in an age of rapid acceleration in connectivity and new possibilities that will transform industries, create jobs, and enrich lives. But this is just the beginning. It takes inventive minds with diverse skills, backgrounds, and cultures to transform 5Gs potential into world-changing technologies and products. This is the Invention Age - and this is where you come in. You will be part of a multi-disciplinary AI/ML test team developing test software and frameworks for verification of Qualcomm Snapdragon AI/ML solutions across multiple product segments. You will apply your creativity, enthusiasm and innovative thinking to the research of new technologies and implementation of code to enable commercial deployment.\nResponsibilities\nWorking closely with software, hardware and systems engineers, your tasks and responsibilities will include the following:\nInvestigate and implement new tools and processes to improve software quality\nGather requirements, design, implement and test industry-leading technology features\nDebug test cases that fail in regression and/or demo\nDevelop test strategies for verification and commercial launch of Qualcomm ML/AI solutions\nDesign, develop and deploy test plans, test frameworks and test automation software\nCollaborate with other multimedia technology teams to leverage common test methods and frameworks\nMinimum Qualifications\nBachelor's degree in Engineering, Information Systems, Computer Science, or related field.\nPreferred Qualifications\nStrong development skills in Java and experience in Android Studio/APK development are strongly preferred\nStrong development skills in C++/Python\nBackground in test/validation with experience in software development\nHands-on experience running neural network models with Deep Learning frameworks such as TensorFlow Lite, Tensorflow, Keras, Caffe/Caffe2, PyTorch, SNPE, etc.,\nExperience with embedded systems development or equivalent. Understanding of software development and debugging in embedded environments.\nExperience with machine learning accelerators, MLTS/Benchmark Model is a plus\nUnderstanding of Multimedia audio/video/display/camera technologies is a plus\nExperience with Kotlin and Android OS ecosystem is a plus\nEducation Requirements\nRequired: Bachelor's degree in Engineering, Information Systems, Computer Science, or related field.\nApplicants\n: If you are an individual with a disability and need an accommodation during the application/hiring process, please call Qualcomm’s toll-free number found here for assistance. Qualcomm will provide reasonable accommodations, upon request, to support individuals with disabilities to be able participate in the hiring process. Qualcomm is also committed to making our workplace accessible for individuals with disabilities. Qualcomm is an equal opportunity employer and supports workforce diversity.\nTo all Staffing and Recruiting Agencies\n:Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes/applications.\nEEO Employer: Qualcomm is an equal opportunity employer; all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or any other protected classification.", "employment_type": "FULL_TIME", "date_posted": "2021-07-02T18:29:00.000Z"}, "company": {"name": "Qualcomm", "link": "https://www.linkedin.com/company/qualcomm"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}