{"location": {"country": "US", "locality": "Irvine", "region": "Irvine", "postal_code": "92717", "street_address": null, "latitude": 33.68591, "longitude": -117.82472}, "salary": {"currency": "USD", "min_value": 97200, "max_value": 144000, "unit": "YEAR"}, "job": {"title": "Senior Site Reliability Engineer", "industry": "Staffing and Recruiting", "description": "Job Description\nMy client is a leading global provider of legal, regulatory and business information and analytics that help customers increase productivity, improve decision-making and outcomes, and advance the rule of law around the world. They help lawyers win cases, manage their work more efficiently, serve their clients better and grow their practices. They assist corporations in better understanding their markets, monitoring their brands and competition, and in mitigating business risk. They collaborate with universities to educate students, and support nation-building with governments and courts by making laws accessible and strengthening legal infrastructures. This organization serves customers in more than 130 countries with 10,000 employees worldwide, is part of RELX Group, a global provider of information and analytics for professional and business customers across industries. They are looking to bring on a Senior SRE to assist in a 50-million-dollar project migrating 3 billion dollars’ worth of products to Azure.\nRequired Skills & Experience\nUse of orchestration tools such as Terraform, Ansible or CloudFormation\nPrevious Analytic and troubleshooting experience is required\nExperience migrating application from on-premises to public cloud.\nExperience with Blue-Green deployment methodologies.\nExperience working with containerised workloads such as Docker and Kuebernetes.\nExperience with Log Management tools e.g - Elastic Stack, Graylog or Splunk\nExperience working with an enterprise RDBMS such as MySQL and/or Microsoft SQL Server.\nKnowledge of change control and associated procedures.\nUse of Secret Management services e.g - Hashicorp Vault\nExperience with any high-level programming language.\nConfiguration Management tools - e.g. Ansible, Puppet, Chef or equivalents.\nProfessional experience of working within the public cloud - Azure, AWS or GCP.\nHands-on experience of Linux and Windows server including support and troubleshooting.\nSystem and application monitoring - e.g. Prometheus, Grafana, Nagios etc.\nProfessional Experience with common source control tools - e.g Git, SVN\nCloud Architecture and system design to solve key business problems and facilitate team goals.\nStrong and enthusiastic technologist, able to demonstrate a broad technical knowledge\nAbility to act as a point of expertise, advise others in the team on best practise and impart knowledge.\nDevelopment\nCoding and scripting experience - e.g. Powershell, Bash, Python or equivalent\nContinuous Integration/Delivery Tools - e.g. Gitlab, Github, Jenkins\nCloud Architecture and system design to solve key business problems and facilitate team goals.\nSecurity\nHands-on experience performing application static/dynamic security and penetration assessment with tools such as - SonarQube, CheckMarx, AppScan, BurpSuite, OWASP ZAP Proxy, WebInspect, Fortify, Veracode, Nessus etc.\nGood understanding of defensive, corrective and detective controls and requirements\nKnowledge of OWASP Top 10/ SANS Top 25, identify vulnerabilities via manual and automated testing methods and how to effectively remediate vulnerabilities associated with each. Ability to recognize and escalate Security issues\nExposure to application security testing (source code review and web/mobile application penetration tests)\nFamiliarity with different types of security vulnerabilities and tools for countermeasure\nThe candidate should be well versed in Information security principles at an Intermediate level\nDesirable Skills\nDesirable - AWS / Azure Certifications\nQualifications\n5+ years experience and proven background working in a technical, Cyber Security related position.\nBSc Engineering/Computer Science/IT Security or relevant experience.\nIndustry certification such as CSSP, AWS Certified Security, CSSLP desirable\nThe Offer\nCompetitive Salary: Up to $60-80/hour, DOE\nYou Will Receive The Following Benefits\nMedical Insurance & Health Savings Account (HSA)\n401(k)\nPaid Sick Time Leave\nPre-tax Commuter Benefit\nApplicants must be currently authorized to work in the United States on a full-time basis now and in the future.\nPosted By:\nNoah Mackeprang", "employment_type": "FULL_TIME", "date_posted": "2021-08-05T00:25:23.000Z"}, "company": {"name": "Motion Recruitment", "link": "https://www.linkedin.com/company/motion-recruitment-partners"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}