{"location": {"country": "US", "locality": "Stamford", "region": "Stamford", "postal_code": "06928", "street_address": null, "latitude": 41.051926, "longitude": -73.539474}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Scientist", "industry": "Accounting,Information Technology and Services,Management Consulting", "description": "Research & Insights, Deloitte Services LLP\nWe are looking for a teammate who will bring a blend of thoughtful, data driven curiosity and pragmatism. If you want to both design and deploy impactful, data-driven research to a global audience, then we want you on our team.\nData Science and Survey Advisory Services, Research & Insights Data Scientists play a key role developing research products that work to change perspectives on major business and government issues. Our Data Scientists are involved in all stages of the research process including working with internal clients to define research projects, research execution, presenting findings, and co-authoring public facing research reports. Strong candidates will be both thorough and creative in their research approaches, comfortable with public speaking, precise & concise writers, and able to both deliver and receive candid feedback.\nDuties and Responsibilities:\nExecutes end-to-end research processes, working with internal clients to define research topics to conducting rigorous analysis. Ensures research utilizes appropriate methodologies (multivariate statistical modeling, text analytics, network analysis, time series analysis, econometrics, psychometrics, etc.)\nWorks collaboratively on a service-oriented team which supports numerous research requests covering multiple industry areas (e.g., consumer, energy, finance, government, media, technology, etc.)\nBalances the demands of multiple long-term projects simultaneously\nPresents on research findings to senior leadership both within and outside of Deloitte\nOur Data Scientists play a key role in generating research into pivotal phenomena impacting US businesses and the US government. Our Data Scientists are required to occasionally travel (a few times a year at most) to attend offsite meetings, conferences, and/or training sessions.\nRequired Skills and Capabilities:\nExperience with Python and/or R\nPrior experience that has involved extensive use of at least two of the methodologies below:\nEconometrics/Statistical Modeling (Linear Regression, Time Series Analysis, etc.)\nInteractive Visuals (Power BI, MarketSight, Tableau, Qlik, etc.)\nMachine Learning (Random Forests, Clustering, etc.)\nText Analytics (Topic Modeling, Natural Language Processing, Sentiment Analysis, etc.)\nNetwork Analysis (Particularly Social)\nNeural Networks (Artificial, Convolutional, or Recurrent)\nGeostatistics/Spatial Modeling (Geographic information Systems, Spatial Regression, etc.)\nBachelors degree in Data Science, Statistics, Quantitative Behavioral Science other highly quantitative field\nTravel up to 10% (While 10% of travel is a requirement of the role, due to COVID-19, non-essential travel has been suspended until further notice.)\nLimited immigration sponsorship may be available\nDesired Skills and Capabilities:\nMasters or PhD in Data Science, Statistics, Quantitative Behavioral Science or other highly quantitative field\nAbility to work independently with minimal supervision as well as in a collaborative team environment\nPrior publication of work (please provide links if possible)\nExperience managing data-driven research, from project ideation to deployment\nDeep expertise in Python or R\nWorking knowledge of SQL (Structured Query Language)\nFamiliarity with data visualization software, such as MarketSight, Power BI, Tableau, etc.", "employment_type": "FULL_TIME", "date_posted": "2021-08-14T18:08:51.000Z"}, "company": {"name": "Deloitte", "link": "https://www.linkedin.com/company/deloitte"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}