{"location": {"country": "US", "locality": "Campbell", "region": "Campbell", "postal_code": "95009", "street_address": null, "latitude": 37.28766, "longitude": -121.94243}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Compiler Engineer/Architect", "industry": "", "description": "Ascenium (www.ascenium.com) is building a new class of processor and recruiting for multiple Compiler Engineers/Architects. In this role, you will be a key member of our Core Engineering Team. This is a ground floor opportunity as Ascenium just raised a $16M series A round. You can follow the recent coverage about Ascenium in THE NEXT PLATFORM newsletter (https://www.nextplatform.com/2021/07/12/gutting-decades-of-architecture-to-build-a-new-kind-of-processor/). If you want to be part of a top-tier team that is building “What’s next” in high performance processors, you will enjoy this role.\nJob Description\nDesign, develop, and enhance different components of the compiler\nBenchmark and analyze output produced by optimizing compiler, and quantify results (analyze performance, code size, and key other compiler metrics)\nDevelop and execute benchmark and test scenarios for compilers\nCollaborate with the HW design team to co-optimize compiler strategy\nBuild custom front-end and back-end LLVM passes\nQualifications\nBS or MS degree in Computer Science, Computer Engineering, Electrical Engineering, or related field of study\nMinimum 3+ years of working experience with LLVM/compilers; Proven ability to design/architect compiler frameworks; Knowledge of LLVM flow, front-end and back-end compiler techniques; Strong background in debugging technologies, code generation, program analysis, and compiler optimizations\nExperience in C++ programming, and software design skills, including debugging, performance analysis, and test design\nKnowledge of contemporary of CPU and GPU Compute architectures\nExperience and proficiency with code versioning systems (GitHub)\nFamiliarity with hand-written assembly optimizations (especially math-related)\nExperience in constraint satisfaction problem-solving techniques, modeling, and simulation tools\nHardware background / familiarity with Verilog is a plus, but not mandatory\nIdeally have public LLVM repository contributions", "employment_type": "FULL_TIME", "date_posted": "2021-08-27T05:11:34.000Z"}, "company": {"name": "Ascenium Inc", "link": "https://www.linkedin.com/company/ascenium-inc"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}