{
    "job": {
        "title": "Solutions Architect, Cortex- XDR",
        "industry": "Computer & Network Security",
        "description": "Company DescriptionOur MissionAt Palo Alto Networks® everything starts and ends with our mission:Being the cybersecurity partner of choice, protecting our digital way of life.We have the vision of a world where each day is safer and more secure than the one before. These aren’t easy goals to accomplish – but we’re not here for easy. We’re here for better. We are a company built on the foundation of challenging and disrupting the way things are done, and we’re looking for innovators who are as committed to shaping the future of cybersecurity as we are.We’re changing the nature of work. Palo Alto Networks is evolving to meet the needs of our employees now and in the future through FLEXWORK, our approach to how we work. From benefits to learning, location to leadership, we’ve rethought and recreated every aspect of the employee experience at Palo Alto Networks. And because it FLEXes around each individual employee based on their individual choices, employees are empowered to push boundaries and help us all evolve, together.Job DescriptionYour CareerAs a Palo Alto Networks Solutions Architect in our XDR space, you will be the expert for our Cortex portfolio for Enterprise Accounts. Your portfolio includes Advanced Endpoint Protection (XDR), Cortex XDR – Investigations and Response, Cortex XDR – Analytics, Autofocus, Cortex Data Lake and XSOAR (Security Orchestration, Automation & Response).You are the “go to” resource for customer interactions that exceed standard SE support requirements. Your role is one of technical mentorship – working with your Account Manager to build integrated solutions for our client’s unique environments. With your colleagues, you will displace competing technologies, and build market share within your targeted list of major SLED accounts, and most importantly, help your client sleep at night as our product integrates to build secure digital transactions.Your ImpactPresent to customers as our expert in your area at all levels in the customer hierarchy from technician to executiveLead conversations about industry trends and emerging changes to the security landscape that every customer needs to be aware of and planning to take care ofDiscuss, with credibility, competitive offers in the marketplace and positions ours as the best alternativeLead and support customer demonstrations (with our SE’s) that showcase our unique valueInteract locally and remotely with customers in an equally persuasive mannerWorking with Product Management, Technical Marketing, and R&D to create requirements and product features for our large customers and provide feedback from customersProvide design consultation and best practice guidance for rollout, implementation, and policy conversion during the 'pre-sales' process for strategic opportunitiesTake ownership of advanced 'proof of concept' testing in strategic accounts either at the customer site or Palo Alto Networks lab facilitiesProvide product update and enhancement training to other SEs in the region or theaterProvide demos for strategic prospects and current accounts in all facets of Palo Alto Networks’ virtual offerings and integration in existing data center environments Assist in the training of Palo Alto Networks SEs in their designated region in installs customer presentations, and internally-focused deal preparation activitiesProvide territory coverage within the region when additional resources are requiredProvide advanced 'Partner SE' training for updates in the Palo Alto Networks product suiteQualificationsYour ExperienceBSCS or equivalent and 5+ years of experience as a Solutions Architect, Pre-Sales/Systems Engineer or Systems Integrator4+ years of technical hands-on experience with Application Security/Endpoint Security4+ years of experience in a customer facing role; Experience working with FIs is an advantage; preferably working in a start-up and vendor environmentSolid grasp of web applications, web protocols, security and Internet environmentsAdvanced knowledge of web threats and cybercrimeExperience with common enterprise desktop software deployment methodologiesExperience installing, configuring and integrating a complex Security environmentExperience understanding malware, exploits, operating system structure and behaviorDemonstrable experience in securing these environmentsDeep understanding of Unix/Linux and Windows operating systems and scriptingDemonstrable experience with systems installation, configuration and administration of routers/switches, UNIX/Linux, and Windows-based systems (prior Active Directory/LDAP experience desirable)Working knowledge of Endpoint Prevention, SIEM, vulnerability management tools, SOC, firewalls, and other security technologies both from a technology and a business driver standpointExperience with Incident Response; both IR tools and IR workflow processExperience selling, demonstrating, installing, and solving network infrastructure security productStrong communication and presentation skills, both verbally and writtenStrong problem finding and solving skills, ability to analyze complex multivariate problems and use a systematic approach to gain quick resolutionFamiliar working with Channel partners and understanding of a channel-centric go to market approachExperience from companies in the security operations spaceExperience installing and configuring a virtual environmentExperience understanding threat intelligence and threat huntingScripting experience with a focus on Python and PowerShell is a plusTravel of 40%-60% within the designated regionAdditional InformationThe TeamAs part of our Systems Engineering team, you’ll support the Sales team with technical expertise and guidance when establishing trust with key clients. You won’t find someone at Palo Alto Networks who isn’t committed to your success – everyone pitches in to assist when it comes to solutions selling, learning, and development. As a member of our Systems Engineering team, you are motivated by a solutions-focused sales environment and find fulfillment in working with clients to resolve incredible complex cyberthreats.Our CommitmentWe’re trailblazers who dream big, take risks, and challenge cybersecurity’s status quo. It’s simple: We can’t accomplish our mission without diverse teams innovating, together.We are committed to providing reasonable accommodations for all qualified individuals with disabilities. If you require assistance or accommodation due to a disability or special need, please contact us at accommodations@paloaltonetworks.com.Palo Alto Networks is an equal opportunity employer. We celebrate diversity in our workplace, and all qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or other legally protected characteristics.All your information will be kept confidential according to EEO guidelines.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T18:37:45.000Z"
    },
    "company": {
        "name": "Palo Alto Networks",
        "link": "https://www.linkedin.com/company/palo-alto-networks"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Atlanta",
        "region": "GA",
        "postal_code": "30355",
        "street_address": null,
        "latitude": 33.748547,
        "longitude": -84.3915
    }
}