{"location": {"country": "US", "locality": "Austin", "region": "Austin", "postal_code": "78723", "street_address": null, "latitude": 30.276316, "longitude": -97.70931}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Scientist", "industry": "Information Technology and Services", "description": "Data Scientist\nThis position will be joining a team that's primary focus will be Government Contracts.\nAs a  Data Scientist will support enabling and growth for the existing automation efforts and drive forward their natural language processing efforts. This is a cross-functional team that is adding talent at all levels. As an early member of the team, your experience is going to be valuable in making data-driven decisions.\nLocation:\nNorth Austin office if you'd like to use it\nSalary:\n$120k - $135k\nVisa Status:\nUS Citizen\nResponsibilities\nAnalyze raw data: assessing quality, cleansing, structuring for downstream processing\nDesign accurate and scalable prediction algorithms\nCollaborate with the engineering team to bring analytical prototypes to production\nGenerate actionable insights for business improvements\nQualifications\nM.S. in a quantitative field (Statistics, Mathematics, Computer Science, Engineering, etc.)\nAt least 1 - 2 years of experience as a Data Scientist\nDeep understanding of predictive modeling, machine-learning, clustering and classification techniques, and algorithms\nFluency in Python\nWorked with terabytes of data\nFor further details please submit a resume.\nAustin Fraser Inc is acting as an employment business in relation to this advert. As a professional company, we gladly welcome applications from persons of any age and background and do not intend to discriminate with advert text and terminology.", "employment_type": "FULL_TIME", "date_posted": "2021-08-16T15:37:48.000Z"}, "company": {"name": "Austin Fraser", "link": "https://uk.linkedin.com/company/austin-fraser"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 12, "seniority_level": "Junior"}}