{"location": {"country": "US", "locality": "Austin", "region": "Austin", "postal_code": "78746", "street_address": null, "latitude": 30.264978, "longitude": -97.7466}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "DevOps/Site Reliability Engineer", "industry": "Marketing and Advertising,Computer Software,Internet", "description": "OUR STACK\nAPPLICATION MONITORING:\nInstana, Cloudwatch, ELK, Prometheus, Influx, Grafana\nALERTING SYSTEM:\nPagerduty\nINFRASTRUCTURE AS CODE:\nTerraform, Cloudformation\nAWS CLOUD:\nLambda, EKS, ECS, EC2, DynamoDb, AuroraDb, Kinesis, SNS, SQS, Redshift, API Gateway, Cloudfront, S3, IAM\nEDGE-SIDE COMPUTE / WAF:\nCloudflare\nCICD:\nGitHub Actions, Jenkins, Teamcity\nSOURCE CONTROL:\nGitHub\nPROCESS:\nJIRA, Confluence, GitHub\nWhat Is Expected Of You\nCan communicate effectively with a diverse team\nUnderstanding best practices of software reliability and availability\nHas experience creating alerts and dashboards in Cloudwatch / Grafana / other APMS\nHas experience working with a development team to plan / build out tasks for setting SLI / SLOs for new and legacy features and can influence the application’s SLA\nDemonstrate understanding of principles of the Incident Command System\nHas a wide breadth of knowledge of compute, storage, message queueing and networking of AWS resources\nHas experience writing Github Actions / Jenkins software pipelines\nHas experience writing complex multi-resource terraform / cloudformation stacks from scratch\nHas experience managing and deploying applications to kubernetes\nQualifications\nExperience with modern APM technologies, dashboarding, setting application alarms, and incident response\n3+ years of hands on devops / sre experience\n3+ years with python / node\n3+ years working with AWS with Infrastructure as Code\n3+ years of experience with writing software development pipelines\n2+ years of experience with kubernetes and helm charts\n2+ years working closely with software development teams\nPreferred Qualifications\nExperience with Instana, Cloudwatch, ELK, Prometheus, Influx, Grafana\nExperience with working with teams to define SLIs & SLOs for new and existing services\nExperience with Github Actions or Jenkins CI\nExperience with Kubernetes and EKS\nExperience with software Incident Command System (facilitating Post Mortems)\nAbout You\nuShip’s Site Reliability Engineers integrated with software agile teams, solving challenging problems in the logistics e-commerce space. We are looking for an engineer to help ensure the reliability of our next wave of products. Ideal candidates want to deeply understand how our systems work from the infrastructure level, their dependencies to other systems, how to mitigate risk, and develop strategies for service failover. You’ll be building the foundation that enables us to empower the logistics landscape and help customers all over the world.\nWhy uShip?\nuShip offers big-company benefits in a small-ish sized company because we really value and are committed to our people. There are even some extras that will surprise you.\n100% Paid Health and Dental available\n401(k) matching with no vesting\nStock Options\n100% paid maternity and paternity leave\nuShip shipping credit ($750)\nPet Insurance\nMonthly Wellness Reimbursements\nCasual dress code\nDog-friendly\nSo much more!\nCompany Overview\nuShip is the world’s first and largest shipping marketplace, making it quicker, easier, and more affordable to ship large or bulky items. Consumers and businesses can compare and book bids from hundreds of thousands of customer-reviewed transportation service providers, ranging from independent owner-operators to the largest freight carriers and brokers. From cars to cranes and furniture to freight, our straightforward and transparent platform helps people, businesses, e-commerce sellers, and multinational logistics companies ship with greater speed and efficiency. Customers save money and service providers make money using their empty cargo space – everyone wins!\nInclusivity is Key!\nWe welcome diversity in all its forms, and believe we’re better collaborators, strategizers, and thinkers because of it. We show pride in our community by giving back and working with local charities. uShip is an equal opportunity employer. We are inspired to find candidates who embody our Core Values. uShip prohibits discrimination and harassment of any type and affords equal employment opportunities to employees and applicants without regard to race, color, religion, sex, gender identity, age, parental status, national origin, disability, or veteran status. We celebrate diversity and are committed to creating an inclusive environment for all employees.", "employment_type": "FULL_TIME", "date_posted": "2021-07-27T00:00:00.000Z"}, "company": {"name": "uShip", "link": "https://www.linkedin.com/company/uship"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}