{"location": {"country": "US", "locality": "United States", "region": "United States", "postal_code": "99999", "street_address": null, "latitude": 39.50355, "longitude": -99.0183}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer", "industry": "", "description": "About Us:\nBlockworks is a fast-growing financial media brand that delivers breaking news and premium insights about digital assets to millions of investors.\nOur editorial content, newsletters, podcasts and events provide investors with the critical analysis and information they need to make smarter decisions about digital assets.\nAbout the Role:\nAs our second engineering hire, you’ll have a unique opportunity to own several different projects and help us build the engineering team and tech stack.\nWe’re looking for a Software Engineer who has a passion for building web experiences users will love, has strong design sensibilities, and is comfortable working with both frontend and backend code.\nThis is a unique opportunity to influence the product and technical direction of a fast-paced, growing startup.\nWe want to find the best person for the role regardless of where you are located. This role is open for candidates who are working remote as well as candidates who prefer to work from our New York City office.\nWhat You’ll Do:\nPlan, shape, and build new product features\nfrom start to finish: through conception, research, implementation, and maintenance\nExamples of product features include:\nbuild data metrics into our website, build a referral campaign on top of our newsletter, increase site speed, integrate 3rd party services into our website and newsletter, build podcast pages that automatically update upon release of shows, create pages for crypto charts, and more.\nHelp build both our tech stack and our engineering team\nCollaborate with our marketing and editorial teams\nto deliver and learn from experiments that move core business metrics\nGet to know the Blockworks reader\nto understand key points in their journey and uncover insights that will drive activation and engagement\nWhat We’re Looking For:\n2+ years of full stack experience\nSkilled in HTML, CSS and PHP\nExperience building custom WordPress themes\nDemonstrated ability to make beautiful websites and web apps\nWell-versed in modern frontend frameworks and best practices, including a robust knowledge of web application performance\nComfortable making decisions in ambiguous situations with changing or unknown requirements\nPrior experience in a small startup or incubator environment\nStrong project scoping and project management skills\nOur current website is on WordPress but you’ll have the opportunity to expand off of WordPress\nBonus: media or publisher experience, experience making product decisions based on data and A/B testing; SEO knowledge\nSalary & Benefits\nA commitment to an open, inclusive, and diverse work culture\nCompetitive pay\n14 weeks of fully paid parental leave\nMedical, dental, and vision insurance\n401(k) plan\nRemote work-station stipend\nTraining & development\nLearning stipend\nTeam happy hours and outings (even while remote!)\nGenerous vacation and PTO policy\nCommuter benefits\nWhat We Need From You:\nIf this sounds like a place you could make your mark, please submit your portfolio and resume/LinkedIn to careers@blockworks.co with “Engineer + Your Name” in the subject line.\nWe know that diversity makes for the best problem-solving and creative thinking. We are dedicated to adding new perspectives to the team and encourage everyone to apply if your experience is close to what we are looking for.\nBlockworks is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.", "employment_type": "FULL_TIME", "date_posted": "2021-09-01T18:27:35.000Z"}, "company": {"name": "Blockworks", "link": "https://www.linkedin.com/company/the-blockworks-group"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}