{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Computer Software,Internet,Financial Services",
        "description": "Help shape the next generation of ecommerce for the next generation of consumer.Platform Operations: Site Reliability EngineerStockX is looking for Site Reliability Engineers to help us build and scale our platform from a data driven perspective. You’d join as a foundational member of our Platform Operations SRE team and have the opportunity to directly influence the roadmap and technology choices as we rapidly scale our team and infrastructure. You’ll be responsible for shaping and developing initiatives like our monitoring & alerting, telemetry & tracing infrastructure, and incident response.What You Will Be DoingPartnering with your teammates to:Standardize the operational processes that drive the StockX platformDefine our incident response process and implement standardized tooling to support itRun incident response efforts (incident commander and communication roles) as well conducting blameless post-incident reviewsCraft reliable methods to monitor critical vendors that integrate with the StockX platformFoster a data driven culture that promotes quality and process improvement across the platform and with stakeholdersPartnering With Product And Engineering Teams ToDevelop operational readiness requirements for StockX services and cloud infrastructureMeasure and optimize platform performance by implementing SLI/SLO/SLA across all of StockX's servicesHelp define how availability is measured across the StockX platformProvide a holistic view of our platform health through service levels and business metricsPartnering With Information Security ToMonitor the platform for security events/alerts related to potential or active threatsMaintain awareness of the global threat landscape by partnering with StockX Threat Intelligence teamDevelop cyber security playbooks for various incident response scenariosWhat We're Looking For5+ years experience building and maintaining production systems with a focus on Devops or Site Reliability EngineeringExperience with:cloud native infrastructure (+1 for AWS or Kubernetes)infrastructure as code tooling (+1 for Terraform)maintaining monitoring and alerting systems (+1 Datadog)Comfortable triaging events & alerts, conducting threat assessments, and determining next steps (all based on internal controls and SOPs)Ability to program with one or more high-level programming or scripting languages such as Python, Ruby, JavaScript, bashA pragmatic problem-solver who can drive technical solutions that focus on our customers and businessA collaborative teammate that is comfortable in a fast paced environmentSomeone comfortable working across teams such as: Engineering, Product, Design, IT, and Supply Chain OperationsA willingness to learn on the job and take on tasks as neededExcellent communication skillsAbility to work independently and communicate over the chat or video chat softwareAbout UsOur global platform offers unprecedented access to current culture while our data-driven, bid-ask model provides buyers with the real-time visibility to know they’re getting a fair price. And, unlike other ecommerce sites, StockX hand-checks every purchase (20,000+ daily trades) at one of our regional authentication centers.StockX’s special formula has rocketed the company to a multibillion dollar valuation, with 10M+ lifetime trades on the platform—more than half of those coming in the last year. And we’re just getting started.We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. This job description is intended to convey information essential to understanding the scope of the job and the general nature and level of work performed by job holders within this job. However, this job description is not intended to be an exhaustive list of qualifications, skills, efforts, duties, responsibilities or working conditions associated with the position. StockX reserves the right to amend this job description at any time.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-26T00:00:00.000Z"
    },
    "company": {
        "name": "StockX",
        "link": "https://www.linkedin.com/company/stockx"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Detroit",
        "region": "MI",
        "postal_code": "48242",
        "street_address": null,
        "latitude": 42.33294,
        "longitude": -83.04784
    }
}