{
    "job": {
        "title": "Senior Network Support Engineer",
        "industry": "Information Technology and Services",
        "description": "Senior Technical Service Engineer (TSE)    The TSE will provide remote and on-site integration, implementation, configuration and troubleshooting of Customer IT networks and telephony products and systems. Customers will vary in size from 50-300+ users.   The TSE may serve as a team member or team leader within own work area or on a cross-functional team.   Responsibilities  - Maintain a high level of customer satisfaction and responsiveness to all customer IT business needs.   \n  - Respond to requests generated by the Network Operations Center (NOC), which carry the highest priority of all requests. TSEs will contact the customer immediately to provide confirmation of the request and an arrival time.   \n  - Provide comprehensive technical support on advanced technologies in the IT network environment.   \n  - Use experience and independent judgment to handle unique and sometimes complex situations.   \n  - Utilize sophisticated tools, service aids, product schematics, and any other available product information in the assessment and resolution of network equipment.   \n  - Provide consultative assistance for complex network issues that involve output devices (printers) and document management software.   \n  - Ensure a high-level of customer satisfaction by providing end-user training on implemented solutions and advising customers on preventative maintenance procedures and configurations that may impact product and network performance.   \n  - Communicate status updates, concerns or observations, and any client communications to the Manager daily.   \n  - Depending on technical expertise and certifications, TSEs may be required to assist with projects outside of their immediate areas of responsibility.   \n  - Maintain technical certifications, as well as obtain the expertise and knowledge on product & solution training specific to the needs of your function.   \n  - May assist in the development of associate level employees on IT Services offerings and solution identification to help improve/increase their proficiency and effectiveness in the application of diagnostic techniques and solutions.   \n  - Assist in the development and delivery of technology and skills development seminars.   \n   Required Skills and Experience  - 6- 8 years of experience in installing, configuring, administering, troubleshooting and managing IT network systems and telephony products and systems.   \n  - Strong ability to diagnose and troubleshoot methodically and efficiently.   \n  - 6-8 years of hands-on experience with network infrastructure hardware i.e., Windows Servers, Workstations, Racks, Routers, Firewalls, VLAN, Load balancing, SD LAN, Active Directory, and Backup Solutions.   \n  - 6-8 years of experience with Software Networked Configurations.   \n  - 6-8 years of experience with Server Operating Systems (Windows).   \n  - Significant experience installing network systems in the field.   \n  - Ability to perform as a Senior Engineer and lead other team members.   \n  - Experience with Mitel, RingCentral or a similar telephony product is strongly preferred.   \n  - MSP experience is a strong plus.   \n   Additional Skills Required  - Excellent verbal and written communication skills.   \n  - Excellent customer service skills and the ability to interact with clients in a professional manner.   \n  - Ability to manage multiple tasks with frequent interruptions and in urgent situations.   \n   Education Requirements  - 4-year college degree in a Technical (MIS, IT) program or equivalent experience   \n  - CCNP Certification or other applicable certifications are strongly preferred.   \n  - MCSE Certification is a plus.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T21:52:49.000Z"
    },
    "company": {
        "name": "Aptonet Inc",
        "link": "https://www.linkedin.com/company/aptonet-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": "Senior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Miami-Fort Lauderdale Area",
        "region": null,
        "postal_code": "33122",
        "street_address": null,
        "latitude": 25.777811,
        "longitude": -80.21953
    }
}