{"location": {"country": "US", "locality": "Los Angeles", "region": "Los Angeles", "postal_code": "90101", "street_address": null, "latitude": 34.05224, "longitude": -118.24335}, "salary": {"currency": "USD", "min_value": 38900, "max_value": 52800, "unit": "YEAR"}, "job": {"title": "Digital Asset Coordinator", "industry": "", "description": "Digital Asset Coordinator / Vault\nPrimary Responsibilities:\nManage all Digital Assets on our Production servers and Physical Tape/Drive Assets in our vault.\nCorrespond with our internal post-supervisors about all incoming and outgoing digital assets, drives, or tapes.\nMake sure all digital and physical assets are received and delivered securely according to our security procedures and policies.\nLog the metadata of all incoming and outgoing digital files into our Digital Asset Management System.\nKeep accurate and up-to-date logs of LTO Tape Archives.\nSetup redundant or old unneeded assets for recycling or destruction.\nMake sure vault is organized and physical asset inventory lists are current.\nCorrespond with outside clients about the deliveries of drives and Digital transfers (Aspera).\nSome administrative duties may be required like filing documents, copying, archiving, and setting up deliveries.\nPhysical labor may be required with our physical assets in the vault. (up to 25 lbs)\nOther duties as assigned\nQualifications:\nMust have 2 - 4 years of experience working in A/V post-production environment.\nWorking Knowledge of Xytech or Digital Asset Management Software.\nKnowledge of Word, Excel, Outlook, and FileMaker Pro.\nExperience working with many different types of data and video files.\nAbility to multi-task in a high pressure, fast-paced post-production environment.\nMust have a professional attitude and the ability to work cooperatively with co-workers.\nStrong organization and communication skills with attention to detail.\nWe offer competitive pay and a comprehensive benefits program including medical, dental & vision coverage, vacation & sick leave, 401(k), and more.", "employment_type": "FULL_TIME", "date_posted": "2021-08-25T17:28:13.000Z"}, "company": {"name": "STAMPEDE", "link": "https://www.linkedin.com/company/stampede-post"}, "education": {"required_credential": null}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}