{
    "job": {
        "title": "IT Software Engineer",
        "industry": "Information Technology and Services,Financial Services",
        "description": "Responsible for developing enterprise wide cross-functional software solutions, working closely with IT Software Architects and IT Business Analysts technical teams.Job Responsibilities:1.    Participate in solution design to satisfy a wide range of business needs.2.    Analysis and translation of business requirements into technical requirements for development, and creation of design documents and technical specifications.3.    Adhere to Best Practices and Standards in the areas of technology and security.4.    Provide post implementation support including, but not limited to, monitoring application performance and debugging existing code.5.    Keep abreast of advancements and changes in technology and develop an understanding of how new technologies can be leveraged provide business solutions.EDUCATION: Bachelor’s Degree in Computer ScienceEXPERIENCE: Minimum 3 years of experience in software development with strong skills in at least one key competency.COMPETENCIES – SKILLS/KNOWLEDGE/ABILITIES:1.    Strong relational database knowledge.2.    Understanding of best practices and methods to integrate applications within the organization and with external partners.  3.    Strong knowledge of the full software development lifecycle; with exposure to agile or iterative approaches to delivery preferred.4.    Working knowledge of the network and/or server infrastructure required to host an application on the platforms in areas of expertise.5.    Strong verbal and written communication skill.6.    Ability to quickly learn new technologies and business functions.7.    Strong analytical skills to determine effective approaches to business solutions.8.    Ability to perform effectively in a team-oriented environment. Experience with Agile strongly desired.9.    Ability to obtain a security clearance.10.    Knowledge in the area of NIST compliance strongly desired.11.    Microsoft .net frameworks (4.5.2 and higher)12.    ASP.net, C#13.    Microsoft IIS14.    REST Web Services15.    Microsoft SQL Server 2008 and higher16.    Microsoft Team Foundation Server (TFS)17.    JIRA18. AWS experience a plus Salary range is determined based on location, skillset and experience. Colorado residents only: salary range is $54,000-$134,000.Our benefits package includes medical, dental, vision, HSA and FSA, generous earned time off, 401K/student loan repayment, life insurance & AD&D insurance, employee assistance program, employee stock purchase program, tuition reimbursement, performance-based incentive pay, short- and long-term disability, and a robust wellness program. Nelnet is an Equal Opportunity Employer, complies with Executive Order 11246, and takes affirmative action to ensure that qualified applicants are employed, and that employees are treated during employment, without regard to race, color, religion/creed, national origin, gender, or sex, marital status, age, disability, use of a guide dog or service animal, sexual orientation, military/veteran status, or any other status protected by Federal or State law or local ordinance.  Qualified individuals with disabilities who require reasonable accommodations in order to apply or compete for positions at Nelnet may request such accommodations by contacting Corporate Recruiting at corporaterecruiting@nelnet.net.Nelnet is a Drug Free and Tobacco Free Workplace.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-31T00:06:59.000Z"
    },
    "company": {
        "name": "Nelnet",
        "link": "https://www.linkedin.com/company/nelnet"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}