{"location": {"country": "US", "locality": "Carlsbad", "region": "Carlsbad", "postal_code": "92010", "street_address": null, "latitude": 33.16604, "longitude": -117.33793}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Site Reliability Engineer", "industry": "Defense &amp; Space,Telecommunications", "description": "Bigger challenges. Bolder ideas. Global impact. At Viasat, we’re on a mission to deliver connections with the capacity to change the world. We’re the company behind the world’s fastest satellite internet service, with technology that’s helping to bridge the digital divide and improve life for our customers around the globe. By providing powerful new ways for people to connect with one another, gain greater access to education, entertainment, medical research, commerce, and much more, our team is empowering millions of customers worldwide.\nWe’re looking for passionate, innovative professionals to join our team and connect the world to more. You’ll work in a collaborative and inclusive environment that values diverse perspectives and continuous learning, and provides industry-leading benefits with unmatched opportunities for career growth. Our team is fearless in pursuit of new ideas and uncompromising in our quest to become the world’s first truly global Internet Service Provider. Interested in joining our mission? Take a look at career opportunities at Viasat today.\nJob Responsibilities\nThe Customer Engineering team is a group of highly technical engineers who are tasked with maintaining and developing the reliability, scalability and performance of the Service to different Enterprise Customers . The Customer Engineering Team is empowered to drive technical resolutions across the technology stack from hardware through to application and all stops in between. Team is also responsible to build and maintain Alerts to proactively monitor the service. Team acts as the technical Liaison between Customer facing teams and the Engineering teams.\nAs a Site Reliability Engineer , You Will\nIdentify and investigate potential and actual customer performance problems, recommend and prioritize remediation, and assess effectiveness of remediation actions\nParticipate in and provide feedback on product design, especially with regard to reliability and availability\nDrive initiatives with partner teams to improve the reliability and performance of the Service through improved system design\nDrive a culture of intolerance to manual activity which results in a highly automated environment delivering scalable solution\nWork Closely with Customer facing teams ( Technical Account Mangers and Program Teams) to understand and prioritize the Customer issues\nDrive monitoring and automation initiatives\nCreate and present Performance reports for technical and management stakeholders\nWork closely with Engineering teams to communicate and prioritize the service impacting issues\nBe part of on-call rotations\nRequirements\n5+ years experience in troubleshooting and triage of technical issues in a fast paced environment, to support customers.\n5+ years experience in Network Operations or Product Support\nAdvanced knowledge of modern programming languages, especially Python\nAn ability to understand large complex systems and a passion to constantly improve environments\nStrong networking knowledge: TCP/IP, IPSEC, VPN, NAT, Routing Protocols, AAA\nSet priorities and work efficiently in a fast-paced environment\nDemonstrated ability to deliver results on time with high quality and attention to detail\nDemonstrated ability to work with ambiguous requirements, adapt, and learn\nExperience with data analytics tools(Splunk, Kibana)\nKeen (data-driven) decision making skills under incomplete information\nExcellent face-to-face and remote customer rapport\nBachelor’s degree in Electrical Engineering, Computer Science, or Computer Engineering\nUp to 10% travel\nPreferences\nExperience analyzing data and trending to gain operational efficiencies\nTelecom or related operational service experience, especially wireless networks\nPrevious technical role in a DevOps/SRE workflow\nExperience with Satcom technology\nExperience/knowledge of Splunk or any Data analytics tool\n______\nTo learn more about this site and other office locations, please click !", "employment_type": "FULL_TIME", "date_posted": "2021-08-04T06:20:20.000Z"}, "company": {"name": "Viasat Inc.", "link": "https://www.linkedin.com/company/viasat"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}