{
    "job": {
        "title": "Senior Software Engineer",
        "industry": "Construction,Information Technology and Services,Computer Software",
        "description": "Dematic is an intralogistics innovator that designs, builds and supports intelligent, automated solutions for manufacturing, warehouse and distribution environments for customers that are powering the future of commerce. With engineering centers, manufacturing facilities and service centers located in more than 25 countries, the Dematic global network of 10,000 employees has helped achieve more than 6,000 worldwide customer installations for some of the world’s leading brands. Headquartered in Atlanta, Dematic is a member of KION Group, one of the global leaders in industrial trucks and supply chain solutions, and a leading provider of warehouse automation.       The Role       Ever order something online and get the package the next day? Want to work for an organization that provides growth opportunity? Enjoy working with highly complex software solutions?       Then check out Dematic – the Global Leader in the Logistics and Material Handling Industry.      Core Job Responsibilities     -  In-depth understanding of hardware/VM Setup    \n  -  Experience with C, C++ and javascript Programming    \n  - Experience with web development   \n  -  Knowledge and understanding of Database Design and Programming (Microsoft SQL, etc)    \n  - Provide technical support to customers on-site and train customers and key-users on installed applications   \n  - Maintain good relationships with all internal and external customers, through provision of a high-quality service   \n  - Operate in an Agile development environment while collaborating with key partners.   \n  - Attends site meetings during software commissioning phases to ensure that integration testing and site acceptance testing is completed as required   \n  - Ability to consistently make timely decisions even in the face of complexity.   \n  - Strong problem solving skills   \n  - Anticipated travel 20%-30%      \nWhat We Are Looking For      Strengths You'll Need     -  Bachelor’s Degree in Computer Science, Computer Engineering or Software Engineering   \n  -  2+ years in software development   \n  -  Enthusiasm for software development and innovation   \n  -  Understanding of Relational Databases   \n  -  Knowledge or experience with concurrency and/or scalability   \n  -  Advanced experience working in an Agile environment   \n  -  Strong Analytical skills   \n  -  Strong work ethic and knack to multi-task on a sustained basis.   \n  -  Excellent communication skills in English, including both written and speaking.      \nPreferred Skills     -  Use of continuous development, integration and delivery tools (JIRA, Selenium, GitHub)   \n  -  Experience with Tomcat, Apache web server, JQuery, Bootstrap/AngularJS, Node.js, JSF, Hibernate, GIT and Apache Ant.   \n  -  Experience with Spring/Struts frameworks, RESTful services and working in a large, enterprise environment.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-31T00:36:20.000Z"
    },
    "company": {
        "name": "Dematic",
        "link": "https://www.linkedin.com/company/dematic"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Senior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Rochester",
        "region": "NY",
        "postal_code": "14612",
        "street_address": null,
        "latitude": 43.15571,
        "longitude": -77.61255
    }
}