{"location": {"country": "US", "locality": "United States", "region": "United States", "postal_code": "99999", "street_address": null, "latitude": 39.50355, "longitude": -99.0183}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Engineer (Machine Learning)", "industry": "Information Technology and Services,Computer Software,Internet", "description": "Life at MX\nWe are driven by our moral imperative to advance mankind - and it all starts with our people, product and purpose. We always carry a deep sense of drive and passion with us. If you thrive in a challenging work environment, surrounded by incredible team members who will help you grow, MX is the right place for you.\nCome build with us and be part of an award-winning company that’s helping create meaningful and lasting change in the financial industry.\nMX is on a mission to improve the financial lives of everyone. We believe each of us has a moral imperative to use our time and talents to change the world for the better. For this reason, we are creating innovative software and partnering with financial institutions and digital banking providers to bring financial freedom to the lives of individuals, families, and communities. MX is an award-winning financial management, online/mobile banking and innovative wealth management tools. We’re looking for smart, creative individuals to come build with us!\nWe are looking for a Data Engineer (Machine Learning) with a mindset of accuracy and practical application, working alongside Data Scientists, to build the infrastructure required to take us into a new level of “finances as they should be.”\nMX continues to expand its data science and engineering capabilities providing our clients and their customers with deeper information about their financial state.\nWhat you’ll get to do…\nEvaluate data pipeline and machine learning pipeline technologies\nImplement platforms that will simplify and improve the work of data analysts and scientists\nBuild tools to allow Data Scientists to own machine learning models for the entire life cycle\nBe a bridge between Data Scientists and Engineers while effectively communicating business needs\nYou’ll do it using your…\nFundamental understanding of various machine learning techniques\nFoundational knowledge in Event Source design and Stream Processing architecture\nFoundational knowledge in MLOps\nExperience in deploying machine learning models to production\n3 years of professional Python or R experience\n3 years of professional SQL experience\nStrong mathematical background including Statistics\nExperience working with non-relational data\nExperience (not required) with MLFlow, Ruby/Rails, Postgres, Large data structures (Vertica, Clickhouse, Redshift, ElasticSearch, Hadoop or similar). Kafka , Rabbit, Prefect, Airflow, Celery and Luig\nYou’ll fit in by…\nThinking like an owner\nBalancing independent problem solving with collaboration\nNot being afraid to make mistakes and learn from them\nCommunicating with honesty, candor, and respect\nBeing bold and resourceful\nBeing a passionate and empathetic team member\nYou’ll love it because…\nYou will build and share products that are making a difference in the lives of others\nYou will collaborate with other brilliant minds\nYou will be rewarded and recognized for your high-caliber work\nYou will enjoy autonomy\nYou will build products that outshine all of our competitors\nYou will be working with established design standards and libraries\nYou will work with a deeply technical engineering team\nVideos to Watch\nMX Effect\nWhy MX\nMission and Vision", "employment_type": "FULL_TIME", "date_posted": "2021-07-02T22:37:39.000Z"}, "company": {"name": "MX", "link": "https://www.linkedin.com/company/mxenabled"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}