{"location": {"country": "US", "locality": "Austin", "region": "Austin", "postal_code": "78746", "street_address": null, "latitude": 30.264978, "longitude": -97.7466}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Scientist", "industry": "Accounting,Information Technology and Services,Management Consulting", "description": "Analytics & Cognitive -Data Scientist -Solution Specialist - USDC\nAre you an experienced, passionate pioneer in technology - a solutions builder, a roll-up-your-sleeves technologist who wants a daily collaborative environment, think-tank feel and share new ideas with your colleagues - without the extensive demands of travel? If so, consider an opportunity with our US Delivery Center - we are breaking the mold of a typical Delivery Center.\nOur US Delivery Centers have been growing since 2014 with significant, continued growth on the horizon. Interested? Read more about our opportunity below ...\nWork You'll Do/Responsibilities\nStrong understanding of data science techniques and libraries and their applicability to business problems\nExperience in performing exploratory data analysis to define analytical models\nDevelop advanced quantitative models using a variety of programs/software to support predictive assessments\nProvide expertise for analytical, programmatic, strategic, and operational analysis.\nPerform technical risk analysis and reliability assessments.\nProvide recommendations for plans, programs, strategies, policies and budgets\nThe Team\nAnalytics & Cognitive\nIn this age of disruption, organizations need to navigate the future with confidence, embracing decision making with clear, data-driven choices that deliver enterprise value in a dynamic business environment.\nThe Analytics & Cognitive team leverages the power of data, analytics, robotics, science and cognitive technologies to uncover hidden relationships from vast troves of data, generate insights, and inform decision-making. Together with the Strategy practice, our Strategy & Analytics portfolio helps clients transform their business by architecting organizational intelligence programs and differentiated strategies to win in their chosen markets.\nAnalytics & Cognitive will work with our clients to:\nImplement large-scale data ecosystems including data management, governance and the integration of structured and unstructured data to generate insights leveraging cloud-based platforms\nLeverage automation, cognitive and science-based techniques to manage data, predict scenarios and prescribe actions\nDrive operational efficiency by maintaining their data ecosystems, sourcing analytics expertise and providing As-a-Service offerings for continuous insights and improvements\nRequired\nQualifications\nBachelors (or Masters) level qualification in Statistics/Technology/Science/Engineering/Applied Mathematics or a similar quantitate analytics field\nHas experience in developing algorithms using data science technologies to build analytical models\n2+ years' of data extraction/manipulation using scripts specific to Python, R\nExperience with python and/or R programming\n2+ years of experience with presentation and data analysis software such as: SAS, R, SPSS, MATLAB, Qlikview, Excel and Access +python\nModeling expertise using a variety of regression and supervised and unsupervised learning techniques\nExperience in data wrangling/cleansing, statistical modeling, and programming\nLimited travel up to 25%\nMust be willing to live and work in one of our Center locations:\nGilbert, AZ (Phoenix area)\nMechanicsburg, PA (Harrisburg area)\nLake Mary, FL (Orlando area)\nPreferred\nPhD in a quantitative analytics field\nExperience with Tableau or similar visualization tool\nBusiness analytics experience in one or more of the following industries: Insurance, Consumer Products and Packaged Goods, and Human Resources\nExperience conducting Modeling and Simulation Analysis, DoD Science and Technology (S&T) Analysis, Program Analysis and Evaluation, C4/IT and Cyber Analysis, Manpower Analysis, Training and Education Analysis, DoD Logistics, Maintenance, and Supply Analysis, Naval Amphibious Shipping Analysis, Strategic Plans Analysis, Strategic Investment Analysis, Cost and Economic Modeling and Analysis, Operations Research Analysis, Readiness Analysis, Force Preservation Analysis\nHow You'll Grow\nAt Deloitte, our professional development plan focuses on helping people at every level of their career to identify and use their strengths to do their best work every day. From entry-level employees to senior leaders, we believe there's always room to learn. We offer opportunities to help sharpen skills in addition to hands-on experience in the global, fast-changing business world. From on-the-job learning experiences to formal development programs, our professionals have a variety of opportunities to continue to grow throughout their career.\nBenefits\nAt Deloitte, we know that great people make a great organization. We value our people and offer employees a broad range of benefits.\nDeloitte's culture\nOur positive and supportive culture encourages our people to do their best work every day. We celebrate individuals by recognizing their uniqueness and offering them the flexibility to make daily choices that can help them to be healthy, centered, confident, and aware. We offer well-being programs and are continuously looking for new ways to maintain a culture where our people excel and lead healthy, happy lives.", "employment_type": "FULL_TIME", "date_posted": "2021-09-21T18:09:12.000Z"}, "company": {"name": "Deloitte", "link": "https://www.linkedin.com/company/deloitte"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}