{
    "job": {
        "title": "Software Engineer - Identity + Cloud",
        "industry": "Information Technology and Services,Banking,Financial Services",
        "description": "Make banking a Fifth Third better®      We connect great people to great opportunities. Are you ready to take the next step? Discover a career in banking at Fifth Third Bank.      General Function      The Information Security Engineer (ISE) will be responsible for defining, delivering and supporting the enterprise security tools and architecture developed in collaboration with the IT Engineering team. The ISE will also participate in a diverse variety of IS projects and support the ongoing operations of the Information Security department. The ISE is be focused on securing the network through the operations of intrusion detection system/intrusion prevention system (IDS/IPS), data loss prevention (DLP), Proxy, enterprise anti-virus and anti-malware solutions, log management, and vulnerability scanning and remediation.      Responsible and accountable for risk by openly exchanging ideas and opinions, elevating concerns, and personally following policies and procedures as defined. Accountable for always doing the right thing for customers and colleagues, and ensures that actions and behaviors drive a positive customer experience. While operating within the Bank's risk appetite, achieves results by consistently identifying, assessing, managing, monitoring, and reporting risks of all types.      Essential Duties And Responsibilities     - Contribute to and enhance the bank's network vulnerability management program.   \n  - Define security requirements for the implementation of new applications and projects.   \n  - Serve as a security engineer/consultant on projects.   \n  - Participate in conducting security research on threats and remediation techniques/ technology, make recommendations to the IS/IT teams and oversee their implementation.   \n  - Support the Bank's operational information security responsibilities, including the development maintenance of standards, procedures, and guidelines necessary to satisfy the Information Security department's network operations.   \n  - Proactively monitor and investigate network security alerts from managed security service provider and in-house security tools.   \n  - Assist in conducting risk assessments to evaluate the effectiveness of existing controls and determine the impact of proposed changes to business processes, applications and systems.   \n  - Provide technical support to regulatory agencies, external auditors, and internal auditors, as required, to respond to audits and examinations of the Bank's control environment.   \n  - Threat analysis / Incident Response: interpreting events and analyzing network traffic.   \n  - Mitigating and addressing threat vectors including APT, DDoS, Phishing, Malicious Payload, Cloud, Mobile Devices.   \n  - Vulnerability/penetration testing/remediation.   \n  - Seeking and maintaining knowledge (cross/up skill) of current and upcoming IT security technologies.   \n  - Awareness of latest and common security threats.   \n  - Knowledge of virtualization technologies.         \nMinimum Knowledge, Skills And Abilities Required     - Bachelor's degree in Computer Science/Information Systems or equivalent combination of education and experience. Master's degree a plus.   \n  - Industry Standard Certifications such as, but not limited to: CompTIA A+, CompTIA Network +, CompTIA Security +, ISC2 CISSP, and EWS are preferred.   \n  - Must be able to communicate ideas both verbally and in writing to management, business and IT sponsors, and technical resources in language that is appropriate for each group.   \n  - At least 2 years of related experience, including at least 1 years in a hands-on information security development role.   \n  - Experience working with and supporting Unix/Linux and Windows systems.   \n  - Solid conceptual understanding of distributed computing principles.   \n  - Working knowledge of application and data security concepts, best practices, and common vulnerabilities.   \n  - Previous experience working with offshore teams desired.   \n  - Financial industry experience is a plus.   \n  - Excellent ability to diagnose and troubleshoot accessibility issues.         \nSoftware Engineer - Identity + CloudLOCATION -- Cincinnati, Ohio 45202      Fifth Third Bank, National Association is proud to have an engaged and inclusive culture and to promote and ensure equal employment opportunity in all employment decisions regardless of race, color, gender, national origin, religion, age, disability, sexual orientation, gender identity, military status, veteran status or any other legally protected status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-31T00:40:23.000Z"
    },
    "company": {
        "name": "Fifth Third Bank",
        "link": "https://www.linkedin.com/company/fifth-third-bank"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Cincinnati",
        "region": "OH",
        "postal_code": "45202",
        "street_address": null,
        "latitude": 39.10685,
        "longitude": -84.5111
    }
}