{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "",
        "description": "Machine Learning EngineerSoothsayer Analytics is seeking Machine Learning Engineer who has an interest in solving challenging ML/ AI problems in Insurance. Our AI team works on a variety of exciting analytics (ML, AI) projects.Number of positions: 4Immediate need, need someone to start within 1-2 weeks max. Required Education:PhD in computer science, Physics, Statistics, Applied Mathematics, or other quantitative/ Computational discipline or Master's with over 5 years of real-time relevant real-time Industry experience as an AI/ML/ Deep Learning is a MUST. Required experience: At least 5 years industry experience as a Data Scientist is required. Job Description:Participate in requirements gathering, technical specification, design, and development of complex operationalizing machine learning projects.Ability to translate business requirements into plausible technical solutions for the articulation to other development team members.Contribute to the architecture design, development of data or machine learning pipelines, and integration into enterprise systemsResponsible for Build and configure multi-tenant machine learning environments on-prem, cloud, or hybridResponsible for Build, test and optimize AI/ML modelsInteract with teams of engineers from multiple disciplines Identifying and defining the scopeDefining technical approach, data and algorithms neededResponsible for building out the data product from POC to productCommunicate modeling results and its business impact to scientific and business stakeholdersCollaborate with other engineers, data scientists, and business analysts.  Machine Learning Engineer/ Data ScientistAdvanced level Experience in Python and MLExperience with building Machine Learning models and pipelines using tools like Python and Spark in AWS SageMaker.Experience building a variety of deep learning methods (autoencoders, embeddings etc.) using Pytorch, Tensorflow.Experience building time series modelsProficient in data processing using pandas and pySpark. Ad hoc analysis to describe and understand data sets.Familiarity with MLOpsKnowledge of SQL for accessing and processing dataExperience with at least one CI/CD tool, e.g. Jenkins, Github actions, or cloud equivalentsExperience in hyperparameter tuning, model selection and metrics. The candidate should demonstrate the ability to be well organized and perform error analysis to investigate model performance.Experience building visualizations using python.Hands on experience in a range of ML and AI techniques (e.g. supervised and unsupervised machine learning techniques, deep learning)Deep understanding of data manipulation/wrangling techniques Required Skills/ Skills Matrix:Data Analysis and Modeling using Python/Spark – 5 years = MustDistributed data processing using pyspark - 3 years = MustDeep Learning on structured data - 3 years = MustComputer Vision/NLP - 12 months = Good to haveMLOps - 6 months = MustTime Series Analysis and Modeling – 1 year = MustDomain experience in solving ML problems in one or more of Insurance - 3 years = MustAWS SageMaker – 1 year - Must",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-27T15:32:25.000Z"
    },
    "company": {
        "name": "Soothsayer Analytics",
        "link": "https://www.linkedin.com/company/soothsayer-analytics"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Livonia",
        "region": "MI",
        "postal_code": "48154",
        "street_address": null,
        "latitude": 42.395065,
        "longitude": -83.3695
    }
}