{"location": {"country": "US", "locality": "San Francisco Bay Area", "region": "San Francisco Bay Area", "postal_code": "94112", "street_address": null, "latitude": 37.39271, "longitude": -122.042}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Site Reliability Engineer", "industry": "Computer Software,Computer Hardware,Computer Networking", "description": "Position Details:\nLocation:\nSan Francisco, CA (100% Remote)\nType\n: Full Time\nMust have TN Visa, GC, USC, H4 EAD, or H1B\nReferral Program: Not Interested but know someone!? We offer a $1000 Referral Bonus for anyone you refer that gets the project.\nYou Want\nTo automate infrastructure behind customer facing APIs with high availability, reliability, scalability.\nTo build systems that:\nLook Elegant and reliable on the outside\nDeal with the complexities of rigorous business logic\nTransparently handle hardware failures\nTo work in Go and other tools as necessary to build systems.\nTo participate and thrive in a delivery-oriented, goal-centric culture.\nSuccessful candidates will\nDemonstrate the ability to be productive and independent in a remote environment\nDesign, write, and maintain software to improve the availability, scalability, reliability, performance, and efficiency of our services, incorporating third-party open-source tools when available\nCreate new designs for a growing number of distributed systems\nDesign and implement the tools and processes used for deployment and change management\nPlan and execute configuration management\nAutomate resource provisioning and allocation process\nOwn, maintain, and continuously improve all systems provided as a service, such as monitoring and datastores\nEngage in service capacity planning and demand forecasting, anticipating performance bottlenecks\nRun software performance analysis\nPlan and execute disaster recovery drills\nParticipate in rotating on-call duties\nYou have\nA Love of systems engineering, APIs, and making applications secure. You enjoy collaborating and coming up with reliable solutions that solve business needs. You constantly seek ways to ensure your systems meet the objectives while improving performance.\nThe ideal candidate doesn’t have all of the following, but is seeking to gain experience with them:\nComfortable with languages such as Go and Python\nMinimum of 4 years of industry experience in engineering\nFamiliarity with algorithms, data structures, and complexity analysis\nExperience with Grafana and Prometheus\nExperience working with Linux systems from kernel to shell including working with system libraries, file systems, and client-server protocols\nExperience with networking (TCP/IP, UDP, ICMP, ARP, DNS, load balancing, etc.)\nExperience with configuration management tools (Ansible)\nSystematic problem solving\nElegant and simple solutions to complex problems\nStrong sense of ownership and drive\nExpertise in designing, analyzing, and troubleshooting large-scale distributed systems\nWe offer\nAn opportunity to build a cloud solution and scale it to meet the needs of the world’s largest cloud consumers\nA highly distributed, remote-friendly team (US preferred)\nAn opportunity to shape product and business strategy and can grow into new roles as the organization grows\nBlackstone Talent Group is a division of Blackstone Technology Group, a global IT services and solutions firm that implements technological solutions across commercial industry verticals and the US Federal Government. Blackstone’s global talent augmentation practice was founded in 1998. Blackstone Talent Group has offices in San Francisco, Denver, Houston, Colorado Springs, and Washington, DC. We specialize in providing clients the best talent across a variety of industries and sectors.\nEOE of Minorities/Females/Veterans/Disabilities", "employment_type": "FULL_TIME", "date_posted": "2021-08-02T20:24:07.000Z"}, "company": {"name": "Blackstone Talent Group", "link": "https://www.linkedin.com/company/blackstonetalentgroup"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 48, "seniority_level": "Mid-Level"}}