{"location": {"country": "US", "locality": "Mountain View", "region": "Mountain View", "postal_code": "94040", "street_address": null, "latitude": 37.39008, "longitude": -122.08139}, "salary": {"currency": "USD", "min_value": 120000, "max_value": 230000, "unit": "YEAR"}, "job": {"title": "Machine Learning Software Engineer", "industry": "Information Technology and Services", "description": "Groq is delivering industry leading deep learning acceleration hardware with efficient, software-driven solutions for compute-intensive applications. At Groq, you will have the opportunity to work closely with some of the most talented engineers and leaders in the world to redefine compute and shape the future of machine learning.\nWe are looking for exceptional machine learning developers/ engineers/researchers with experience developing machine learning models. As a part of the ML Systems team at Groq, you will be working closely with Groq's sales, applications and engineering teams to develop and optimize ML models and systems for our hardware as well as contribute to original research in the field.\nESSENTIAL DUTIES AND RESPONSIBILITIES:\nDevelop kernels and models (both customer and public domain models) for Groq hardware using low level proprietary frameworks as well as popular higher level machine learning frameworks. The models will span domains from machine learning (computer vision, natural language processing, recommendation engines, reinforcement learning) to high performance computing (linear algebra)\nOptimize models for Groq’s hardware by exploiting proprietary hardware features\nPerformance analysis of models on Groq hardware\nPerformance analysis of large scale systems built using Groq hardware\nPerformance analysis of models on competitor hardware/systems\nContribute to driving features into Groq’s hardware based on model optimizations/insight\nPublish research papers related to ML model optimizations, hardware, in top tier ML conferences.\nEXPERTISE:\nAnalytical background with the ability to quickly understand complex hardware technologies, understand tradeoffs and build systems using them.\nML (Neural Networks) and math fundamentals expertise, with some experience/deep understanding in one or more of the following areas:\nComputer vision\nNatural Language Processing\nRecommendation engines\nReinforcement Learning\nLinear algebra\nExperience with a subset of the following:\nPython and C/C++\nTensorFlow, Pytorch, Caffe or other ML Frameworks\nHW accelerator programming languages such as CUDA, MKLDNN\nProgramming experience on other accelerators such as FPGAs, or DSPs from evaluation to production.\nUnderstanding of processor architectures and distributed systems and their implications on ML model performance\nStrong writer and public speaker; operate with integrity and drive transparency, openness, and effective communication.\nQUALIFICATIONS:\nBS in CS, CE/EE, Math, or Physics or equivalent work experience.\n2 to 10 years of software and machine learning experience\nRecent PhD computer science, math or engineering graduates with ML experience will also be considered.\nPublication record in ML conferences (ICML, NeurIPS, ICLR, CVPR) is a plus\nExcellent leadership, mentoring and cross-functional collaborative and influencing skills.\nEffective communication & presentation skills\nAble to work in a very dynamic start-up environment\nGroq is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.", "employment_type": "FULL_TIME", "date_posted": "2021-07-09T18:48:47.000Z"}, "company": {"name": "Groq", "link": "https://www.linkedin.com/company/groq"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}