{"location": {"country": "US", "locality": "Los Angeles", "region": "Los Angeles", "postal_code": "90101", "street_address": null, "latitude": 34.05224, "longitude": -118.24335}, "salary": {"currency": "USD", "min_value": 129000, "max_value": 176000, "unit": "YEAR"}, "job": {"title": "Site Reliability Engineer, Monitoring", "industry": "Computer &amp; Network Security,Computer Software,Information Technology and Services", "description": "We are looking for an experienced Site Reliability Engineering (SRE) to join Okta’s Technical Operations (TechOps) Team. At Okta our motto is \"Always On\", and nowhere do we embrace that more than in Technical Operations. We strive to build the most reliable and performant systems on the planet through the skillful use of automation. We've created an integrated system that securely connects any person via any device to the technologies they need to do their most significant work.\nThis SRE Monitoring role is ideal for someone who has a love of monitoring and automation technology and enjoys seeing their team grow and succeed. The monitoring team at Okta is instrumental in providing visibility into Okta's large scale production environment and helping our customers high availability.\nThe Ideal Candidate\nHas a track record of working in high-performing teams whilst still being hands-on.\nHas production experience with AWS cloud-based infrastructure.\nHas operated complex custom applications on UNIX/Linux and/or Enterprise Java platforms\nIs passionate about monitoring, observability and actionable alerts at scale.\nIs a champion for automation and leveraging agile software development methodologies\nHas in-depth knowledge of industry standard commercial or open source monitoring tools\nJob Duties And Responsibilities\nBecome a team member of experienced engineers using agile development\nDelivery of monitoring components:\nCollaborate with TPM, architects, and executive management\nDesign and code reviews\nPartner with Okta security teams.\nPartner with recruiting to hire staff\nContinuously refine monitoring processes, thresholds, and configuration\nRespond to issues and escalations and participate in a management on-call rotation\nWork closely with our monitoring tool vendors to drive improvement and economies\nMinimum REQUIRED Knowledge, Skills, And Abilities\nExperience with Amazon Web Services and knowledge of building and configuring AWS services\nExperience with managing Linux Systems in production.\nProficient in at least one scripting language (Bash, Perl, Ruby, Python)\nProduction use of one of the following tools Splunk, Wavefront, Zabbix, ELK, Prometheus or Grafana\nPrior experience in software development, DevOps role, or SRE role\nOkta’s Top 5 Core Leadership Competencies are part of the deeply ingrained principles that guide all of our company’s actions. They also align strongly to our cultural cornerstones, our Okta values: love our customers, empower our people, never stop innovating, act with integrity, and maintain transparency. It’s our expectation that our managers and leaders embody these core competencies:\nBuilds Effective Teams: Building strong-identity teams that apply their diverse skills and perspectives to achieve common goals.\nDemonstrates Self-Awareness (EQ): Using a combination of feedback and reflection to gain productive insight into personal strengths and weaknesses.\nDevelops Talent: Developing people to meet both their career goals and the organization’s goals.\nDrives Results: Consistently achieving results, even under tough circumstances.\nStrategic Mindset: Seeing ahead to future possibilities and translating them into breakthrough strategies.\nOkta is an Equal Opportunity Employer.\nOkta is rethinking the traditional work environment, providing our employees with the flexibility to be their most creative and successful versions of themselves, no matter where they are located. We enable a flexible approach to work, meaning for roles where it makes sense, you can work from the office, or from home, regardless of where you live. Okta invests in the best technologies and provides flexible benefits and collaborative work environments/experiences, empowering employees to work productively in a setting that best and uniquely suits their needs. Find your place at Okta https://www.okta.com/company/careers/.\nBy submitting an application, you agree to the retention of your personal data for consideration for a future position at Okta. More details about Okta’s privacy practices can be found at: https://www.okta.com/privacy-policy.", "employment_type": "FULL_TIME", "date_posted": "2021-08-17T04:17:55.000Z"}, "company": {"name": "Okta", "link": "https://www.linkedin.com/company/okta-inc-"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}