{
    "job": {
        "title": "Data Scientist",
        "industry": "Retail,Apparel & Fashion",
        "description": "Data Science In 2002, AKIRA opened the doors to its first women's clothing boutique in Chicago. Since then, the company has extended its reach to 30+ stores across the United States, as well as a thriving eCommerce business (shopAKIRA.com.) AKIRA is extremely well-poised for sustained growth as we continue to build a nationally recognized brand. AKIRA’s culture has one very large, distinct difference from other fast-fashion competitors: Other-Worldly Customer Service and Fanatical, Obsessive Attention to the consumer’s needs and desires. The core principle for all employees at AKIRA is to Act and Think Like an Owner, and this belief can be reflected across all areas of the company. We are looking for a Data Scientist that can be part of a team looking to pioneer the retail industry by leveraging Technology. This person would be part of a team who is leading AKIRA into a full technological transformation in areas including but not limited to AI, Data Analytics and IoT. If you are a fast-paced, detail oriented, and collaborative individual who thrives on delivering accurate results, this may be the position for you! The PositionData Scientist LocationChicago, IL.OverviewA Data Scientist on the Business Transformation team should feel comfortable working as a Business Analyst and as an expert Data Analyst. In a typical project the Data Analyst is expected to understand project goals and research the data sources to be used. This is typically a mix of modern and legacy systems – Cloud-based and on-prem. The Data Analyst would work on data discovery, wrangling, and preparation. From there either visualizations or reports would be created and validated with the project stakeholder. All the implementation is done in an agile manner with iterations and fast feed-back.Responsibilities:Data AnalysisData conceptsData modelingData visualizationBusiness IntelligenceBe part of the Business AnalysisInterviews & Meetings FacilitationScenarios, Use Case & Requirements Documentation Process AnalysisOperating Model AnalysisRetail business domain knowledge (or ability to learn quickly)Solution DesignSystem-thinkerProcess-modelerUnderstanding of modern data management principles and the architectures that support themSolution DevelopmentCoding in several programming languagesPrepare reports and dashboardsMust have implemented a substantial data application on her or his ownMinimum Job Requirements: 4-6 years of experience as a Data Analyst Consulting experienceRetail industry experience (preferred)Required Job Skills: Strategic and tactical problem-solving skillsTop-down thinker, quick learner, and driven by a strong sense of curiosityEager to experiment and learn from data, facts, and experiencesCan make progress in ambiguous situations, and actively seek to collaborateTake initiative, work independently when needed, and eager to learn new skills and approachesNot afraid to ask questions, with the end goal and outcomes in mind, and be self-criticalAbility to fail fast and learn from those mistakesEffective exploring large and/or complex data sources, with the ability to visualize the data journey towards delivering the solutionAn ability to communicate effectively, respectfully, and with confidence with executives and staff in business and technology using the appropriate languageMeeting Facilitation, Requirements Elicitation, Documentation & ValidationProcess MappingBachelor’s Degree RequiredTechnology and Programming:Very good at SQL in different variationsData Visualization Tools, e.g. Tableau, Power BI, LookerProgramming languages, e.g. Python with statistical libraries or equivalentFamiliarity with cloud-based services; e.g. AWS, Snowflake, MatillionAgile frameworks and tools, e.g. Scrum, Waterfall, HybridBenefits and Perks:AKIRA offers competitive benefits for full time employees, including Medical, Dental, Vision, Life, LTD, FSA/HSA, 401(k), and employee discount. We are committed to encouraging internal development and providing significant career enrichment opportunities. Most importantly, what has propelled AKIRA’s growth and success over the years has been the dynamic culture within the company - if you’re filled with passion, have a strong desire to get things done, and if you want to go to a place where you know your work matters and where you can implement your ideas and decisions, then AKIRA just might be the place for you. Job Type: Full TimeThis position does not offer remote flexibility at this time. ",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-30T21:51:35.000Z"
    },
    "company": {
        "name": "AKIRA/shopAKIRA.com",
        "link": "https://www.linkedin.com/company/akira-shopakira-com"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}