{
    "job": {
        "title": "Software Engineer - New Grad 2022",
        "industry": "Computer Software",
        "description": "What We're Looking ForStytch is the platform for user authentication. We make it simple for developers to build complex authentication flows in a matter of minutes. We look for engineers who are excited to think about what to build, not just how to build it, whether that be a new API product, a feature in our developer dashboard, or a new data pipeline.What Excites YouA collaborative environment with a tight feedback loop between the work you do and the impact it has on usersSolving problems with pragmatic solutions — you know when to make trade offs between complexity and shipping quicklyShaping the culture and growing the team through recruiting, mentorship, and establishing best practicesLearning new skills and technologies in a fast paced environment — as a small start up, things move quicklyWhat Excites UsCuriosity and excitement to dive into complex problemsA degree in Computer Science or similarWhat Success Looks LikeTechnical — build foundations that enable our team to create experiences that delight developers and end usersOwnership — advocate for projects and solutions that you believe in and ship them to productionLeadership — level up your teammates by providing feedback and guidanceOur Tech StackGo for back end servicesNode and Typescript for our web servicesReact on the front end Swift for our iOS sdk and Kotlin for the Android sdkWe run on AWS with Kubernetes for containerizationgRPC and protobufs for internal service communicationWe're looking to hire a GREAT team and that means hiring people who are highly empathetic, ambitious, and excited about building the future of user authentication. You should feel empowered to apply for this role even if your experience doesn't exactly match up to our job description (our job descriptions are directional and not perfect recipes for exactly what we need). We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. We look forward to hearing from you!Learn more about our team and culture here!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-04T12:55:07.000Z"
    },
    "company": {
        "name": "Stytch",
        "link": "https://www.linkedin.com/company/stytch"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}