{
    "job": {
        "title": "Junior Software Engineer",
        "industry": "",
        "description": "Who we areTagg is a social-branding for Gen Z. In the digital world, the more authentic your brand, the more genuine your connections. We are building and growing an environment for full creative expression of oneself—no restrictions, no stigma. You should be unapologetically YOU while making friends and keeping up with trends! We have raised capital from Biz Stone’s Future Positive, Pillar VC, Stephen Kaufer (Founder/CEO at TripAdvisor) and more. Other notable investors/advisors include ex- CEO at Sony, Chairman at Snapchat, ex-VP of Product/Growth at Uber, ex-Head of Intl. Growth at Facebook, ex-Head of Product/Growth at Pinterest, ex-CMO at ViacomCBS and more. About YouYou need to eat, breathe, and sleep software development —seriously, you must be fanatical about it.This role is full-time, will report directly to the CTO, and will work closely with the product manager and designers.We have high standards of quality, so this job will be fast-paced and collaborative, withan emphasis on “getting things done right,” and not just getting them done. What you’ll doJoin our team working on our flagship social-branding platform.Collaborate with other members of our SWE team, to craft and implement the product backlog and learn new technologies, while working on scaling our platform.Collaborate with the members of other Tagg teams across the board to shape our product and influence the direction in which Tagg takes its main platform.Become part of a close, committed, and lively team that assumes ownership of its work, takes pride in it, and is fully invested in the success of the product. What we’re working withMobile application development with React NativeAPI design and development with DjangoAWS for everything in the cloudScrum helps us keep track of what is important and shorten our feedback loop Requirements2+ years of experienceFull-time availabilityWilling to work out of our office in the Palo AltoWilling to work with us after-hoursAlways learning attitude :) Nice to HavesManage & scale APIs built in DjangoHas built social appsUI/UX design knowledge, experience, or at least interestAn eye for design Benefits Competitive salary and equity Comprehensive insurance Hands on access to unmatched social capital  Send your resume to careers@tagg.id",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-30T22:16:09.000Z"
    },
    "company": {
        "name": "Tagg ",
        "link": "https://www.linkedin.com/company/taggid"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Palo Alto",
        "region": "CA",
        "postal_code": "94310",
        "street_address": null,
        "latitude": 37.445103,
        "longitude": -122.16036
    }
}