{"location": {"country": "US", "locality": "San Francisco Bay Area", "region": "San Francisco Bay Area", "postal_code": "94112", "street_address": null, "latitude": 37.39271, "longitude": -122.042}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Site Reliability Engineer", "industry": "", "description": "We’re looking for a Senior Site Reliability Engineer to join our tight infrastructure\nteam that gets to architect, build, and operate modern cloud-native AWS\nenvironments and host enterprise-grade SaaS products. We use cutting edge\ntooling and cloud solutions to create innovative, resilient, observable, and secure\nsolutions. We use Infrastructure as Code to define resources and configurations,\nmachine images to deploy idempotent VMs, and build Jenkins pipelines to\nautomate blue/green and canary deployments of applications. We’ve embraced\nworking remotely and look forward to you joining the team.\nWho We Are\nAbsenceSoft is a rapidly growing Leave Management software company looking to hire\namazing people like you! We are a radically innovative provider of SaaS solutions for\nFMLA, Disability, ADA, and other types of absences. We pride ourselves in having\ncreated the most easily used, installed, and understood absence management system\nand Human Resources Software. We value creative, innovative people who are\npassionate about their work and who always believe there is always a better way.\nLeading With Our Core Values (THRIVE)\n•\nTeam\n- We are a team. We show up for each other, act with empathy, listen well, have\nfun, collaborate, and bring our authentic selves to work every day.\n• Honesty\n- We are honest, trustworthy, and transparent with each other and our clients.\nWe act with integrity, ask the tough questions, and are open to honest feedback.\n• Results\n- We are results-driven and act with urgency, accountability, and commitment.\nWe strive for continuous improvement and operational efficiency.\n• Inspiring\n- We inspire and challenge each other every day. We bring a positive, can-do\nattitude to the team and lift everyone up around us.\n• Value\n- We provide tremendous value to our customers, employees, and shareholders,\nwhich drives everything we do and guides our decision making.\n• Entrepreneuria\nl - We are willing to try new things and take risks, without fear of\nfailure. We continuously learn and improve in a fast-paced environment.\nWhat You’ll Do\n• Create and maintain well-architected, idempotent AWS environments\n• Define infrastructure in Terraform\n• Create ansible playbooks to build fully baked AMIs\n• Build Jenkins jobs to deploy infrastructure and applications\n• Build and maintain data streaming and lambda functions for automation and\nmonitoring\n• Architect security and reliability solutions\n• Manage and monitor centralized monitoring and logging\n• Build an observability architecture with APM and SIEM\n• Troubleshoot and resolve performance and capacity hotspots in the platform\n• Create infrastructure self-service tooling to empower development and support\nteams\nWhat’ll Set You Up for Success\n• Bachelor’s degree in Computer Science or equivalent experience\n• 3+ year SaaS / commercial for Market software experience\n• 3+ years plus Cloud Operations/DevOps experience on AWS\n• Experience with CI/CD preferably with Jenkins\n• Experience with Puppet or Ansible on Linux and/or Windows\n• Experience Networking and DNS experience\n• Experience managing microservice architectures a plus\n• Experience with AWS serverless products a plus\n• Entrepreneurial in thinking, outlook, and creative problem-solving\nWhat To Know Before You Apply\n• We’re located in beautiful Golden, Colorado.\n• This is a full-time, salaried position.\n• AbsenceSoft provides a wide variety of perks and benefits. Including full medical,\ndental, vision, 401K, and life insurance. Our brand new state of the art office has\nautomatic standing desks and a brand new oversized kitchen complete with\nunlimited snacks and drinks. We support your professional growth including\nindustry training and CLMS Certification; opportunities for additional industry and\ntechnology certifications, and continuing education.\n• The salary range for this position is between $90,000 - $150,000.", "employment_type": "FULL_TIME", "date_posted": "2021-10-05T16:55:33.000Z"}, "company": {"name": "AbsenceSoft", "link": "https://www.linkedin.com/company/absencesoft"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}