{
    "job": {
        "title": "Software Engineer - All Teams (All Levels)",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "At Lyft, our mission is to improve people’s lives with the world’s best transportation. To do this, we start with our own community by creating an open, inclusive, and diverse organization.Lyft is looking for experienced software engineers from a scope of disciplines. We are growing our team with people who want to build, improve and incorporate technologies that make the lives of our community more enriched. As an engineer at Lyft, you'll collaborate with teams like product, data science, analytics, and operations on code that empower us to iterate quickly, while focusing on delighting our passengers and drivers.ResponsibilitiesHelp establish roadmap and architecture based on technology and our needsWrite well-crafted, well-tested, readable, maintainable codeParticipate in code reviews to ensure code quality and distribute knowledgeShare your knowledge by giving brown bags, tech talks, and promoting appropriate tech and engineering best practicesCan help lead large projects from idea to positive executionUnblock, support and communicate with internal partners to achieve resultsExperience5+ years of software engineering industry experienceExperience with object-oriented programmingExperience in distributed systemsExperience working with databases, relational or NoSQLWrite clear, scalable and clear design documentationDesign, build and improve a set of team owned componentsBenefitsGreat medical, dental, and vision insurance optionsMental health benefitsIn addition to 12 observed holidays, salaried team members have unlimited paid time off, hourly team members have 15 days paid time off401(k) plan to help save for your future18 weeks of paid parental leave. Biological, adoptive, and foster parents are all eligiblePre-tax commuter benefitsLyft Pink - Lyft team members get an exclusive opportunity to test new benefits of our Ridership ProgramLyft is an equal opportunity/affirmative action employer committed to an inclusive and diverse workplace. All qualified applicants will receive consideration for employment without regards to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status or any other basis prohibited by law. We also consider qualified applicants with criminal histories consistent with applicable federal, state and local law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T14:20:58.000Z"
    },
    "company": {
        "name": "Lyft",
        "link": "https://www.linkedin.com/company/lyft"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": ""
    },
    "salary": {
        "currency": "USD",
        "min_value": 106000,
        "max_value": 230000,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10001",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}