{"location": {"country": "US", "locality": "Frisco", "region": "Frisco", "postal_code": "75034", "street_address": null, "latitude": 33.15066, "longitude": -96.82508}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Architect, Data", "industry": "Information Technology and Services,Computer Software,Financial Services", "description": "Job Description\n**This position can be located in Overland Park, KS; Frisco, TX OR Atlanta, GA**\nFinCo Visualization, Analytics, Data Engineering & Reporting (VADER) serves all of Finance as a provider of reporting and analytics around T-Mobile’s financial products (loans, leases, securitization) with a focus on:\nAutomation\nImproved Timeliness and Accuracy of data\nData Engineering services for complex processes\nSelf-Service\nEmpower users by removing roadblocks to information and insights\nVisualization and Analytics\nDeep dives into data, providing ad-hoc and recurring reconciliations\nData visualizations that quickly tell a story\nWe are looking for a savvy Data Engineer to join our growing team of analytics experts. The hire will be responsible for expanding and optimizing our data and data pipeline architecture, as well as optimizing data flow and collection for cross functional teams. The ideal candidate is an experienced data pipeline builder and data wrangler who enjoys optimizing data systems and building them from the ground up. The Data Engineer will support our report developers, database architects, data analysts and data scientists on data initiatives and will ensure optimal data delivery architecture is consistent throughout ongoing projects. They must be self-directed and comfortable supporting the data needs of multiple teams, systems and products. The right candidate will be excited by the prospect of optimizing or even re-designing our company’s data architecture to support our next generation of products and data initiatives.\nFunctional Group\nFinance\nLocation\nTX520-TX-Frisco II RBO\nLocation Address\n3560 Dallas Pkwy\nCity\nFrisco\nState\nTexas\nZip\n75034\nOther Locations Available\nOverland Park, KS; Atlanta, GA\nTravel Required?\nNo\nResponsibilities\nCreate and maintain optimal data pipeline architecture,\nAssemble large, complex data sets that meet functional / non-functional business requirements.\nIdentify, design, and implement internal process improvements: automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.\nBuild the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using SQL and AZURE technologies.\nBuild analytics tools that utilize the data pipeline to provide actionable insights into customer acquisition, operational efficiency and other key business performance metrics.\nWork with stakeholders including the Executive, Product, Data and Design teams to assist with data-related technical issues and support their data infrastructure needs.\nCreate data tools for analytics and data scientist team members that assist them in building and optimizing our product into an innovative industry leader.\nWork with data and analytics experts to strive for greater functionality in our data systems.\nQualifications\n5+ years of experience in a Data Engineer role, who has attained a Graduate degree in Computer Science, Statistics, Informatics, Information Systems or another quantitative field.\nAdvanced working SQL knowledge and experience working with relational databases, query authoring (SQL) as well as working familiarity with a variety of databases.\nExperience building and optimizing data pipelines, architectures and data sets.\nExperience performing root cause analysis on internal and external data and processes to answer specific business questions and identify opportunities for improvement.\nStrong analytic skills related to working with structured or unstructured datasets.\nBuild processes supporting data transformation, data structures, metadata, dependency and workload management.\nA successful history of manipulating, processing and extracting value from data files.\nStrong project management and organizational skills.\nExperience supporting and working with cross-functional teams in a dynamic environment.\nExperience with relational SQL databases, including Teradata, Oracle, SQL server.\nExperience with Azure cloud services.\nExperience with object-oriented/object function scripting languages: Python, Java, etc.\nExperience in a data analysis role\nExperience or working knowledge of SAS, Oracle APEX, Snowflake is a plus\nMinimum Qualifications\nAt least 18 years of age.\nLegally authorized to work in the United States.\nHigh School Diploma or GED.\nPre-employment background screen.\nCompany Profile\nT-Mobile U.S. Inc. (NASDAQ: TMUS) is America’s supercharged Un-carrier, delivering an advanced 4G LTE and transformative nationwide 5G network that will offer reliable connectivity for all. T-Mobile’s customers benefit from its unmatched combination of value and quality, unwavering obsession with offering them the best possible service experience and undisputable drive for disruption that creates competition and innovation in wireless and beyond. Based in Bellevue, Wash., T-Mobile provides services through its subsidiaries and operates its flagship brands, T-Mobile, Metro by T-Mobile and Sprint. For more information please visit: http://www.t-mobile.com\nApplicant Privacy Policy\nWe are committed to maintaining your trust by respecting and protecting your privacy. For more information about how T-Mobile processes the personal data of job applicants, please visit Applicant Privacy Policy .\nEOE Statement\nEqual Employment Opportunity\nWe take equal opportunity seriously—by choice.\nT-Mobile USA, Inc. is an Equal Opportunity Employer. All decisions concerning the employment relationship will be made without regard to age, race, ethnicity, color, religion, creed, sex, sexual orientation, gender identity or expression, national origin, religious affiliation, marital status, citizenship status, veteran status, the presence of any physical or mental disability, or any other status or characteristic protected by federal, state, or local law. Discrimination, retaliation or harassment based upon any of these factors is wholly inconsistent with how we do business and will not be tolerated.\nPositions Remaining\n1\nBrand\nT-Mobile\nSchedule\nFull Time", "employment_type": "FULL_TIME", "date_posted": "2021-08-25T17:42:35.000Z"}, "company": {"name": "T-Mobile", "link": "https://www.linkedin.com/company/t-mobile"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}