{"location": {"country": "US", "locality": "Austin", "region": "Austin", "postal_code": "78746", "street_address": null, "latitude": 30.264978, "longitude": -97.7466}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Junior Software Engineer, Full-Stack", "industry": "Information Technology and Services,Computer Software,Internet", "description": "About CharterUP\nWe aim to be the leading charter bus platform in the world and are looking for talented and ambitious people that want to be along for the ride! We are disrupting the massive and highly fragmented bus industry by using our proprietary technology to seamlessly connect bus companies to customers (businesses, non-profits, and governments). By promoting group travel, we can reduce the transportation industry's carbon footprint and help make our planet greener. We are achieving success by delighting our people, our customers, and our bus partners.\nAbout This Role\nWe are looking to add a Full-Stack Software Engineer to the team. You will be working with top notch-talent that includes both our internal team as well as some of the brightest contractors. No member is an island. At CharterUP you will be a part of a team with deep knowledge of all areas of software development.\nOur team embraces Agile methodologies and is quick to adapt. We use a wide range of languages and tools. Our latest products are finely crafted weblications that empower our users. We are passionate about user experience. And we are excited about showing up to code. You can expect to be challenged. You can expect your contributions to be accepted and appreciated. And you can expect your skills to become even sharper. Iron sharpens iron.\nWe are looking for someone who understands software architecture, data modeling, and object-oriented programming concepts. You must be a coder. We would love to see examples of interesting solutions you've created.\nCompensation\n$85,000 base salary\nMaterial equity award\nWhat You’ll Do\nEfficiently roll out technical features from concept to product\nCollaborate with a team to develop our next generation travel platform\nDevelop tooling and processes to benefit and grow our team\nWhat You’ll Need\nBachelor's degree in Computer Science, Computer Engineering, or similar STEM degree from a top-ranked institution\nBack-end expertise in Java Spring Boot or Hibernate\nFront-end expertise in Vue, React, or Angular\nPotential to quickly develop expertise in any part of our tech stack where you have limited experience\nLocation\nCharterUP's headquarters are in Atlanta but employees can work remotely full-time or from one of CharterUP's satellite offices in New York City, San Francisco, or Austin.\nTeam Application Process\nCandidate submits CharterUP online application\nResumes encouraged to be at most one page in length\nAnswers to all initial application questions thoroughly reviewed\nInitial evaluation\nCoding exercise\nGeneral aptitude assessment\nShort interview with executives\nInterviews\nLong dev team interview, which includes CTO and other engineers\nInformal conversation with junior engineers\nOffer\nBackground and reference checks prior to formal offer\nCharterUP Principles\nAt CharterUP, we don’t compromise on quality. We hire smart, high-energy, trustworthy people and keep them as motivated and happy as possible. We do that by adhering to our principles, which are:\nCustomer First\nWe always think about how our decisions will impact our clients; earning and keeping customer trust is our top priority\nWe are not afraid of short-term pain for long-term customer benefit\nCreate an Environment for Exceptional People\nWe foster intellectual curiosity\nWe identify top performers, mentor them, and empower them to achieve\nEvery hire and promotion will have a higher standard\nEveryone is an Entrepreneur / Owner\nNo team member is defined by their function or job title; no job is beneath anyone\nWe do more with less; we are scrappy and inventive\nWe think long-term\nRelentlessly High Standards\nWe don’t accept “that’s how it’s always been done”; we constantly innovate and question established routines to improve processes\nWe actively push to be proved wrong and welcome different ideas; the best idea wins\nWe don’t compromise on quality\nClarity & Speed\nWhen in doubt, we act; we can always change course\nWe focus on the key drivers of a process that will deliver the most results\nMandate to Dissent & Commit\nWe are confident in expressing our opinions; it is our obligation to express our disagreement\nOnce we decide, we enthusiastically move together in the agreed upon direction", "employment_type": "FULL_TIME", "date_posted": "2021-08-20T00:00:00.000Z"}, "company": {"name": "CharterUP", "link": "https://www.linkedin.com/company/charterup"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}