{"location": {"country": "US", "locality": "Westlake Village", "region": "Westlake Village", "postal_code": "91363", "street_address": null, "latitude": 34.14381, "longitude": -118.799644}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Cloud Data Engineer", "industry": "Retail", "description": "Position Summary: Cloud Data Engineer\nThe Cloud Engineer will provide a strong leadership role in developing the Enterprise data architecture of Digital and Retail businesses across different guitar Center brands, providing technical guidance, architecture, and enforcing technical standards. Provides assessments and prototyping of new concepts and technologies and often develops capabilities to be handed off to operational development teams. Provides analysis on complex problems as well as be an active member of enterprise technology design decisions.\nResponsibilities will include, but will not be limited to the following:\nAccountable for modernization, migration/transformation to a cloud data platform\nDesign and build reliable, scalable data infrastructure with leading privacy and security techniques to safeguard data\nArchitect scalable, secure, low latency, resilient and cost-effective solutions for enabling predictive and prescriptive analytics across the organization\nDesign/ Architect frameworks to Operationalize ML models through serverless architecture and support unsupervised continuous training models\nTake over and scale our data models (Tableau, Dynamo DB, Kibana)\nCommunicate data-backed findings to a diverse constituency of internal and external stakeholders\nBuild frameworks for data ingestion pipeline both real-time and batch using best practices in data modeling, ETL/ELT processes, and hand off to data engineers\nParticipate in technical decisions and collaborate with talented peers\nReview code, implementations and give meaningful feedback that helps others build better solutions\nHelps drive technology direction and choices of technologies by making recommendations based on experience and research\nAdditional duties as assigned\nAbout Guitar Center\nThe Guitar Center Company embodies the world of creativity and music by encouraging our teammates to find their own individual sound. Our mission is to develop and nurture lifelong musicians and make a difference in the world by enabling musicians and non-musicians alike to experience the joy that comes from creating music. We believe in putting our customers first, engaging with respect and integrity, and fulfilling our mission with passion.\nThe Guitar Center Company operates through several business divisions. Guitar Center is the world's largest retailer of guitars, amplifiers, drums, keyboards, recording, live sound, DJ, and lighting equipment, with more than 290 stores across the United States.  2014 marked the milestone 50th anniversary of the Guitar Center Company as the organization continues to help people make music from coast to coast.\nE-Commerce brands Guitar Center, Musician's Friend and WWBW offer online sales of a broad selection of music products. The Music & Arts division operates more than 220 stores specializing in band & orchestral instruments for sale and rental, serving teachers, band directors, college professors, and students since 1952. AVDG and GCPro headline the enterprise audio-visual integration business, delivering a best-in-class commercial and residential customer experience.\nTo Join Our Band, You'll Need The Following Experience\n7 or more years of experience working directly with enterprise data solutions\nHands-on experience working in a public cloud environment and on-prem infrastructure.\nSpecialty on Columnar Databases like Redshift Spectrum, Time Series data stores like Apache Pinot, and the AWS cloud infrastructure\nExperience with in-memory, serverless, streaming technologies and orchestration tools such as Spark, Kafka, Airflow, Kubernetes\nCurrent hands-on implementation experience required, possessing 7or more years of IT platform implementation experience.\nAWS Certified Big Data - Specialty desirable\nExperience designing and implementing AWS big data and analytics solutions in large digital and retail environments is desirable\nAdvanced knowledge and experience in online transactional (OLTP) processing and analytical processing (OLAP) databases, data lakes, and schemas.\nExperience with AWS Cloud Data Lake Technologies and operational experience of Kinesis/Kafka, S3, Glue, and Athena.\nExperience with any of the message/file formats: Parquet, Avro, ORC\nDesign and development experience on a Streaming Service, EMS, MQ, Java, XSD, File Adapter, and ESB based applications\nExperience in distributed architectures such as Microservices, SOA, RESTful APIs, and data integration architectures.\nExperience with a wide variety of modern data processing technologies, including:\nBig Data Stack (Spark, spectrum, Flume, Kafka, Kinesis, etc.)\nData streaming (Kafka, SQS/SNS queuing, etc)\nColumnar databases (Redshift, Snowflake, Firebolt, etc)\nCommonly used AWS services (S3, Lambda, Redshift, Glue, EC2, etc)\nExpertise in Python, pySpark, or similar programming languages\nBI tools (Tableau, Domo, MicroStrategy)\nUnderstanding Continuous Integration/Continuous Delivery\nWhy\njoin\nus?\nWith a career at Guitar Center, you become part of the world's largest multichannel musical instrument retailer. Whether at our Stores, Contact Centers, Distribution Centers, or Support Center, Guitar Center employees have a common goal: to help people find their sound and fill the world with more music.\nLove\nthis\ngig\nand\nwant\nto\napply?\nSend your resume and cover letter today along with salary expectations!\nGuitar Center is an Equal Opportunity Employer and provides fair and equal employment opportunity to all employees and applicants regardless of race, color, religion, gender, sexual orientation, gender identity, national origin, age, disability, veteran status or any other protected status prohibited under Federal, State, or local laws. All employment decisions are based on valid job‐related requirements.\nIf you are a qualified individual with a disability or a disabled veteran and are unable or limited in your ability to use or access our website, you may request a reasonable accommodation to express interest in a specific opening. You can request a reasonable accommodation by sending an email to\nrecruiting@guitarcenter.com\n.", "employment_type": "FULL_TIME", "date_posted": "2021-07-20T06:09:55.000Z"}, "company": {"name": "Guitar Center", "link": "https://www.linkedin.com/company/guitar-center"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 84, "seniority_level": "Senior"}}