{"location": {"country": "US", "locality": "Chattanooga", "region": "Chattanooga", "postal_code": "37419", "street_address": null, "latitude": 35.045757, "longitude": -85.30829}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": ".Net Engineer - Javascript/SQL/Angular - Great Team!!", "industry": "Mechanical or Industrial Engineering", "description": "If you are a .Net Software Engineer with 5+ years of experience, please read on!\nJob Title:\n.Net Software Engineer\nLocation:\nChattanooga TN - Onsite team\nSalary:\n$85K - $100K\nRequirements:\nBS Computer Science/ Engineering/ IT with 3+ years of IT Development Experience\nThis would be an amazing opportunity for you if you are looking to join a growing dynamic team.\nAdditional ways in which a candidate may stand out would be:\nAbility to work in a fast paced, team oriented development environment\nExcellent troubleshooting skills\nExcellent communication skills and be able to communicate technical ideas effectively\nWhat You Will Be Doing\nDelivery high quality code both individually and in a team environment\nDevelop new line of business and customer facing software systems\nDevelop enhancements and maintain line of business and customer facing software systems\nProvide Teir 3 support for custom and COTS applications as issues are escalated\nMentor junior team members\nCollaborate with the IT team to complete projects\nCompletes special projects upon requests, and other duties as assigned.\nWhat You Need for this Position\nBachelors Degree in Computer Science, Engineering, Information Technology\nMicrosoft certifications preferred\n3+ years of IT development experience\n3+ years of .Net 3.5+, C#, ASP.NET\n3+ years with modern Javascript development, CSS, and HTML\n3+ years with SQL and Relational Databases\n3+ years with Entity Framework, LINQ, and SQL\n3+ years of experience with Javascript frameworks like Angular, Aurelia, etc.\nSystems development lifecycle, Scrum, Agile, etc.\nBrowser dev tools\nIOC, DI, MVC, MVVM\nObject Oriented Programming\nMulti-tier database-driven systems\nWhat's In It for You\nVacation/PTO\nMedical\nDental\nVision\n401k\nSo, if you are a Software Engineer with experience, please apply today!\nEmail Your Resume In Word To\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nJenn.Parrella@CyberCoders.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : JP10-1642057 -- in the email subject line for your application to be considered.***\nJenn Parrella - Lead Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\nYour Right to Work\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.", "employment_type": "FULL_TIME", "date_posted": "2021-07-31T07:18:53.000Z"}, "company": {"name": "CyberCoders", "link": "https://www.linkedin.com/company/cybercoders"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}