{"location": {"country": "US", "locality": "Boston", "region": "Boston", "postal_code": "02118", "street_address": null, "latitude": 42.358994, "longitude": -71.05863}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Website Data Analyst - Consumer Based Website Analysis", "industry": "Leisure, Travel &amp; Tourism", "description": "If you are a Website Data Analyst with 3+ years of experience, please read on!\nJob Title:\nWebsite Data Analyst\nLocation:\nBoston MA\nSalary:\n$100-120K Based on experience\nRequirements:\nBachelor's Degree in Data/Applied Statistics/Math or Computer Science field preferred\nThis would be an amazing opportunity for you if you are looking to join a growing team in a dynamic industry! Take your career to the next level!\nAdditional ways in which a candidate may stand out would be:\nAlteryx, Snowflake\nPredictive modelling using Python, R or other tool\nWorking with big data\nWhat's In It for You\nVacation/PTO\nMedical\nDental\nVision\n401k\nWhat You Will Be Doing\nIdentify the Top 3 customer behaviors on web that lead to conversion\nAnalyze customer behavior to understand most compelling content by product\nAnalyze any spikes & dips in KPIs vs plan/ historical/ trend\nPerform ad-hoc analysis and drive insights and recommendations to support channel growth\nAnalyze Web statistics & Content performance\nIdentify & raise gaps in tagging/tracking of website behavior\nWork with data teams to create projects to bring in new data points for analysis and reporting\nImplementation requirements of Adobe Analytics and Website Tagging\nProduce ad-hoc queries and develop reports to understand website behavior\nCreate & maintain reporting dashboards for web and email KPIs\nWhat You Need for this Position\nBachelor Degree in Data, Applied Statistics, Math or Computer Science field\n5+ years of experience in Data Analysis\n3+ years of Oracle, SQL\n3+ years of working in Database/Data warehouse environments\n3+ years of Tableau\n2+ years experience on Adobe website tools\nExperience analyzing video performance on websites\nStrong data storytelling, quantitative & analytical skills\nProven ability to work in fast paced, multi task environments\nAbility to communicate data trends in a business language with recommended actions to improve key KPIs based on customer behavior\nSo, if you are a Website Data Analyst with 3+ years of experience, please apply today!\nEmail Your Resume In Word To\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nJenn.Parrella@CyberCoders.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : JP10-1641985 -- in the email subject line for your application to be considered.***\nJenn Parrella - Lead Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\nYour Right to Work\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.", "employment_type": "FULL_TIME", "date_posted": "2021-07-31T07:18:55.000Z"}, "company": {"name": "CyberCoders", "link": "https://www.linkedin.com/company/cybercoders"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}