{"location": {"country": "US", "locality": "Dallas", "region": "Dallas", "postal_code": "75342", "street_address": null, "latitude": 32.777977, "longitude": -96.79621}, "salary": {"currency": "USD", "min_value": 77600, "max_value": 148000, "unit": "YEAR"}, "job": {"title": "Data Scientist", "industry": "Marketing and Advertising", "description": "Who We Are\nWe create the data products & technology that make advertising work better for people.\nChoreograph, an affiliate of GroupM, is a global data products and technology company, purpose-built for an era that demands a new approach to data management, usage, and brand growth.\nData is the fuel that powers growth. The companies who best leverage data are creating unbeatable advantages over their competitors while simultaneously connecting with customers more effectively.\nOur goal is to help future-focused businesses use their data in ways that meet savvy customers’ expectations while building trust and understanding.\nWe are over 700 strong in 17 markets around the world and we offer a modular product suite, empowering marketers to drive sustainable, data-enabled growth.\nWho We Are Looking For\nChoreograph is looking for a Data Scientist with interest and experience in Machine Learning Engineering & Machine Learning Operations, as well as the productization and optimization of Machine Learning models. Closely partnering with the product management, engineering and architecture practices to help develop and improve the product offerings of Choreograph. You will be joining a large team of data scientists with experience and expertise in a wide range of methodologies, toolkits and applications to a variety of problems in the media landscape.\nYou will collaborate with other data scientists to help improve and enrich data and additional product offerings. This reaches from data engineering, setting and defining best practices and scaling Machine Learning POCs.\nWhat You’ll Do\nDesigning, developing and testing machine learning and deep learning pipelines and platforms\nRunning machine learning tests and experiments\nAutomating and scaling machine learning POCs to production-level quality\nSupporting internal and external stakeholders on the machine learning systems and use of underlying data\nUse systems and internal processes efficiently and integrate these in daily work\nClear communication of insights and findings to stakeholders\nWork in collaborative teams with members with a wide range of skills and expertise\nWork at the cutting edge of commercial market analytics and research\nAbility to focus and develop skills based on interests\nWhat You’ll Need\nMasters or PhD in Computer Science, Mathematics, Statistics, Physics, Economics, or a related field.\nExperience analyzing large volumes of data (e.g. Spark) (3+ years)\nExcellent analytical skills and strong statistical knowledge, as well as interest in applying them to complex problems\nProgramming proficiency in Python (3+ years)\nFamiliarity with machine learning frameworks (like Tensorflow) and platforms (Kubeflow, Sagemaker, CPD)\nA passion for empirical research and for answering hard questions with data\nA flexible analytic approach that allows for results at varying levels of precision\nAbility to communicate and navigate between data science and software engineering\nSUCCESS ATTRIBUTES\nDetail-oriented\nCurious problem solver\nAnalytical thinker\nPOTENTIAL CAREER PATH\nSr. Data Scientist\nChoreograph offers a competitive benefits package, including medical, dental, vision, short & long-term disability, life insurance/AD&D and 401k matching. We offer paid vacation, unlimited wellness, company holidays, personal days and paid parental leave. Last, but not least, we provide a breadth of training opportunities to support your development.\nChoreograph™ is WPP’s global data products and technology company fueling growth for the world’s most admired brands. Discover more about Choreograph at www.choreograph.com\nChoreograph is committed to building a team that represents a variety of backgrounds, perspectives and skill. Our work is enhanced through inclusivity. We rely on legitimate interest as a legal basis for processing personal information under the GDPR for purposes of recruitment and applications for employment.\nReference ID: MP0327", "employment_type": "FULL_TIME", "date_posted": "2021-07-19T16:07:53.000Z"}, "company": {"name": "Choreograph", "link": "https://www.linkedin.com/company/choreograph"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}