{"location": {"country": "US", "locality": "Iselin", "region": "Iselin", "postal_code": "08830", "street_address": null, "latitude": 40.573746, "longitude": -74.323814}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Senior Artificial Intelligence Consultant", "industry": "Information Technology and Services,Financial Services", "description": "Sr. Consultant - Artificial Intelligence\nIncedo is a US-based consulting, data science and technology services firm\nwith\nover 2,000 people\nhelping clients from our\nsix offices across US and India\n. We help our clients achieve competitive advantage through end-to-end digital transformation. Our uniqueness lies in bringing together strong engineering, data science, and design capabilities coupled with deep domain understanding. We combine services and products to maximize business impact for our\nclients in telecom, financial services, product engineering and life science & healthcare industries\n.\nWorking at Incedo will provide you an opportunity to\nwork with industry leading client organizations, deep technology and domain experts, and global teams\n.\nIncedo University\n, our learning platform, provides ample learning opportunities starting with a structured onboarding program and carrying throughout various stages of your career. A variety of fun activities are also an\nintegral part of our friendly work environment\n. Our\nflexible career paths\nallow you to grow into a program manager, a technical architect or a domain expert based on your skills and interests.\nRole Description:\nAs a Sr. Consultant-AI on the Data Science team, you will play a critical role in ideating, developing and then implementing advanced analytics solution in production. You will be helping business leaders identify and prioritize their business problems, based on value creation and Business ROI. These may be opportunities within a single line of business or cross-organizational initiatives. This role helps in bridging the technical expertise of Data Scientists with the operation expertise of frontline managers thereby ensuring that the deep insights generated through sophisticated analytics translate into impact at scale in an organization.\nPotential hires are expected to own the end-to-end process from development into implementation which involves data extraction, feature engineering, model building and model testing along with documentation.\nRole and responsibilities\nProblem solving and client consulting:\nStrong problem solving and analytical skills with excellent understanding of critical business problems in domains – preferably Telecom.\nBreaking up big business problems into actionable Analytics/ Data Science problems\nGive thought leadership on problem definition and defining the key metrics to target.\nAbility to translate a business problem into digital and analytics problem.\n“Own the problem” and integrate design, analytics, and engineering capabilities to deliver impactful solution to client problems.\nData Analytics and Insights\n·      Understand client and business\ndomain and integrate client business issues with data insights.\n·      Ability to analyze business metrics, perform data analysis to generate and deliver impactful insights and recommendation.\n·      Identify the important variables that will be required for the model.\n·      Design the validation metric to evaluate machine learning models.\n·      Ability to work in multiple projects/ problems in parallel.\nTechnical skills requirements\nThe candidate must demonstrate proficiency in,\n·      Conceptual understanding on machine learning techniques\n·      Extremely detail-oriented with high standards for written and visual presentation of information as well as idea.\n·      Ability to develop and articulate strategic recommendations based on rigorous data analysis.\n·      Strong expertise in SQL\n·      Prior experience in ML models deployed in production.\n·      Strong understanding of A/B, Multivariate testing.\n·      EDA/preliminary model building using Python.\n·      Data Visualization skills in Tableau/Power BI/Looker or similar tools.\n·      Experience with model explainability techniques and building an explainable ML solution.\n·      Experience presenting to and influencing functional leaders and stakeholders.\nNice-to-have skills:\n·      Prior experience with Telecom industry and a deep understanding of common problem statements and solutions in Telecom\n·      Exposure to working in a cloud environment (preferably GCP)\nQualifications:\nB.E/B.Tech., with an MBA degree from a reputed university\n·      5+ years of experience in Business/AI/Analytics Consulting in a Client Management/ Consulting role\nWe are an Equal Opportunity Employer\nWe value diversity at Incedo. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.", "employment_type": "FULL_TIME", "date_posted": "2021-07-09T20:22:44.000Z"}, "company": {"name": "Incedo Inc.", "link": "https://www.linkedin.com/company/incedo-inc"}, "education": {"required_credential": null}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}