{
    "job": {
        "title": "Autonomy AI Machine Learning Software Engineer",
        "industry": "Defense & Space",
        "description": "Summary DescriptionThe Autonomy/AI ML Software Engineer is responsible for developing, integrating, and deploying autonomy andartificial intelligence algorithms for mission systems and production and maintenance operations. Translatesrequirements and develops code, determining appropriate software methods, training system to recognizepatterns to perform specific functions. Supports the technology development life cycle from requirementsgeneration through development, integration, scenario development and modeling, testing and debugging.May support research and development on prototyping of autonomous systems in some organizations.Key Responsibilities Develops, integrates, and implements algorithms to enable perception, motion/mission planning, controls,etc. functionality in LM products and platforms Translates requirements and applies requirements to development code, integrating autonomy, AI ormachine learning algorithms to LM products and platforms Determines software methods to best acquire and execute knowledge Implements algorithms into software to train systems to recognize patterns and perform specific functions Responsible for various phases of developing and maintaining autonomy software from requirementsgeneration, software design and development to integration, testing, troubleshooting and debugging, andimplementation Review test outcomes, conducts troubleshooting, and works to debug issues Develops human-machine interface scenarios, breaking missions into tasks Documents interface requirements and implements human-machine interfaces Interfaces with other teams involved the development lifecycle for perception, mission and motionplanning, simulation and modeling, testing, etc.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06T20:25:14.000Z"
    },
    "company": {
        "name": "Lockheed Martin",
        "link": "https://www.linkedin.com/company/lockheed-martin"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Littleton",
        "region": "CO",
        "postal_code": "80018",
        "street_address": null,
        "latitude": 39.61265,
        "longitude": -105.0162
    }
}