{"location": {"country": "US", "locality": "Erlanger", "region": "Erlanger", "postal_code": "41018", "street_address": null, "latitude": 39.016716, "longitude": -84.6005}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Machine Learning Engineer", "industry": "Food Production", "description": "This is an exempt level position\nPosition Summary:\nWe’re looking for a Machine Learning Engineer to join our Emerging Technology team and work with our team of data scientists to automate the training and evaluation of models within an Azure ecosystem. This position will partner with many business, product and science teams, so written and in-person communication skills are extremely important. They must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for building complete engineering solutions supporting the latest advances in artificial technology. We have many different functions in the team, and this role requires a broad range of skills such as machine learning, data, optimization, and platform/infrastructure engineering.\nKey Responsibilities:\nStudy and transform data science prototypes\nDesign machine learning systems\nResearch and implement appropriate ML algorithms and tools\nDesign, build and run services at high scale and availability\nRun machine learning tests and experiments\nTrain and retrain systems when necessary\nExtend existing ML libraries and frameworks\nKeep abreast of developments in the field\nDemonstrates strong business acumen and understanding of manufacturing and finance concepts\nAdept at quickly acquiring software skills\nEvaluate new AI & software tools through POCs and propose solutions for implementation\nDocument guides, systems design, reference architectures and implementations\nJob Requirements:\n5+ years of professional industry experience as a ML Engineer, Data Scientist, or Software Engineer with a focus on building production data/ML products\nDemonstrated success across the entire ML lifecycle including feature engineering, model development, model deployment, & model maintenance\nDemonstratable knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks\nDemonstrated good working knowledge of cloud computing\nExperience designing, developing and shipping web based frontend clients\nProficiency in web technology stacks, UI patterns, React, JavaScript, Typescript\nGood problem solving, debugging, collaboration and communication skills\nExperience optimizing experiences for performance and accessibility\nExpertise in middle tier/backend technologies such as .NET, relational and/or non-relational (NoSQL) databases, web services and RESTful concepts\nUnderstanding of data structures, data modeling and software architecture\nExperience with very large-scale data processing/analysis (a.k.a. Big Data)\nExperience with Azure cloud services\nAbility to work independently to actively identify and drive solutions for evolving business problems\nDeep knowledge of math, probability, statistics and algorithms\nAbility to write robust code in Python and R\nStrong business aptitude, the ability to rapidly learn new problem domains, and become conversant in the domain with subject matter experts\nA drive to learn and master new technologies and techniques\nCreative, proactive, bold and out-of-box thinking\nEducational Requirements\nMS or PhD in Engineering, Statistics, Applied Mathematics, Computer Science, or other technical discipline\nRelocation assistance may be available with this position.\nThis position offers a complete benefit package, including 401K/ESOP, pension, health, life, vision, and dental insurance.\nADM requires the successful completion of a pre-employment drug screen and a background check.\nADM is an EOE for minorities, females, protected veterans and individuals with a disability.\nAbout ADM\nAt ADM, we unlock the power of nature to provide access to nutrition worldwide. With industry-advancing innovations, a complete portfolio of ingredients and solutions to meet any taste, and a commitment to sustainability, we give customers an edge in solving the nutritional challenges of today and tomorrow. We’re a global leader in human and animal nutrition and the world’s premier agricultural origination and processing company. Our breadth, depth, insights, facilities and logistical expertise give us unparalleled capabilities to meet needs for food, beverages, health and wellness, and more. From the seed of the idea to the outcome of the solution, we enrich the quality of life the world over. Learn more at www.adm.com.\nEEO\nADM is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability and veterans status.", "employment_type": "FULL_TIME", "date_posted": "2021-08-09T00:00:00.000Z"}, "company": {"name": "ADM", "link": "https://www.linkedin.com/company/adm"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}