{"location": {"country": "US", "locality": "Horsham", "region": "Horsham", "postal_code": "19044", "street_address": null, "latitude": 40.182846, "longitude": -75.13714}, "salary": {"currency": "USD", "min_value": 56600, "max_value": 123000, "unit": "YEAR"}, "job": {"title": "Software Engineer", "industry": "", "description": "*** We are considering Junior and Experienced Developers at this time ***\n*** We cannot provide Visa Sponsorship at this time ***\nAegis Software is seeking talented software developers to join our team for the continued development of the company’s commercial software products. This includes enhancing, customizing and providing maintenance support for the companies’ entire product suite.\nCandidates should have a passion for software development using the latest and greatest technologies. Our customers and market demand continual improvement through proper code structure, regular code reviews, and thorough testing on everything we produce. This ensures Aegis offers the best functionality to our customers while maintaining performance in high transaction manufacturing environments.\nResponsibilities\n·       Participating and contributing to department and company initiatives.\n·       Working with Development Manager and Lead Engineers to get work assignments.\n·       Learning the codebase and improving your coding skills\n·       Writing and maintaining code to company coding standards\n·       Working on minor bug fixes.\n·       Coordinating with Aegis’ global service team to diagnose and correct software defects reported from the field\n·       Ability to work from a specification through Aegis custom engineering process with assistance from senior developers.\n·       Enhancing the existing Aegis product suite with a strong focus on the end user scenarios and requirements\n·       Working to build understanding of manufacturing industry (including manufacturing standards, jargon, operations)\nRequirements\nBachelor's degree in computer science, software engineering, or another related field.\n1+ years of experience with Object Orientated Programming Language (C# Preferred)\nExposure to one or more of Aegis leveraged technologies (C#, DevXpress, WCF, WPF, MVVM, SQL, LINQ)\nKnowledge of databases and operating systems.\nGood working knowledge of email systems and Microsoft Office software.\nAbility to learn new software and technologies quickly.\nAbility to follow instructions and work in a team environment.\nDetail-oriented.\nTravel Requirements – up to 10%", "employment_type": "FULL_TIME", "date_posted": "2021-07-14T17:14:38.000Z"}, "company": {"name": "Aegis Software Corporation", "link": "https://www.linkedin.com/company/aegis-industrial-software"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 12, "seniority_level": "Junior"}}