{"location": {"country": "US", "locality": "New York", "region": "New York", "postal_code": "10132", "street_address": null, "latitude": 40.713047, "longitude": -74.00723}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Scientist", "industry": "Information Technology and Services,Computer Software,Financial Services", "description": "If you are a Data Scientist with experience in Python, SQL, and Pytorch and want to be part of an advanced technology company that provides growing companies, and investors access to a broad spectrum of curated data to enhance capital raising. Please read on!\nFounded in 2013 we enabled buyers and sellers to discover the connections and opportunities that others have missed. We use AI, deep learning and NLP- driven algorithms to make data smarter and make raising growth capital efficient and intelligent. If this interests you Lets Talk!\nWhat You Will Be Doing\nAs a Data Scientist you will be responsible for research and detect valuable data sources and automate collection processes. Perform preprocessing of structured and unstructured data. You will also modify and combine different models through ensemble modeling. Finally you will help develop and suggest solutions and strategies to business challenges.\nWhat You Need for this Position\nMust Have\nQualifications:\nPh.D./ M.S in a quantitative field (Computer Science, Data Science etc.)\n3+ years expertise in Python and SQL\n2+ years experience of working as a Data Scientist\nPyTorch\nML/NLP\nseq2seq\nTensorflow\nNice To Have\nNamed Entity Recognition (NER)\nKubeflow\nAI/NLP\nGCP tooling\nWhat's In It for You\nCompetitive Salary: $120k-$175k\nHealth Insurance\nGenerous PTO\n401K Match\nPaid Vacation and Holidays\nOffice is located on 46th and Lex in NY\nSo, if you are a Data Scientist with experience, please apply today!\nEmail Your Resume In Word To\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nDylan.Boisclair@Optello.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : DB12-1642508 -- in the email subject line for your application to be considered.***\nDylan Boisclair - Recruiter - Optello\nApplicants must be authorized to work in the U.S.\nOptello is proud to be an Equal Opportunity Employer\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\nYour Right to Work\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.", "employment_type": "FULL_TIME", "date_posted": "2021-07-30T05:26:51.000Z"}, "company": {"name": "Optello", "link": "https://www.linkedin.com/company/optello-us"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}