{"location": {"country": "US", "locality": "Greater New Orleans Region", "region": "Greater New Orleans Region", "postal_code": "70112", "street_address": null, "latitude": 29.975271, "longitude": -90.19994}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer", "industry": "Information Technology and Services,Computer Software,Computer Networking", "description": "RESOLVIT\nBringing Solutions That Make Business Better\nJoin Resolvit as a\nSoftware Engineer\nand be part of a creative, forward-thinking team. Our success at deploying skilled, highly knowledgeable experts has landed us on the Inc. 5000 list of America’s fastest-growing companies four times – and we’re just getting started.\nAs the\nSoftware Engineer\n, you will work with the remote development and support teams to contribute to all aspects related to the enhancement and maintenance of our software. You will develop software, guide work, assist with planning of new projects, and troubleshoot any problems that occur. You will also report directly to the CTO. Additionally, you will:\nActively participate in the development, analysis, and testing of web applications and databases\nCollaborate with remote teams to identify and fix technical issues\nAnalyze users’ needs and work on features to satisfy them\nCoordinate support related tasks with the support team\nDevelop and maintain websites\nWhat You’ll Need to be Successful:\nAt least 2 years of experience as a software developer (front end and back end)\nAt least 2 years of experience with Azure SQL Server (preferred) or Microsoft SQL Server\nAt least 1 year of experience with tools like PHP, CSS, and JavaScript\nBachelor’s degree in a STEM field (preferably computer science related) or equivalent experience or training\nExperience working on a software development team doing modern web application development\nExperience working in an Azure development environment with C# and Git\nAbility to create APIs to integrate product features\nStrong communication, motivational, and interpersonal skills\nGreat Additional Skills:\nBanking and/or FinTech experience\nKnowledge of WordPress\nExperience working with Azure DevOps\nExperience in website administration\nExperience working with Twilio’s platform\nExperience developing mobile applications\nBenefits:\nAt Resolvit, you’ll be given the support you need to grow in your consulting career. In addition to opportunities for advancement, we offer:\nMedical, dental, and vision insurance\nLife insurance coverage\nLong-term and short-term disability coverage\n401(k) retirement plan with matching\nProfessional support from our Client & Employee Optimization Specialist\nWe currently have more than 100 open career opportunities across the country, so be sure to mention the appropriate Job Code with any correspondence!\nAbout Resolvit:\nResolvit is an international technology consulting firm with industry-leading customers in the financial services, high tech, manufacturing, retail, life sciences, and government sectors. Through its partnerships, Resolvit delivers highly impactful, innovative solutions across five core areas: Infrastructure Modernization, Application Development Services, Enterprise Data Management & Analytics, Knowledge & Content Management, and Strategic Staffing.", "employment_type": "FULL_TIME", "date_posted": "2021-10-05T17:38:33.000Z"}, "company": {"name": "Resolvit", "link": "https://www.linkedin.com/company/resolvit"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}