{"location": {"country": "US", "locality": "Eden Prairie", "region": "Eden Prairie", "postal_code": "55344", "street_address": null, "latitude": 44.854034, "longitude": -93.46017}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Site Reliability Engineer", "industry": "Construction,Marketing and Advertising,Financial Services", "description": "Brief Description\nThe Site Reliability Engineer will be responsible for the planning, management, and maintenance of all Cambria-owned sites and platforms that power our company. Our team works cross-functionally to ensure that services are available and perform optimally to continue to scale our manufacturing operations.\nEssential Duties And Responsibilities\nB\nuild, operate, and maintain scalable, highly-available, and resilient distributed systems\nParticipate in chaos engineering exercises to help increase the reliability of Cambria's systems\nParticipate in on-call rotation to ensure critical services are available\nAnalyze metrics to create actionable monitors or alerts to ensure critical services are available and performing well\nWork with product teams to ensure SLO targets are met or exceeded\nParticipate in root cause analysis after incidents to ensure they won’t happen again\nIdentify and implement improvements to Cambria’s CI/CD deployment pipeline to improve speed and efficiency of code deployments\nMaintain excellent documentation and diagrams of the complex systems supporting the Microservices environment\nRequirements\nBachelor’s degree of Computer Science, Electrical Engineering, or related technical degree or equivalent experience\nMotivated self-learner pushing technology solutions forward, who anticipates problems and challenges\nSolid understanding of Software Engineering and Computer Science principles with security mindfulness\nMastery in at least one programming language. Python, Powershell, Golang, or Bash preferred\n3-5 years of experience with building, operating and maintaining complex, highly available, and scalable systems\nSolid foundation in Linux administration and troubleshooting\nExperience working with Agile delivery methodologies such as Scrum and Kanban. Familiarity and experience with ALM toolsets (Cambria uses Jira) and collaboration software (such as Slack, G-Suite, and Confluence).\nExperience with some or all of the following software/tools, or close equivalents:\nHighly-available MySQL clusters\nElasticsearch clusters\nApache Kafka clusters\nHashicorp tools consul vault\nContainer technologies such Docker, LXC, or Podman\nContainer orchestrators such as Kubernetes or Hashicorp Nomad\nCI/CD tools like Jenkins, TravisCI, or CircleCI. Jenkins Pipelines preferred\nConfiguration management tools like Ansible, Saltstack, or Puppet\nLoad balancing technologies such as Nginx, Apache2, or Haproxy\nInfrastructure as Code tools such as Terraform or Cloudformation\nPublic cloud platforms such as AWS, Azure, or GCP\nApplication performance and Monitoring tools such as Datadog or Dynatrace\nMinimum Requirements\nEducation: Minimum 4-year technical degree or equivalent work experience\nExperience: 5 years working in a Site Reliability/Systems Engineering position\nAdditional Requirements\nTravel Requirements: This position may require travel to other Cambria locations\nPhysical Requirements: This position requires the ability to lift up to 50lbs, be able to work in prolonged standing and/or sitting positions\nCambria offers a competitive benefits package that encompasses your health and well-being, financial health, retirement planning and time-off.\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\nFor Additional Company Information, Please Visit Www.CambriaUSA.com\nWe are an equal opportunity employer.\nM/W/VET/DISABLED\nThe salary range associated with this job posting has not been provided by Cambria.", "employment_type": "FULL_TIME", "date_posted": "2021-08-03T07:47:36.000Z"}, "company": {"name": "Cambria", "link": "https://www.linkedin.com/company/cambria"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}