{"location": {"country": "US", "locality": "Atlanta", "region": "Atlanta", "postal_code": "30355", "street_address": null, "latitude": 33.748547, "longitude": -84.3915}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "DevOps Engineer", "industry": "Information Technology and Services", "description": "JOB DESCRIPTION\nRole : DevOps Engineer.\nKey responsibility:\nWork experience should include extensive knowledge of Continuous Deployment strategies\nA successful candidate will have excellent analytical and problem-solving skills, strong communication skills, and a motivation to achieve best-in-class results\nSolid understanding of best practices in support of Continuous Deployment including branching strategy, version management, artifact maintenance, configuration management\nFirm grasp of common deployment strategies including blue/green, zero-downtime deployment, traffic shaping, canary and rollback\nExperience designing and building automation solutions\n2+ years experience with some of the following toolsets:\nCI Server – Jenkins, TeamCity, Concourse CI\nArtifact Repositories – Artifactory, Nexus\nSource Control – Git (Github, Bitbucket, GitLab)\nBuild Tools – Team Foundation Server (TFS), MSBuild, Ant, Maven, Gradle\nCloud Computing Models\nContainerization – Docker, Kubernetes\nInfrastructure as Sevice – Ansible, Terraform\nExcellent scripting knowledge and ability to execute through Python, Bash/Shell, PowerShell, Go\nGood understanding of common principals related to computing, networks, firewall, security and authentication\nAbility to work and influence across functional teams with different mind sets, cultures, operating styles and decision-making frameworks\nOutstanding written and verbal communication skills\nFamiliarity with Microsoft® Word & Excel\nFinancial industry interest and experience is beneficial\nAbout Virtusa\nTeamwork, quality of life, professional and personal development: values that Virtusa is proud to embody. When you join us, you join a team of 21,000 people globally that cares about your growth — one that seeks to provide you with exciting projects, opportunities and work with state of the art technologies throughout your career with us.\nGreat minds, great potential: it all comes together at Virtusa. We value collaboration and the team environment of our company, and seek to provide great minds with a dynamic place to nurture new ideas and foster excellence.\nVirtusa was founded on principles of equal opportunity for all, and so does not discriminate on the basis of race, religion, color, sex, gender identity, sexual orientation, age, non-disqualifying physical or mental disability, national origin, veteran status or any other basis covered by appropriate law. All employment is decided on the basis of qualifications, merit, and business need.", "employment_type": "FULL_TIME", "date_posted": "2021-08-13T13:27:19.000Z"}, "company": {"name": "Virtusa", "link": "https://www.linkedin.com/company/virtusa"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}