{"location": {"country": "US", "locality": "United States", "region": "United States", "postal_code": "99999", "street_address": null, "latitude": 39.50355, "longitude": -99.0183}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Validation Test Engineer - Medical Device Software", "industry": "Biotechnology,Medical Devices,Computer Software", "description": "Lead the development and authoring of software Verification test plans, protocols, and reports for medical devices. Develop efficient and effective methods to qualify changes and improvements to products and processes in a manner that complies with medical device design standards.\nESSENTIAL DUTIES AND RESPONSIBILITIES\nDevelop and execute software/firmware verification protocols and scripts.\nParticipate in product definition and requirements analysis to assure requirements are testable.\nCoordinate medical device system verification and validation scripts and reports.\nReview and support engineering change requests, deviation notices, and risk management.\nUtilize issue tracking tools and other methods to ensure consistent traceability between requirements, the design, and test cases.\nWorking knowledge of FDA (21 CFR part 820), ISO 13485, 14971 & 62304\nWorking knowledge in SDLC, STLC, test methodologies, and defect management.\nQUALIFICATIONS\nAbility to comprehend software specifications and write corresponding test protocols\nHigh attention to detail and ability to lead V&V efforts to timely completion.\nExperience developing/configuring scripting and automation frameworks\nExcellent understanding of software design verification and validation for medical devices.\nExcellent written and verbal communication skills, including the ability to collect data, concisely organize information and author reports.\nStrong interpersonal skills, including the ability to work with and influence individuals of diverse backgrounds and technical ability.\nAble to perform well in a fast-paced, team environment.\nSuccessful 510K submissions, a plus\nWorking knowledge of IEC 62366 and/or 60601-1, a plus\nKnowledge of software programming and embedded systems, C++, a big plus.\nEDUCATION and/or EXPERIENCE\nMinimum of bachelor’s degree (B.S.)\nThree (3) years related experience in an ISO 13485, FDA regulated or equivalent environment.", "employment_type": "FULL_TIME", "date_posted": "2021-08-20T22:41:13.000Z"}, "company": {"name": "Integrated Computer Solutions, Inc. (ICS)", "link": "https://www.linkedin.com/company/integrated-computer-solutions-inc."}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}