{
    "job": {
        "title": "Tech Data Engineer - Automation & Data Prep",
        "industry": "Banking,Financial Services,Investment Banking",
        "description": "Job Reference #237234BRCityWeehawken, United States - New JerseyJob TypeFull TimeYour roleAre you passionate about technology? Do you have a curious nature, always interested in making improvements and how to innovate? We’re looking for someone with:strong development skills and experience with scripting languages and automation (Tableau Prep/Alteryx, Autosys, VBA, SQL)strong analytic and design skills to implement production worthy solutions based on a deep understanding of databases and related architecturethe ability to provide high quality automation solutions that address business needs within a complex business domaina strong focus on contributing backend ETL automation and data prep for various projects while collaborating alongside team members on other elements of the overall design (client requirements, data analysis, Tableau development)Your teamYou’ll be part of the WMA Technology Metrics & Reporting Team in Weehawken, NJ. You'll be an integral part of efforts related to creating dashboards that provide transparency across WMA Technology.Diversity helps us grow, together. That’s why we are committed to fostering and advancing diversity, equity, and inclusion. It strengthens our business and brings value to our clients.Your expertiseexperience using Tableau Prep Builder for data cleansing, joining, and other ETL processesideally 3 to 7 years of Tableau development and design related experienceexperience with structured query language (SQL), e.g. SQL/PSM or Transact-SQLknowledge of data related UI development and design of relational databasessolid design, coding, testing, and debugging skills, excellent analytical, problem solving, research, investigation and evaluation skillsexcellent written and verbal communication skillsworking knowledge of Splunk, SPL, and Autosys a plusability to work collaboratively within a team to identify end to end processes that best meet business needs and deliverablesproactive, a self-starter that actively engages with the team and clientcomfortable working in environments with fast-paced deliverysolution oriented, automated and production worthy resultsresponsible, someone that will drive deliverables to meet deadlinesa thought leader and team player that can influence direction accordinglyAbout UsExpert advice. Wealth management. Investment banking. Asset management. Retail banking in Switzerland. And all the support functions. That's what we do. And we do it for private and institutional clients as well as corporations around the world.We are about 60,000 employees in all major financial centers, in more than 50 countries. Do you want to be one of us?Join usWe're a truly global, collaborative and friendly group of people. Having a diverse, inclusive and respectful workplace is important to us. And we support your career development, internal mobility and work-life balance. If this sounds interesting, apply now.Disclaimer / Policy StatementsUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-08T03:01:37.000Z"
    },
    "company": {
        "name": "UBS",
        "link": "https://ch.linkedin.com/company/ubs"
    },
    "education": {
        "required_credential": ""
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Weehawken",
        "region": "NJ",
        "postal_code": "07086",
        "street_address": null,
        "latitude": 40.770782,
        "longitude": -74.01762
    }
}