{"location": {"country": "US", "locality": "Los Angeles Metropolitan Area", "region": "Los Angeles Metropolitan Area", "postal_code": "90021", "street_address": null, "latitude": 34.073666, "longitude": -118.23985}, "salary": {"currency": "USD", "min_value": 81300, "max_value": 152000, "unit": "YEAR"}, "job": {"title": "Software Engineer - New Grad", "industry": "Information Technology and Services,Computer Software,Internet", "description": "About Applied\nAutonomy is one of the leading technological advances of this century that will come to impact our lives. The work you’ll do at Applied will meaningfully accelerate the efforts of the top autonomy teams in the world. At Applied, you will have a unique perspective on the development of cutting edge technology while working with major players across the industry and the globe.\nAs the foremost enabler of autonomous vehicle development, Applied Intuition equips engineering and product teams with software that makes it faster, safer, and easier to bring autonomy to market. Applied’s suite of products, focused on simulation and analytics, delivers sophisticated infrastructure built for scale. Companies of all sizes use Applied to comprehensively test and rapidly accelerate their autonomous vehicle development. Headquartered in Silicon Valley with offices in Detroit, Tokyo, Munich, and Seoul, Applied is composed of software and automotive experts from the top companies in the world (such as Google, Amazon, Apple, Waymo, Tesla, Delphi, GM, and Bosch).\nAbout The Role\n(We are hiring for all levels of experience.)\nWe are looking for bright engineers interested in designing elegant solutions to difficult problems in the autonomy space. Our software engineers work across our suite of products, tackling a variety of full-stack, infrastructure, robotics, and graphics challenges. At Applied, we encourage engineers to take ownership over technical and product decisions, closely interact with users to collect feedback, and contribute to a thoughtful, dynamic team culture.\nAt Applied, You Will\nWork across our entire stack to develop new products, features, and tools for our customers' autonomy development workflows\nHave an unparalleled opportunity to work with domain experts across a variety of fields: infrastructure, robotics, and graphics engineers, as well as startup veterans\nCarve out your own area of expertise and influence product decisions\nCollaborate with other members in the autonomy ecosystem and learn about different approaches to solving core issues in autonomy\nWe Are Looking For Someone Who\nIs a self-starter and can quickly become comfortable with new technical tools\nDesigns efficient and effective solutions to a wide range of engineering challenges\nTakes initiative in a fast-paced environment\nNice To Have\nWorking knowledge of frontend, API layer, database ORM, containerization, or cluster orchestration frameworks (such as React, GraphQL, SQLAlchemy, Docker, or Kubernetes)\nExperience working with simulation tools, modeling physical problems, or using robotics middleware (such as ROS)", "employment_type": "FULL_TIME", "date_posted": "2021-06-20T17:12:24.000Z"}, "company": {"name": "Applied Intuition", "link": "https://www.linkedin.com/company/applied-intuition-inc"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}