{"location": {"country": "US", "locality": "Bridgeton", "region": "Bridgeton", "postal_code": "63044", "street_address": null, "latitude": 38.755707, "longitude": -90.4183}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Computer Science / Computer Engineer Co-op (Automotive Wheel Balancing)", "industry": "Information Technology and Services,Computer Software,Automotive", "description": "Hunter Engineering Company is a global leader in the development and manufacturing of computer based automotive service equipment. Hunter’s award-winning research and development team of engineers is responsible for hundreds of patented and exclusive features on our equipment.\nWe are in search of enthusiastic and self-motivated sophomores, juniors, or seniors with a major or minor in a field of study cohesive with Computer Science and/or Computer Engineering. Our goal is to provide an experience that will teach by example how to progress from academics-based software projects to real world successful product(s).\nJob Summary\nThis position is primarily responsible for the writing of new test software to automate data gathering and work with the QA Department and Project Engineers to maintain existing software.\nCS/CE C++ Co-Ops gain experience in:\nSoftware Quality Assurance\nExposure to Software Version Control and the debugging environment through Visual Studio\nWork with Hunter’s QA Department and Project Engineers to maintain existing software.\nLearn concepts of multiple models (varying feature sets) support and backwards compatibility.\nWrite new test software to automate data gathering\nNew Feature Development / Testing\nLearn how mechanical aspects influence software during the design process, working directly with Mechanical Engineers and ME Co-Ops.\nExecute test plans under the direction of a project engineer, format the results in a useable and effective manner, and analyze the results against stated objectives\nMinor analysis and engineering calculations\nEquipment Evaluation\nGain experience assisting with competitive analysis and equipment operation.\nCapstone Presentation / Exposure to Upper Leadership\nNear the end of the job, our C++/balancer Co-Op students are well equipped to prepare a compelling Capstone PowerPoint presentation\nCo-Ops can present their presentations live to all the other Co-Ops and upper management/leadership.\nResponsibilities\nThe individual will be involved in a variety of projects which may include:\nPrototype construction and evaluation\nTest program development and administration\nShop experience, hands-on work experience\nMinor analysis and engineering calculations\nAnalyzing data and using Microsoft Word and Excel to prepare reports\nDesign and Fabricate Test Fixtures\nWhat To Expect\nQualifications\nIt will be our intent and purpose to provide the individual with real world experience, which includes assisting in the progression of a product from concept stage to production. The work done by co-ops in this position is applied to actual Hunter products. The work is normally very individualized even if you are working in a larger group. We host many co-ops annually. Our goal is to provide an experience that will be an important, effective first step in the career of a future engineer.\nAlso visit our website for testimonials from previous co-ops\nhttps://www.hunter.com/about-us/careers/co-op/\nQualifications\nMinimum 3.0 GPA (must be on resume)\nMajo/Minor studies in Computer Scienceand/ or Computer Engineering\nExperience with C++, Linux and/or Microsoft VS a plus\nWorking knowledge of Microsoft Excel and PowerPoint\nExcellent communication skills.", "employment_type": "INTERN", "date_posted": "2021-08-27T05:24:58.000Z"}, "company": {"name": "Hunter Engineering Company", "link": "https://www.linkedin.com/company/hunter-engineering"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}