{"location": {"country": "US", "locality": "Costa Mesa", "region": "Costa Mesa", "postal_code": "92626", "street_address": null, "latitude": 33.663857, "longitude": -117.90476}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Embedded Software Engineer", "industry": "Electrical/Electronic Manufacturing,Information Technology and Services,Staffing and Recruiting", "description": "Overview\nCombine your love of SW Development and Audio/Video.\nQSC seeks an experience and self-motivated Software Engineer to work with an experienced team of software engineers and product management to develop cutting-edge digital audio products.\nQSC thrives where innovative technology and compelling audio-visual experiences intersect. For over 50 years, QSC has pioneered the technology and solutions that enable immersive cinema, live performance audio, themed entertainment, digital collaboration and meeting experiences for our customers and partners around the world. A globally recognized innovator in the design, engineering, and manufacture of category leading high-performance loudspeakers, digital mixers, power amplifiers, audio processors, digital cinema solutions, and the Q-SYS™ software-based audio, video and control Ecosystem.\nBy joining the QSC team, you will be in a challenging, collaborative, fun, and innovative environment. We encourage employees to take ownership, to color outside the lines, and to imagine possibilities. Our culture is casual but dynamic, with cross-functional teams collaborating on creating memorable audio-visual experiences that deliver joy to people, wherever they are. At QSC, fun and hard work go hand in hand. Join us and make a difference in the way people experience movies, meetings, presentations, live performances, and much more.\nThis position is located in Costa Mesa, California.\nResponsibilities\nWork collaboratively with other members of a tight-knit, small project team to develop world-class professional audio/video products for the live sound, cinema and systems markets\nDevelop solutions for a networked system of embedded devices\nApply good software design and development practices in daily activities\nWork with Software Quality Assurance to develop appropriate test strategies\nQualifications\nBS or MS in Electrical Engineering, Computer Science, or related field from an accredited university\nMinimum 3 years of work experience as an embedded software engineer working in large code bases\nStrong coding skills in C/C++\nExperience with Linux development including Linux driver development\nExperience with C# and VisualStudio\nExperience with SPI, I2C, TDM, I2S, and parallel interfaces\nOutstanding problem solving skills\nExcellent written and verbal communication skills\nExperience in any of the following areas is a plus:\nAnalog Devices DSPs including Sigma and Sharc processors\nAudio DSP algorithms including IIR and FIR filters, as well as, dynamics processing\nAudio power amplifiers\nCircuits, analog filters, and power electronics\nEmbedded Linux, FreeRTOS, or other real time operating systems on ARM processors\nProfessional audio/video products and systems", "employment_type": "FULL_TIME", "date_posted": "2021-08-17T07:23:20.000Z"}, "company": {"name": "QSC", "link": "https://www.linkedin.com/company/qsc-audio-products-llc"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}