{"location": {"country": "US", "locality": "Los Angeles", "region": "Los Angeles", "postal_code": "90101", "street_address": null, "latitude": 34.05224, "longitude": -118.24335}, "salary": {"currency": "USD", "min_value": 81300, "max_value": 171000, "unit": "YEAR"}, "job": {"title": "Software Engineer - Backend Services", "industry": "Information Technology and Services,Computer Software,Internet", "description": "What You’ll Do\nAs a Software Engineer in the Firmware department, you will be contributing to the development of Leia Inc’s core technology consisting of display systems, camera systems, and APIs for developers.\nYour responsibilities will include (but are not limited to):\nContributions to all phases of software engineering lifecycle.\nRequirements gathering, project planning, system testing, system prototyping, and troubleshooting of existing system\nParticipate in scrum/agile activities (eg. stand ups, sprint planning)\nDocuments requirements, system architecture, test plan and test cases.\nParticipate in the research, recommendation and architecture discussion.\nProjects you might work on:\n4V Camera App using Camera2 API\nToF camera Android integration\nSensor Fusion\nHead Tracking\nThis is a position based at Leia Inc’s headquarters in Menlo Park.\nWhat You’ll Have\nExperience with Android application development\nExperience with camera2 API and third party API\nExperience with OpenGL graphic programming\nStrong communication and team player\nMinimum BS degree in EE, CE, CS or equivalent experience\nNice to Haves\nC++ development\nExperienced with multi-core/multi-CPU environments\nBuilding API interfaces for external app integration\nLight up Life\nAt Leia we are working at the forefront of display technology — making screens come to life in richer, deeper, and more beautiful ways. We apply our proprietary nanotechnology to give any display the ability to produce Lightfield, immersive “holographic” content — no glasses, no tracking, no fuss.\nCome join a team that’s ready to redefine the digital experiences of tomorrow!\nWhat We Offer\nIn order to assemble top talent to help realize this mission Leia offers our employees:\nCompetitive Compensation Package\nMedical, Dental, and Vision Plan\nRetirement Savings Plan 401(k)\nCatered lunch and dinner daily (Dependent on Location)\nStocked kitchen with healthy (and unhealthy) snacks and beverages\nOnsite workout facility (Dependent on Location)\nLeia Inc. is an Equal Opportunity Employer. Candidates are evaluated without regard to age, race, color, religion, sex, disability, national origin, sexual orientation, veteran status, or any other characteristic protected by federal or state law.", "employment_type": "FULL_TIME", "date_posted": "2021-07-30T05:20:52.000Z"}, "company": {"name": "Leia Inc.", "link": "https://www.linkedin.com/company/leia-inc-"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}