{"location": {"country": "US", "locality": "Champaign", "region": "Champaign", "postal_code": "61824", "street_address": null, "latitude": 40.11633, "longitude": -88.24352}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer-Graduate", "industry": "Information Technology and Services,Computer Software,Telecommunications", "description": "Job ID:\n109869\nRequired Travel\n: Minimal\nManagerial - No\nLocation:\n: USA- Atlanta Georgia (Customer Site)\nWho are we?\nIf you’re a smartphone user then you are part of an ever more connected and digital world. At Amdocs, we are leading the digital revolution into the future. From virtualized telecommunications networks, Big Data and Internet of Things to mobile financial services, billing and operational support systems, we are continually evolving our business to help you become more connected. We make sure that when you watch a video on YouTube, message friends on Snapchat or send your images on Instagram, you get great service anytime, anywhere, and on any device. We are at the heart of the telecommunications industry working with giants such as AT&T, Vodafone, Telstra and Telefonica, helping them create an amazing new world for you where technology is being used in amazing new ways every single day.\nIn one sentence\nResponsible for design, development, modification, debug and/or maintenance of software systems\nWhat will your job look like?\nYou will design, develop, modify, debug and/or maintain software code according to functional, non-functional and technical design specifications.\nYou will follow Amdocs software engineering standards, applicable software development methodology and release processes, to ensure code is maintainable, scalable, and supportable, and demo the software products to stakeholders.\nYou will investigate issues by reviewing/debugging code, provide fixes and workarounds, and review changes for operability to maintain existing software solutions.\nYou will work within a team, collaborate and add value through participation in peer code reviews, provide comments and suggestions, and work with cross functional teams to achieve goals.\nYou will assume technical accountability for your specific work products within an application and provide technical support during solution design for new requirements.\nYou will be encouraged to actively look for innovation, continuous improvement, and efficiency in all assigned tasks.\nAll you need is...\nBachelor's degree in Science/IT/Computer Science or equivalent\n3+ years Java experience (server side) on Linux/Unix/Windows\nDemonstrable experience with the Spring framework components - Spring Boot, MVC, Integration, Security, etc.\nStrong understanding of RESTful APIs and open systems\nWhy You Will Love This Job\nYou will be challenged to design and develop new software applications.\nYou will have the opportunity to work in a growing organization, with ever growing opportunities for personal growth.\nAmdocs is an equal opportunity employer. We welcome applicants from all backgrounds and are committed to fostering a diverse and inclusive workforce", "employment_type": "FULL_TIME", "date_posted": "2021-08-13T22:09:01.000Z"}, "company": {"name": "Amdocs", "link": "https://www.linkedin.com/company/amdocs"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}