{"location": {"country": "US", "locality": "Medina", "region": "Medina", "postal_code": "55340", "street_address": null, "latitude": 45.01901, "longitude": -93.58608}, "salary": {"currency": "USD", "min_value": 65700, "max_value": 129000, "unit": "YEAR"}, "job": {"title": "Software Engineer - Quality Assurance / Test", "industry": "Electrical/Electronic Manufacturing,Information Technology and Services,Computer Software", "description": "Description\nOpen Systems International, Inc. (OSI) www.osii.com is a fast-paced, growing, high technology company, headquartered in Medina, Minnesota. As a world leader in the Operations Technology (OT) field, OSI develops and supplies state-of-the-art energy management, optimization and control software solutions to energy utility companies worldwide.\nIn This Position You Will Have The Following Responsibilities\nIn this position you will focus on system verification of software produced by our Development group using manual and automated testing. All of this is done using the latest technologies in a fast-paced, collaborative environment at our forward-looking company. Specific on-the-job training will be provided.\nUse manual and automated test procedures to identify high-impact problems.\nAssist in the creation and execution of resolution plans.\nAuthor, execute and maintain test procedures, automated test scripts and code.\nDesign, develop, implement and improve various test methodologies, plans and test automation.\nReview defect descriptions, requirements, and designs to incorporate into test plans.\nMaintain customer test environments to replicate real-world test scenarios.\nRequirements\nMinimum\nBachelor's degree in Computer Science, Software Engineering or related technical field.\nProficient with Linux, Windows, UNIX environments.\nSystem Administration experience (small system or personal networks is okay).\nUnderstanding of manual and automated testing best practices.\nHigh level scripting skills (Python, Perl, Shell scripting).\nUnderstanding of Configuration Management.\nProficient in a source control system (CVS, Subversion, Git, etc.).\nInnate desires to automate, monitor and continually improve everything in sight.\nPreferred\nMaster's degree in Computer Science, Software Engineering or related technical field.\nExperience with different database technologies (SQL, Cassandra, MongoDB).\nKnowledge of tool building and automation.\nCapability to maintain Windows/Linux/UNIX Servers.\nExperience in server virtualization, especially VMWare and VSphere.\nGeneral networking skills (Layer 2 & 3 switches, TCP/IP, SNMP, etc.).\nBenefits\nOSI offers a comprehensive benefit package including health, dental, life and disability insurance, 401(k) matching, bonuses, profit sharing and a generous amount of paid time off and paid holidays. Additional perks include casual dress code, flexible work hours, free beverages, employee events, onsite fitness center, exciting travel opportunities, employee referral bonus programs, and monthly birthday and anniversary celebrations. Check out our\nLife at OSI\nFacebook page to see more.\nAs an employee of OSI you will have access to cutting edge technologies in a fun, professional, positive and dynamic work environment. We have excellent opportunities for growth and development.\nDiscover your future. Discover OSI.", "employment_type": "FULL_TIME", "date_posted": "2021-06-23T12:52:13.000Z"}, "company": {"name": "Open Systems International", "link": "https://www.linkedin.com/company/open-systems-international"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}