{"location": {"country": "US", "locality": "Austin", "region": "Austin", "postal_code": "78746", "street_address": null, "latitude": 30.264978, "longitude": -97.7466}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Principal Software Engineer", "industry": "Internet", "description": "--this position is fully remote and you can work anywhere in the US.--\nWe are a fast-growing and unique company looking to bring on a 100% Remote Principal Software Engineer to join our fast-growing team. We are an established, nation-wide startup company. We are a in the internet/e-commerce space and need Principal Engineers to join our dynamic team. We are wanting hands-on developers/Polyglot type candidates that are looking to grow within our company. If you are a 100% Remote Senior Software Developer with experience, please read on!\nTop Reasons to Work with Us\nGenerous Compensation Package/Equity, Medical Benefits and Annual Salary Evaluation!\nJob stability - We promote from within our organization!\nGet to work with a great team of individuals in a dynamic company culture!\nWhat's In It for You\nWe offer a comprehensive compensation plan including but not limited to:\nA highly competitive salary\nBonus Package\nEquity\nUnlimited Vacation/PTO\nFull benefits (Dental, Medical, Vision)\n401k with company match\nWhat You Need for this Position\nMust Have\n8+ Years engineering experience with a proven track record as an engineer building scalable web sites\n5+ years of experience with the following languages: Agnostic\nExperience with AWS, Azure, GCP\nIn-depth and hands on knowledge of data structures, algorithms and modern web and/or cloud technologies\nExperience leading technical discussions including evaluation and design of technical solutions\nBachelor degree in Computer Science (or related field)\nPluses\nStart-up environments or early stage companies\nWhat You Will Be Doing\nLead cross functional projects across multiple teams impacting the success of the larger organization\nLead technical discussions, design/architect and implement solutions to scale our company\nSupport standard development practices, syntax, design patterns, and Test driven development\nEvangelize impactful improvements in our technologies\nCan trace bugs across the entire software stack, including into the OS, libraries, virtual machine and compiler if necessary\nImplement and Monitor analytics to ensure the correctness of the business process\nSo, if you are a 100% Remote Senior Software Developer with experience, please apply today!\nEmail Your Resume In Word To\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\nMiranda.Orr@CyberCoders.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : MO5-1630343 -- in the email subject line for your application to be considered.***\nMiranda Orr - Lead Recruiter - CyberCoders\nApplicants must be authorized to work in the U.S.\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\nYour Right to Work\n- In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\nCyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.", "employment_type": "FULL_TIME", "date_posted": "2021-08-25T17:32:44.000Z"}, "company": {"name": "CyberCoders", "link": "https://www.linkedin.com/company/cybercoders"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 96, "seniority_level": "Senior"}}