{"location": {"country": "US", "locality": "Lake Bluff", "region": "Lake Bluff", "postal_code": "60044", "street_address": null, "latitude": 42.279682, "longitude": -87.85427}, "salary": {"currency": "USD", "min_value": 52100, "max_value": 113900, "unit": "YEAR"}, "job": {"title": "Software Test Engineer", "industry": "Hospital &amp; Health Care", "description": "Abbott is a global healthcare leader that helps people live more fully at all stages of life. Our portfolio of life-changing technologies spans the spectrum of healthcare, with leading businesses and products in diagnostics, medical devices, nutritionals, and branded generic medicines. Our 109,000 colleagues serve people in more than 160 countries.\nAbout Abbott Diagnostics\nThe key to successful treatment and full recovery is often fast, accurate diagnosis. Abbott’s life-changing tests and diagnostic tools provide insights that enable smarter, faster decisions and transform the way the world is managing health.\nOur pioneering technology spans the world of healthcare operations — with medical diagnostic instruments, tests, and informatics solutions for hospitals, reference labs, blood centers, emergency departments, physician offices and clinics.\nOur location in\nAbbott Park (Lake Bluff), IL\ncurrently has an opportunity for a\nSoftware Test Engineer. (This position can also be based at either of these Abbott’s office location: Irving, TX or Abbott Park/Lake Bluff, IL.)\nWhat You’ll Do\nPrimary function is to test software for a blood screening system processing Immunoassays. Participates in a team-oriented environment to develop requirements and design for user interface, business rules, data management, or embedded system control applications, in addition to ensuring requirements and design are tested.\nResponsibilities\nResponsibilities include activities throughout the entire software development life cycle.\nPrimary areas of responsibility include moderate operation and repairs of system, software integration and testing.\nUnderstand FDA regulations, quality documents, and apply to software development.\nReview Software Requirements and provide input to ensure they are testable.\nDevelop test plans, strategies, and use cases for features, requirements, or Problem Reports (PRS) based on practices and procedures.\nDevelop informal and formal manual and automated protocols and acceptance criteria for features, requirements, or PRS according to practices and procedures.\nRun informal and formal protocols for software features, requirements, or PRS according to practices and procedures.\nAssess build readiness based on informal data gathering.\nSoftware Design Verification Testing.\nPerform test case and test case run analysis to determine adequacy of test cases, including coverage, boundary, and regression analysis\nProvide support for fault isolation, troubleshooting, and root cause analysis activities during system integration and testing for systems in development and on-market.\nAble to apply the latest software design and development tools and techniques as required.\nConfiguration Management.\nThis is an individual contributor position.\nActivities will be under the guidance of a software testing supervisor or manager.\nActivities will be focused on developing broad system knowledge and expertise in more than one functional area.\nAccountable for meeting deliverable commitments including schedule and quality requirements.\nMust have skills to plan and schedule own work activities, coordinate activities with other software test engineers.\nRequired\nEDUCATION AND EXPERIENCE YOU’LL BRING\nB.S. in Computer Science or similar engineering discipline including Software Engineering or Biomedical Engineering is required.\nIn lieu of college education/degree, on the job experience in Software Testing or Medical Device Testing or Life Sciences of > 6-10 years is acceptable.\n3-5 years of experience covering the entire software lifecycle (requirements definition through verification) in a team environment.\n3-5 years of experience in a laboratory environment.\nRequires experience with Microsoft Windows applications.\nPreferred\nExperience with medical device automated software testing and simulator tools highly preferred.\nMed Tech / Medical Technician work experience which includes testing software for medical devices, will be considered.\nWhat We Offer\nAt Abbott, you can have a good job that can grow into a great career. We offer:\nTraining and career development, with onboarding programs for new employees and tuition assistance\nFinancial security through competitive compensation, incentives and retirement plans\nHealth care and well-being programs including medical, dental, vision, wellness and occupational health programs\nPaid time off\n401(k) retirement savings with a generous company match\nPension Plan\nThe stability of a company with a record of strong financial performance and history of being actively involved in local communities.\nLearn more about our benefits that add real value to your life to help you live fully:\nwww.abbottbenefits.com\nFollow your career aspirations to Abbott for diverse opportunities with a company that provides the growth and strength to build your future. Abbott is an Equal Opportunity Employer, committed to employee diversity.\nConnect with us at www.abbott.com, on Facebook at www.facebook.com/Abbott and on Twitter @AbbottNews and @AbbottGlobal.", "employment_type": "FULL_TIME", "date_posted": "2021-07-12T00:00:00.000Z"}, "company": {"name": "Abbott", "link": "https://www.linkedin.com/company/abbott-"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 36, "seniority_level": "Mid-Level"}}