{
    "job": {
        "title": "Associate Data Engineer",
        "industry": "Information Technology and Services",
        "description": "Job Description&amp;nbsp;As an Associate Data Engineer,&amp;nbsp;you will be successful if you excel at designing and building reporting and analytic solutions from complex and dynamic benefits administration data. You will support other Technology and Product Team members, along with team members from the Customer Success departments, to analyze patterns, visualize data in effective ways, and support client data requests. You have a natural curiosity to hypothesize and have the desire and ability to be a go-getter and try to look for the answers in data in different ways. You are not satisfied understanding the issues, instead preferring to take action, communicate your recommendations effectively and drive change using data. Working in a fast-paced environment, managing through uncertainty, and networking across Vimly teams to weave the right data picture are challenges that energize you. If you are drawn to the opportunity to re-imagine benefits administration and deliver innovation come join us.&amp;nbsp;Job Responsibilities:  - Enable and support other Vimly team members by developing powerful and insightful reporting that will help guide the business   \n  - Integrate qualitative analysis of data with the quantitative method of report-building   \n  - Willing and able to use low-code solutions for developing features.   \n  - Participates in operational tasks bringing a DevOps mindset.   \n  - Able to fully complete tasks that are generally a smaller feature, or piece of the system.   \n  - Self-starter and able to work under the guidance of more senior team members.   \n  - Work closely with other members of the Vimly team to create ad-hoc reports to support timely business decisions, service evaluation, and any project work   \n  - Ability to communicate complex quantitative analysis in a clear, precise, and actionable   \n  - Excel at making complex concepts simple and easy to understand by those around you   \n  - Participate in stakeholder meetings and present data insights to users/clients/executives in a succinct and effective way   \n  - Demonstrate an understanding of and commitment to Vimly’s core values, continuous learning, innovation, adaptability, and resilience with all members of Vimly's staff and clients   \n  - Acquire&amp;nbsp;data from primary or secondary data sources and create meaningful understanding for internal and external customers   \n  - Extract, Transform and Load (ETL) customer data   \n  - Highly organized   \n  - Team player with strong interpersonal skills and the ability to build effective working relationships throughout all levels of the organization   \n  - Excellent verbal and written communication skills   \n  - Ability to be creative and innovative in a fast-paced environment with a lot of ambiguity and constant change   \n  - Ability to champion quality throughout the organization   \n&amp;nbsp;Minimum Qualifications:  - &amp;nbsp;1+ year of experience with data stores such as: MySQL, Postgresql, or similar   \n  - Bachelor’s Degree in Computer Science or equivalent work experience preferred   \n  - 1+ year software development experience programming with at least one of the following languages: .Net or Java   \n  - &amp;nbsp;1+ year of experience with data stores such as: MySQL, Postgresql, or similar   \n  - &amp;nbsp;Understanding of data structures, algorithms, and object-oriented design   \n  - &amp;nbsp;Good written and verbal communication skills   \n  - Mastery of MS Excel, including the ability to write macros, v-lookups, and pivot tables   \n  - Knowledge of statistical analysis methods   \n  - Experience working in a lean entrepreneurial environment where continuous innovation is desired, and ambiguity is the norm.   \n   Nice to Have:  - Experience with TFS or bitbucket and JIRA   \n  - Experience in Data Mining (i.e., SQL, ETL, complex data warehouses)   \n  - Experience developing software for cloud platforms such as AWS, Azure, or Google   \n  - Support the building of scalable, resilient, performant applications, and APIs.   \n  - Ability to work with and lead teams of stakeholders with differing backgrounds and job functions   \n   What Will Help You Excel:  - You believe in Vimly's core values and strategic goals   \n  - Thirst for knowledge – you are curious, and you enjoy learning new things.   \n  - Critical thinker – you ask “why?” and are unafraid to question or challenge the answers you hear.   \n  - Receptive to change – is flexible. Seeks and adopts improved approaches and processes.   \n  - Initiates action – is results-oriented, takes responsibility for actions and outcomes. Meets commitments and strives for high performance and high-quality delivery.   \n  - Manages the workload - makes timely decisions, prioritizes effectively, solves problems, monitors results and takes remedial action where necessary. Ability to learn new systems and/or processes, capacity to stay organized while managing competing priorities.   \n  - Technically proficient – knows the role and has a solid familiarity with tasks and responsibilities.   \n  - Takes responsibility for own learning - knows personal strengths and recognizes development needs. Is open to feedback and seeks to learn.   \n  - Communicates ideas and listens to views of colleagues and takes in diverse perspectives.   \n  - Works collaboratively – shares information fosters teamwork and contributes to a positive work environment where people want to come to work.&amp;nbsp;   \n  - Display ethical character and competence - acts with integrity and intent, is accountable for own actions, aligns with Vimly’s core values and strategic goals. Act as a good citizen of Vimly.&amp;nbsp;   \n  - Build strong internal relationships - You are emotionally intelligent and know your audience.   \n  - Ability to work effectively in a fast-paced, high-energy, team-oriented environment.&amp;nbsp;&amp;nbsp;   \n   This position may be performed remotely anywhere within the United States except the State of Colorado",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-12T19:31:35.000Z"
    },
    "company": {
        "name": "Vimly Benefit Solutions",
        "link": "https://www.linkedin.com/company/vimly"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Senior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Mukilteo",
        "region": "WA",
        "postal_code": "98275",
        "street_address": null,
        "latitude": 47.905083,
        "longitude": -122.29306
    }
}