{
    "job": {
        "title": "Developer I - Software Engineering",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Role ProficiencyJob DescriptionActs under continuous guidance and support develop test and document applicationsOutcomes Interpret the applications features and component design developing the same in accordance with user stories/ specifications per directions provided Code debug test. document and communicate product/component/feature development stages.  Identify and report opportunities to improve efficiency and quality (e.g. repeatable processes that can be automated) Adhere to project timelines and communicate effectively over e-mails and conversations Conduct unit testing to validate unit level functionalities Practice FAST goals; seek and accept feedback Learn technology business domain system domain individually and as recommended by the project/accountMeasures Of Outcomes Adherence to engineering process and standards (coding standards) Adherence to schedule / timelines Adherence to SLAs where applicable Number of defects post delivery Number of non-compliance issues Reduction of reoccurrence of known defects Quickly turnaround production bugs Meet the Defined productivity standards for project Completion of all mandatory training requirementsCodeOutputs Expected:Learn coding standards and practice them in development. Develop code with guidance for the aboveConfigureFollow configuration processTestCreate and conduct unit testingDocument test resultsDomain RelevanceDevelop features and components with good understanding of the business problem being addressed for the clientManage DefectsRaise fix retest defectsDocumentCreate documentation for one's own workStatus ReportingReport status of tasks assignedComply with project related reporting standards/processManage KnowledgeConsume project related documents share point libraries and client universities ReleaseAdhere to release management processRequirementUnderstand the requirements/user storiesDesignUnderstand the design/LLD and link it to requirements/user storiesSkill Examples Explain and communicate the design / development to the mentors/leads  Perform and evaluate test results against product specifications Develop user interfaces business software components and embedded software components Manage and guarantee high levels of cohesion and quality Use data models Perform and evaluate tests in the customer or target environment Team player Good written and verbal communication abilities Proactively ask for and offer help Knowledge ExamplesAdditional Comments:None",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-12T05:24:13.000Z"
    },
    "company": {
        "name": "UST",
        "link": "https://www.linkedin.com/company/ustglobal"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}