{
    "job": {
        "title": "HR Intern Earth City, MO - Data Analysis",
        "industry": "Logistics and Supply Chain,Public Relations and Communications,International Trade and Development",
        "description": "If you’re looking for a valuable opportunity with the global leader of logistics, UPS has an internship for you! UPS is seeking a Human Resources (HR) Intern to support the daily operations of the HR Department with attention to Employee Services and Workforce Planning.Responsibilities And DutiesMaintains accurate and updated employee files in accordance with company policies and government regulationsAssists in the development and improvement of company policies and proceduresComposes competent employee communications regarding policy and procedural changesReviews resumes in online database to recruit qualified individuals for specific open positionsMaintains employment resumes, applications and applicant flow logs in line with company proceduresAssists in recruitment activities and special projects, as neededFiles documents and answers phonesKnowledge And SkillsExhibits exceptional verbal, written and interactive communication skillsDemonstrates effective research tactics; good organizational skillsAbility to maintain high standards of confidentialityAbility to convey a positive and professional image to internal and external customersKnowledge of Microsoft Word, Excel, PowerPoint and AccessJunior or senior currently enrolled in a four-year college or university or in a master’s program with a preferred course of study in Human Resources ManagementKnowledge of U.S. Labor Laws: FLSA, OSHA, FMLA and IRCA – PreferredUPS is an equal opportunity employer. UPS does not discriminate on the basis of race/color/religion/sex/national origin/veteran/disability/age/sexual orientation/gender identity or any other characteristic protected by law",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-12T04:09:41.000Z"
    },
    "company": {
        "name": "UPS",
        "link": "https://www.linkedin.com/company/ups"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Earth City",
        "region": "MO",
        "postal_code": "63045",
        "street_address": null,
        "latitude": 38.768604,
        "longitude": -90.46715
    }
}