{"location": {"country": "US", "locality": "Pittsburgh", "region": "Pittsburgh", "postal_code": "15235", "street_address": null, "latitude": 40.44217, "longitude": -79.99496}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Machine Learning Engineer, New Graduate", "industry": "Marketing and Advertising,Computer Software,Internet", "description": "Our mission at Duolingo is to develop the best education in the world and make it universally available. But we’ve got more left to do — and that's where you come in!\nDuolingo is the most popular language-learning application in the world, with over 500 million users and over half a billion exercises completed daily. Beyond our core learning product, we have also entered into literacy with Duolingo ABC and English proficiency testing with the Duolingo English Test .\nWe are passionate about educating our users, making fact-based decisions, and finding innovative solutions to complex problems. We offer meaningful work, limitless learning opportunities, and collaboration with world-class minds. Come brighten your life and over half a billion more!\nAs an ML Engineer, you will apply your background in machine learning to develop state-of-the-art product features using classification, regression, and other techniques for applications in personalization, natural language processing, speech technologies, anomaly detection, forecasting, and so on. In many cases, you’ll have to invent new technologies to tackle unique Duolingo data! You will be part of a fun and multi-functional team building intelligent software used by millions of people, around the world, every day.\nYou Will...\nApply AI/ML methods to massive data sets\nPrototype new models, evaluate with offline experiments, and then productionize solutions at scale to millions of daily users\nWork with a multi-functional team of award-winning designers, researchers, engineers, and others to build new product features\nA few example projects include:\nThe Duolingo English Test ( TACL paper )\nNovel bandit algorithm for mobile notifications ( KDD paper )\nShared task on translation & paraphrasing ( ACL paper )\nNovel model of vocabulary forgetting ( ACL paper )\nYou Have...\nPhD or MS in computer science or related field, graduating in 2021-22.\nExperience implementing ML systems in Python, Java, Scala, or C/C++ (i.e., not just R or MATLAB)\nExcellent presentation and communication skills\nStrong debugging and critical thinking skills\nAbility to relocate to Pittsburgh, PA\nExceptional Candidates Will Have...\n2+ years industry experience as a software engineer (e.g., commercial products or government/industry research projects)\nA portfolio of relevant publications or open-source projects\nA desire to keep up with the field by attending or publishing at relevant conferences (ICML, NeurIPS, ACL, EMNLP, KDD, AAAI, ICLR, CVPR, etc.)\nWhy You'll Love Working Here...\nLanguage learning opportunities\nCatered in-house lunches, plus breakfast and dinner options\nCompany-wide Hackathon\nPTO and company holidays\nFrequent company-wide dinners, celebrations, social clubs, and more", "employment_type": "FULL_TIME", "date_posted": "2021-08-07T00:11:40.000Z"}, "company": {"name": "Duolingo", "link": "https://www.linkedin.com/company/duolingo"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 24, "seniority_level": "Mid-Level"}}