{"location": {"country": "US", "locality": "San Francisco Bay Area", "region": "San Francisco Bay Area", "postal_code": "94112", "street_address": null, "latitude": 37.39271, "longitude": -122.042}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Scientist", "industry": "", "description": "We’d love to hear from you if you are looking for a tech company with the following:\nHuge market\n($800 billion market size), we are building the first AI-powered super app to help people own a car;\nOpen,\ntransparent\n, merit-based culture;\nHyper growth -\n10X\nrevenue growth in 2020;\nBest user experience:\n#1 ranked app\nin the insurance comparison category;\nStrong leadership: from Amazon, Microsoft, Facebook, Nvidia, Alibaba, etc. and rockstar colleagues;\nA series C with\n$130M+ total financing\n, backed by top VCs such as Y-Combinator, Goodwater, SV Angel, Funders Club, and Bow Capital, etc.\nAbout jerry.ai:\nJerry is the first Super App for car owners to help them save money on all their car expenses (insurance, loans, repairs, etc). Having built the #1 ranked app and the fastest growing app in the insurance comparison category, we are tackling other areas of car ownership and looking for engineering talents to join us in expanding our product offerings. Headquartered in Silicon Valley, CA, we have offices in the U.S., China, and Canada.\nA few examples of the exciting projects that we are working on:\nCreate a smart prediction engine for customer’s insurance coverage needs\nBuild predictive models on customer purchase behavior based on a large data set\nUse telematics tracking to build customer driving risk profile\nResponsibilities:\nAnalyze large amounts of data to discover trends and patterns, solve a wide array of challenging problems using different analytical and statistical approaches.\nApply technical expertise with quantitative analysis, experimentation, data mining, and the presentation of data to develop strategies for our products.\nIdentify and measure success of product efforts through goal setting, forecasting, and monitoring of key product metrics to understand trends.\nPartner with relevant teams (e.g. product, engineering, and marketing) to build better models, solve problems and identify trends and opportunities from both a market and user perspective.\nSQL and MapReduce job tuning to improve data processing performance.\nRequirements:\nBachelors/Masters Degree with 4+ years (or PhD with 2+ years) of experience working within an analytical role.\nStrong SQL skills. Able to write algorithms needed for modeling and prediction that deals with advanced data structures.\nExperience solving analytical problems using quantitative approaches.\nFollow Data Science literature and advancements. The most successful candidates possess the ability to apply cutting edge advancements in data science methodologies to relevant business problems.", "employment_type": "FULL_TIME", "date_posted": "2021-10-05T17:24:17.000Z"}, "company": {"name": "Jerry", "link": "https://www.linkedin.com/company/jerryinc"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 48, "seniority_level": "Mid-Level"}}