{
    "job": {
        "title": "Research Scientist ",
        "industry": "Pharmaceuticals,Biotechnology",
        "description": "This role is with fortune 500 client:Title: Research Scientist Duration: 12 monthsJob id: 41895-1Location: SUMMIT, NJ  Job Description:The candidate will work with our translational development team and independently contribute to the development and execution of laboratory experiments to understand disease biology, drug resistance, mechanism of action of drugs and drug combinations. This will include working with lymphoma cell lines. The candidate should have enthusiasm for helping support laboratory programs, have knowledge of immunology, cell biology and signal transduction pathways and technical expertise in molecular and cellular based assays documented by relevant publications and work experience. They should also possess a strong understanding of the science behind ongoing experiments: the rationale, purpose and appropriate analytical methods to aid experimental design, troubleshooting and result interpretation. Requirements• PhD in Cellular or Molecular Biology, Cancer biology, Biochemistry, Genetics, or related fields with a minimum 2-3 years of post-Ph.D. experience.• Extensive knowledge about cancer biology, signal transduction and cancer epigenetics. Prior research with blood cancer field is a plus.• Expertise in general skills of molecular cell biology, such as Molecular Cloning, Primer design, RNA isolation, RT-PCR, Western Blotting, and basic cellular assays (e.g. proliferation/apoptosis).• Proficient with techniques used for epigenetic/transcriptional profiling including ChIP-seq, ATAC-seq, bulk RNA-seq and library preparation is a plus.• Experience with various genetic manipulation approaches including shRNA, RNAi, ectopic expression, and CRISPR based techniques is a plus.• Experience with flow cytometry is a plus.• Experience with PowerPoint, FlowJo and GraphPad Prism software.• Experience with C-bioportal and UCSC genome browser interfaces is a plus.• Communication and writing skills necessary to effectively convey data and interpretations with internal groups and at external meetings.• Problem solving skills to resolve technical issues.• Ability to manage time efficiently to meet project team deadlines and exhibit flexibility and adaptability to changing projects, work assignments and priorities. Responsibilities:The candidate will provide laboratory support by means of data generation and analysis for clinical trial biomarker strategies, publications and internal study reports. Responsibilities will include: • Characterize and validate therapeutic targets identified from cancer genome project.• Generate stable cancer cell lines via lentiviral transduction.• Performing molecular and cell biological techniques including, flow cytometry, RNA isolation, qRT-PCR, Western blot, proliferation, cell cycle, apoptosis assays.• Performing epigenetic techniques including ChIP-qPCR, ChIP-seq and library preparation.• Performing in vitro testing of compounds to evaluate mechanisms of drug response and resistance. Developing rational drug combination strategies.• Detail-oriented. Keeping good experimental records. Being able to write detailed protocols.• Participating in translational team meetings by presenting data and providing interpretation of experimental results.• Helping to cultivate a positive and productive working relationship with colleagues.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-10-05T17:31:50.000Z"
    },
    "company": {
        "name": "Net2Source Inc.",
        "link": "https://www.linkedin.com/company/net2sourceinc"
    },
    "education": {
        "required_credential": ""
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Summit",
        "region": "NJ",
        "postal_code": "07901",
        "street_address": null,
        "latitude": 40.71798,
        "longitude": -74.35874
    }
}