{
    "job": {
        "title": "Senior Data Engineer - Python / Data Streaming ",
        "industry": "Information Technology and Services",
        "description": "Ippon Technologies is a global technology consulting firm that unlocks possibilities by setting new standards for excellence and delivery. We accelerate our customers’ digital roadmaps and our consultants’ careers.&amp;nbsp;   We are looking for a Data Engineer based in Washington DC (or NYC, or Richmond, VA, or North Carolina, or Atlanta, GA), but we're Remote Friendly.   The Ippon story started in 2002 in Paris, France - cue in the accordion. Our founder and CEO Stephane Nomis used his unique experience as an international Judo champion to create a culture based on the sports values of ambition and excellence. Ippon Technologies has the brains and brawn summarized by our five COACH values: Creative, Open, Agile, Courageous, and Hungry. Do you want to work with other talented individuals who are driven and fun to work with? Do you enjoy providing solutions and value to clients? Then Ippon is where you belong!&amp;nbsp;It’s your lucky day because we are growing fast in the US and are currently seeking Data Engineer&amp;nbsp;to join our team!&amp;nbsp;   Ippon values talented individuals who are fun to work with. We also value diversity and the different perspectives our employees bring to Ippon Technologies everyday. We are an Advanced AWS Consulting Partner. Do you love Data, Cloud and Open Source Technologies? Are you driven by providing solutions and value to clients? Are you the one everyone comes to for all things Tech? Then Ippon USA is where you belong! And It’s your lucky day, because we are currently seeking a Data Engineer.   Take your next career step with Ippon Technologies, a Global Data leader!   We build tailor-made architecturesBecause there is not one solution that fits all needs, we give special care to design pragmatic and simple data architectures to serve our customers demonstrated needs.We are looking for data engineers who are comfortable with different architectural approach such as:&amp;nbsp;  - Batch processing for historical data (e.g. Hadoop, Spark)   \n  - Streaming processing for near-real time analysis (e.g. Kafka, Flink)   \n  - Machine Learning for classification, prediction, root-cause-analysis, etc. - e.g. Sci-Kit Learn, Keras, Tensorflow   \n   Since we are a Cloud First Digital Company, it’s even more attractive if you are skilled with cloud counterparts technologies.   What you will do:     - Design and implement Data Architectures&amp;nbsp;   \n  - Create and optimize data pipelines   \n  - Enhance real-time data processing   \n  - Work with Data Scientists and Data Owners to understand use cases and hypothesis to test with the data   \n  - Build complete data platforms by assembling major Big Data solutions such as: EMR, Kafka, Spark, Airflow, Flink, Snowflake, Elasticsearch, etc.   \n  - Python / Scala / Java / coding   \n   What we are looking for:     - Bachelor's degree in Computer Science or a related field   \n  - At least three (3+) years of software development experience   \n  - Data Streaming techniques: Apache Kafka, Amazon Kinesis, Flink, Spark Streaming, etc.   \n  - Experience with AWS technologies: DynamoDB, Glue, Athena, Redshift, Kinesis, EMR   \n  - Cloud Certifications (AWS/AZURE/GCP): Solution Architect Associate or Pro, Big Data Specialty   \n  - Good knowledge of NoSQL solutions, must be able to recommend the best fit for NoSQL solutions (MongoDB and/or Cassandra is a plus)   \n  - Snowflake experience desirable   \n  - CI/CD, Kubernetes, Docker   \n  - Productionalization of ML models a plus.&amp;nbsp;   \n  - Agile development   \n  - ETL / ELT tool experience&amp;nbsp;   \n  - Judo optional   \n  - Attention to details. Mention the word ‘pineapple’, in your interview   \n  - Must love croissants&amp;nbsp;   \n   Ippon values talented people who are fun to work with. We also value diversity and the different perspectives our employees bring to Ippon Technologies.So, do YOU speak Ippon?&amp;nbsp;   Ippon USA is an Equal Opportunity Employer",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-05T17:29:05.000Z"
    },
    "company": {
        "name": "Ippon Technologies USA",
        "link": "https://www.linkedin.com/company/ippon-technology"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": "Senior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "New York City Metropolitan Area",
        "region": null,
        "postal_code": "10021",
        "street_address": null,
        "latitude": 40.748295,
        "longitude": -73.98556
    }
}