{"location": {"country": "US", "locality": "Alpharetta", "region": "Alpharetta", "postal_code": "30022", "street_address": null, "latitude": 34.075615, "longitude": -84.29455}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer-Graduate", "industry": "Information Technology and Services,Computer Software,Telecommunications", "description": "Primary Skill :\n[[reqPrimarySkill]]\nSecondary Skill :\n[[reqSecondarySkill]]\nOther Skills :\n[[reqOtherSkills]]\nOrganizational Level 1 :\nAmdocs Global Business\nOrganizational Level 2 :\nAmdocs Americas\nManager :\nShirly Barda\nLocation:\nUSA- Alpharetta (Customer Site)\nTalent Acquisition:\nAntoinette Williams\nRequired Travel :\nMinimal\nOpen to Relocation :\nRelocation - No\nReferral Bonus Reward Amount * :\n$500.00\nIn case this job is open for Amdocs employees only \"Refer Friend to Job\" option is disabled\nWho are we?\nIf you’re a smartphone user then you are part of an ever more connected and digital world. At Amdocs, we are leading the digital revolution into the future. From virtualized telecommunications networks, Big Data and Internet of Things to mobile financial services, billing and operational support systems, we are continually evolving our business to help you become more connected. We make sure that when you watch a video on YouTube, message friends on Snapchat or send your images on Instagram, you get great service anytime, anywhere, and on any device. We are at the heart of the telecommunications industry working with giants such as AT&T, Vodafone, Telstra and Telefonica, helping them create an amazing new world for you where technology is being used in amazing new ways every single day.\nIn one sentence\nResponsible for design, development, modification, debug and/or maintenance of software systems\nWhat will your job look like?\nYou will design, develop, modify, debug and/or maintain software code according to functional, non-functional and technical design specifications.\nYou will follow Amdocs software engineering standards, applicable software development methodology and release processes, to ensure code is maintainable, scalable, and supportable, and demo the software products to stakeholders.\nYou will investigate issues by reviewing/debugging code, provide fixes and workarounds, and review changes for operability to maintain existing software solutions.\nYou will work within a team, collaborate and add value through participation in peer code reviews, provide comments and suggestions, and work with cross functional teams to achieve goals.\nYou will assume technical accountability for your specific work products within an application and provide technical support during solution design for new requirements.\nYou will be encouraged to actively look for innovation, continuous improvement, and efficiency in all assigned tasks.\nAll you need is...\nBachelor's degree in Computer Science, Computer/Electrical Engineering or equivalent.\n0-1 years' experience in software development\nExperience with coding and scripting languages (Java, JavaScript, Python, Ruby, etc.).\nExperience with Web technologies (REST APIs, HTML5, SSL, etc.).\nExperience with data modeling and databases (Oracle, MySQL, etc.).\nExperience with application frameworks (Spring, Hibernate, Angular, etc.)\nWhy You Will Love This Job\nGet the chance to work with the industry's most ground-breaking testing technologies and help customers shift into the new testing realities of the digitized world!\nGet the opportunity to work in a growing organization, with ever growing opportunities for personal growth and one of the highest scores of employee engagement in Amdocs!\nWe offer a wide range of stellar benefits including health, dental, vision, and life insurance as well as paid time off, sick time, and parental leave!\nAmdocs is an equal opportunity employer. We welcome applicants from all backgrounds and are committed to encouraging a diverse and inclusive workforce.\nAmdocs is an equal opportunity employer. We welcome applicants from all backgrounds and are committed to fostering a diverse and inclusive workforce", "employment_type": "FULL_TIME", "date_posted": "2021-10-14T00:00:00.000Z"}, "company": {"name": "Amdocs", "link": "https://www.linkedin.com/company/amdocs"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}