{"location": {"country": "US", "locality": "Burlington", "region": "Burlington", "postal_code": "01803", "street_address": null, "latitude": 42.504986, "longitude": -71.19583}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer I", "industry": "Hospital &amp; Health Care", "description": "Abbott is a global healthcare leader that helps people live more fully at all stages of life. Our portfolio of life-changing technologies spans the spectrum of healthcare, with leading businesses and products in diagnostics, medical devices, nutritionals, and branded generic medicines. Our 109,000 colleagues serve people in more than 160 countries.\nEmbedded Software Engineer – Heart Failure Therapy Burlington, MA\nLeading an active lifestyle is important to the many people we serve. In Abbott’s\nElectrophysiology and Heart Failure (EPHF)\ndivision, we’re advancing the treatment of heart and vascular disease through breakthrough medical technologies, As a global leader in\nMechanical Circulatory Support Therapy\n, our breakthrough medical device technologies help restore people's health so they can get back to living their best lives, faster. We focus on innovative technologies that can improve the way doctors treat people with heart failure (HF).\nAs Embedded Software Engineer\n, you will be part of our\nMechanical Circulatory Support\nTherapy\nproduct development team focused on planning and delivering of custom in-house embedded software applications developed for Implantable Devices meeting both short term and long-term goals of our patients. Located at our Burlington, MA site, you will contribute to embedded software projects that meet customers’ needs in terms of functionalities, performance, time, and cost.\nDuties And Responsibilities\nParticipate in developing embedded software and contribute towards developing class III implantable medical device that has been awarded breakthrough technology designation.\nWork from requirement specifications, designs, develop, maintain, and update embedded software\nContribute to other developers in software design, implementation, unit testing, and debugging.\nParticipate in cybersecurity risk assessment, requirements development, and implementation of cybersecurity features and best practices.\nParticipate in and support implementation, new creation, enhancements, and modifications to embedded software, source code, scripts, and procedures\nDebug, troubleshoot, and isolate software problems and offer strategic advice regarding identified issues for future development;\nContribute to developing design concepts (i.e. parameters, structure, and core components).\nMay present or contribute to presentations at design reviews; document and resolve issues as directed.\nContribute to and support a variety of development and test phase efforts.\nMay write and update requirement specifications for an assigned area.\nContribute to project deliverables such as specifications, code, and test/tool procedures for feasibility, thoroughness, clarity, correctness, and accuracy.\nComply with U.S. Food and Drug Administration (FDA) regulations, other regulatory requirements, company policies, operating procedures, processes, and task assignments.\nMaintain positive and cooperative communications and collaboration with all levels of employees, customers, contractors, and vendors.\nPerform other related duties and responsibilities, on occasion, as assigned.\nExperience And Education Requirements\nBachelor’s degree (Major in CS, EE, or related field preferred)\nUnderstanding of C/C++ ; (understanding of C/C++ in an embedded environment for micro-controllers preferred).\nSolid understanding of visual modeling, graphical user interfaces using QT, multi-threading, networking, relational databases, formal software development methodologies, and source code management\nExperience in programming languages such as C, C++, and Python.\nPreferred Qualifications / Education\nMaster’s degree in related field (education may substitute for some years of experience)\nDevelopment experience using C/C++ in an embedded environment for micro-controllers.\nExperience with visual modeling, graphical user interfaces, multi-threading, networking, relational databases, formal software development methodologies, and source code management.\nExperience with unit- and integration-level testing and automated testing.\nAbility to plan for project deliverables and manage the project team towards meeting schedule and cost, as well as delivering product of high quality.\nAbility to communicate technical solutions and issues clearly and adequately to management as well as members on the project.\nExperience with Embedded Software Development within the regulated medical field.\nExperience analyzing and debugging embedded system using oscilloscopes, logic Analyzers and any other appropriate equipment.\nExperience in working in an iterative (Scrum, Kanban) development process.\nAbility to capture and analyze customer’s needs, to understand design and solution towards solutions.\nExperience in Implantable technologies\nExperience of multi-tasking systems and real-time application development (ex. threading, semaphores, processes, etc.).\nExperience of low-level real time system development, such as interrupts, and device drivers.\nKnowledge of hardware breadboards and PC hardware system interfaces and embedded systems.\nExperience with BLE 5.0 a plus\nWhat We Offer\nAt Abbott, you can have a good job that can grow into a great career. We offer:\nTraining and career development, with onboarding programs for new employees and tuition assistance\nFinancial security through competitive compensation, incentives and retirement plans\nStudent Loan Repayment Assistance\nHealth care and well-being programs including medical, dental, vision, wellness and occupational health programs\nPaid time off\n401(k) retirement savings with a generous company match\nThe stability of a company with a record of strong financial performance and history of being actively involved in local communities\nLearn more about our benefits that add real value to your life to help you live fully:\nwww.abbottbenefits.com\nFollow your career aspirations to Abbott for diverse opportunities with a company that provides the growth and strength to build your future. Abbott is an Equal Opportunity Employer, committed to employee diversity.\nConnect with us at\nwww.abbott.com\n, on Facebook at\nwww.facebook.com/Abbott\nand on Twitter @AbbottNews and @AbbottGlobal.", "employment_type": "FULL_TIME", "date_posted": "2021-08-30T00:00:00.000Z"}, "company": {"name": "Abbott", "link": "https://www.linkedin.com/company/abbott-"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": null, "seniority_level": null}}