{
    "job": {
        "title": "Software Engineer (Python/Javascript)",
        "industry": "Information Technology and Services,Computer Software,Hospital & Health Care",
        "description": "Title: Software Engineer (Python/Javascript)Reporting to: Sr. Director, Research & DevelopmentOpportunity:The software engineer is primarily a software maintenance and development position with broad responsibility towards designing, building, maintaining and debugging system and framework level software across a wide array of end user computing devices. This includes but is not limited to X86/Linux, SmartTV platforms from LG and Samsung, as well as familiarity with mobile platforms such as Android and IOS. The engineer will operate initially under the tutelage and mentorship of senior engineers.This position can be based out of our Bethesda, MD headquarters or remotely.Responsibilities:Manage software across many end user devices such as X86/Linux, SmartTV platforms, and mobile platformsContribute to all phases of the software development cycleTroubleshoot software issuesProvide recommendations for changes and improvementsCollaborate with other engineers on software projectsOther duties as assignedRequirements:Experience working on software projects in either a professional or open source environment2+ years related experience in a professional level software development capacity, or equivalent degree/certificationsProficiency in Python 3, Javascript, HTML 5, Web Services & Topologies, Microservices, Linux CLI and Bash scripting, and WAMPStrong ability to read API documentation and adapt to needed use casesExperience with web software and technology centered around JavaScriptExcellent troubleshooting skillsAbility to learn: to rapidly absorb information concerning complex technical eco systems and integrate it into productive actionDemonstrated organizational skillsAbility to multitask and prioritizeDemonstrated ability to communicate effectively, both verbally and writtenEven Better:Bachelor’s degree in computer science or applicable field preferred, but not requiredExperience with AngularJS, VueJS, AWSFamiliarity with digital and analog video, Java, Autobahn, or websocketsAbout You:Communicates openly and easilyAggressively attacks new projectsWilling to learn new techniques and technology, sometimes for each new projectDesire to know and understand why features and products are being developedHappy to work on and support others on a teamAble to work with a variety of people, some technical, some notNot put off by having team members across the country or the globe; willing use any available tool to ensure good communication across the teamAbout GetWellNetwork:GetWellNetwork’s interactive solutions engage patients and families, empower clinicians and deliver outcomes that matter. The global digital health company has been helping to unite providers and patients as partners in the healthcare journey for 20 years. From inpatient to outpatient, our comprehensive cross-continuum platform bridges care settings to create a seamless experience for patients and their families.With more than 300+ employees across the U.S., GetWellNetwork is dedicated to changing the lives of millions of patients and families every year. If you're passionate about working in a high-growth, dynamic and innovative environment that is changing an industry, then we want to hear from you!GetWellNetwork is an Equal Opportunity Employer.Powered by JazzHRaMaMUpmgwX",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-05T03:36:31.000Z"
    },
    "company": {
        "name": "GetWellNetwork",
        "link": "https://www.linkedin.com/company/getwellnetwork"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Bethesda",
        "region": "MD",
        "postal_code": "20894",
        "street_address": null,
        "latitude": 38.984856,
        "longitude": -77.09269
    }
}