{"location": {"country": "US", "locality": "Irvine", "region": "Irvine", "postal_code": "92717", "street_address": null, "latitude": 33.68591, "longitude": -117.82472}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Site Reliability Engineer (Remote)", "industry": "Internet,Information Technology and Services,Computer Software", "description": "Site Reliability Engineer\nOverview\nAs a Site Reliability Engineer at Weedmaps you will work cross-departmentally with your partners on the application, infrastructure and quality teams to enhance the performance, reliability, resilience and scalability of the web services that make up Weedmaps.com. We are a cloud native organization with 100% of our services in Docker running on Rancher and Kubernetes in AWS’ public cloud. We also leverage observability, monitoring, CI/CD automation and custom tooling to push multiple production releases a day.\nYour day to day focus will be leveraging your engineering skills to assist in building, monitoring, reducing developer toil, configuring CI workflows and improving our deployment pipelines. You will also be a knowledge reference for our development teams to ensure they are leveraging consistent tooling for metrics, logging, build, and deployment. You will work closely with the development and infrastructure teams to identify the essential service-specific metrics (beyond the golden metrics) that need to be monitored and work with application development teams to create libraries to allow services to easily instrument their services.\nThe Impact You'll Make\nCollaborate with stakeholders to drive best practices for monitoring, CI/CD pipelines\nTroubleshoot deployment issues in our CI/CD pipeline\nAdvocate emphatically for the DevOps culture here at Weedmaps\nIdentify areas for automation and embrace the codification of all things\nEvangelize best practices around collaboration, reliability, security and performance to all partner teams\nTake ownership of the application configuration/scaling for given services to ensure that they are following the established practices of the organization\nCreate and refine synthetic monitoring flows\nHelp teams understand the reliability of their services using metrics and observability.\nWhat You've Accomplished\nMinimum 5 years of experience at startup/mid-sized companies\nProficiency in at least one, Python, Go, Node, Ruby or Elixir\nExperience using/operating Kubernetes in a production environment.\nEffective communication skills, a positive attitude, and ability to give and receive constructive feedback\nAbility to learn fast and be adaptable to environments and change.\nStrong bias for action and strong decision-making capabilities.\nMust be capable of self-managing. Prioritization and time management are an absolute must.\nProfessional experience with cloud native observability standard such as Open metrics, Open tracing and Open Census\nExpertise using/configuring modern CI/CD workflows\nIntimate understanding and experience implementing of SLIs, SLOs and SLAs from the service level to the business level\nIntimate understanding of the golden metrics, how to monitor and alert on them\nDeep understanding of the GitHub branching strategy\nExperience troubleshooting containerized applications\nFamiliarity with Infrastructure as Code, automation and configuration\nBonus Points\nFamiliarity with cloud infrastructure concepts (AWS, GCP)\nExperience with Hashicorp tools such as Terraform, Consul, Vault\nComputer science or other engineering background\nExperience with CI tools such as CircleCi, Jenkins, Travis, Drone, Semaphore, etc.\nExperience with monitoring and observability with tools like Prometheus, CloudWatch, DataDog, and Grafana\nOur Benefits\n100% paid employee monthly Medical, Dental and Vision premiums AND 80% paid dependent monthly premiums\nHMO (California residents only) and PPO option offered through United Healthcare\nCompany-paid $50,000 in Basic Life/AD&D (Accidental Death and Dismemberment) coverage\n401(k) Retirement Plan: 100% match on the first 1%. 50% match from 2-6% of employee contributions\n3 weeks PTO (accrued) and 5 sick days (immediate)\nSupplemental, voluntary benefits\nKindbody (family planning/fertility) including up to $10,000 towards cash-pay services\nGoodly (Student Loan Repayment/529 Education Savings) including a company contribution of up to $1,000/year\nFlexible Spending Accounts (Medical, Dependent, Transit and Parking)\nVoluntary Life Insurance\nCritical Illness\nAccident Insurance\nShort- and long-term disability\nPet Insurance\nPaid parental leave\nDuring current work-from-home:\nReimbursements for home office setup and monthly WiFi\nOur Culture\n11 company-paid holidays\nCatered lunch and snacks provided when working in the office\nSnack boxes sent straight to your door when you work-from-home\nCasual work environment, read no fancy clothes required, but you are free to dress to the nines!\nMonthly virtual happy hours\nQuarterly all-hands meetings\nWeedmaps is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, gender expression, national origin, protected veteran status, or any other basis protected by applicable law, and will not be discriminated against on the basis of disability. We are looking for the smartest and most passionate people who want to join our team and develop the services, systems, and marketplaces that will serve the marijuana industry in the decades to come. Our company uses E-Verify to confirm the employment eligibility of all newly hired employees. To learn more about E-Verify, including your rights and responsibilities, please visit www.dhs.gov/E-Verify.\nAbout Weedmaps\nFounded in 2008, Weedmaps is a leading technology and software infrastructure provider to the cannabis industry. Our suite of cloud-based software and data solutions includes point of sale, logistics and ordering solutions that enable customers to scale their businesses while complying with the complex and disparate regulations applicable to the cannabis industry. In addition, our platform provides consumers with information regarding cannabis products across web and mobile platforms, including listing local retailers and brands, facilitating product discovery and allowing consumers to educate themselves on cannabis and its history, uses and legal status. Headquartered in Irvine, California, Weedmaps employs more than 400 professionals around the world, with offices including Barcelona, Denver, and Toronto.\nSo what are you waiting for? Join the Weedmaps family!", "employment_type": "FULL_TIME", "date_posted": "2021-08-19T07:07:49.000Z"}, "company": {"name": "Weedmaps", "link": "https://www.linkedin.com/company/weedmaps"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}