{
    "job": {
        "title": "Data Scientist",
        "industry": "Entertainment",
        "description": "Company Overview      WarnerMedia is a powerful portfolio of iconic entertainment, news, and sports brands. We bring people, technology, and the world’s best storytellers together to drive culture and meaningful connection. We believe the enduring power of stories can open our eyes to the world, to each other, and to new and different perspectives.      Join us. Shape your story here.      The Job      WarnerBros is looking for a talented data scientist to join our Data Intelligence Team. The data scientist will be responsible for predictive modeling and analysis of customer data, as well as researching best practices in analytics and data science, and sharing them across the company to improve analytic capabilities at Warner Bros.      The Daily     - Analyze and model internal customer data   \n  - Build relationships and collaborate with analysts and researchers across WB   \n  - Produce statistical and machine learning models that inform how we communicate with our customers   \n  - Drive improvement in our methodologies, systems and processes   \n  - Provide analysis, reporting, and modeling to internal organizations based on customer data   \n  - Prepare and present results of analyses to leadership      \nThe Essentials     - Minimum of 1-2 years of experience in analytics and data science   \n  - 1+ years of experience with conducting analysis in R, Python, SAS, or similar analytical languages   \n  - Experience with relational databases and SQL   \n  - Experience with working in cloud based environments like AWS a plus   \n  - B.A./B.S. degree in Statistics, Mathematics, Computer Science, Economics, Political Science, or similar quantitative field   \n  - Quantitative oriented Masters Degree or Ph.D preferred   \n  - Expertise in machine learning and predictive modeling approaches such as Random Forest, GBM, xgBoost, neural networks/deep learning, etc   \n  - Skilled researcher, able to distill large bodies of research to key findings and explain them to varied audiences   \n  - Experience developing testing plans for evaluating campaigns or changes to products   \n  - Knowledge of basic survey design and analysis   \n  - Strong history of identifying opportunities for developing predictive models to meet business needs   \n  - Love of TV, Movies, Games, and Comics is a Plus!   \n  - General office activities - walking, standing, sitting, speaking, lifting, bending, etc   \n  - Must be able to communicate effectively and tactfully with all levels of personnel, both in person and on the telephone   \n  - Must be able to pay close attention to complex detail and understand written and oral instructions   \n  - Must be able to organize and schedule work effectively   \n  - Must be able to work well under time constraints   \n  - Must be able to handle multiple tasks with changing priorities, communicating changes in scope and schedule to all parties concerned   \n  - Must be able to work independently   \n  - Must be able to maintain confidentiality      \nBusiness Unit Overview      Warner Media, LLC and its subsidiaries are equal opportunity employers. Qualified candidates will receive consideration for employment without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law      Company Overview      WarnerMedia is a leading media and entertainment company that creates and distributes premium and popular content from a diverse array of talented storytellers and journalists to global audiences through its consumer brands including: HBO, HBO Max, Warner Bros., TNT, TBS, truTV, CNN, DC Entertainment, New Line, Cartoon Network, Adult Swim, Turner Classic Movies and others.      Warner Bros. has been entertaining audiences for more than 90 years through the world’s most-loved characters and franchises. Warner Bros. employs people all over the world in a wide variety of disciplines. We're always on the lookout for energetic, creative people to join our team.      The Perks     -  Exclusive WarnerMedia events and advance screenings   \n  -  Paid time off every year to volunteer for eligible employees   \n  -  Access to well-being tools, resources, and freebies   \n  -  Access to in-house learning and development resources   \n  -  Part of the WarnerMedia family of powerhouse brands      \nThe Perks     - Exclusive WarnerMedia events and advance screenings   \n  - Paid time off every year to volunteer for eligible employees   \n  - Access to well-being tools, resources, and freebies   \n  - Access to in-house learning and development resources   \n  - Part of the WarnerMedia family of powerhouse brands      \nWarner Media, LLC and its subsidiaries are equal opportunity employers. Qualified candidates will receive consideration for employment without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-20T21:20:53.000Z"
    },
    "company": {
        "name": "WarnerMedia",
        "link": "https://www.linkedin.com/company/warnermedia"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Junior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Burbank",
        "region": "CA",
        "postal_code": "91504",
        "street_address": null,
        "latitude": 34.182053,
        "longitude": -118.30747
    }
}