{
    "job": {
        "title": "Software Engineer I",
        "industry": "Computer Software,Internet,Financial Services",
        "description": "The engineering team at Root strives to be one of the most transformative engineering teams ever. We’re changing the way an industry works by leveraging technology and data to build the best products possible. Even with our significant growth, we operate in small teams that are given ownership over projects and results. We’ve found that the people closest to the problems are the best at solving them.Our Tech Stack IncludesRuby / Rails backend, RSpec for testingJavascript / React Native frontend, Mocha for testingSmall amounts of native iOS and AndroidDeployment to AWS ECS using containersBuildkite for CIWe’re scaling rapidly, and we recently launched a $6B IPO:https://www.nasdaq.com/articles/root-insurance-ipo-poised-to-disrupt-the-insurance-market-2020-10-30Our team excels at delivering software to solve the problems in front of us at Root: presently, a suite of world-class mobile, web, and server-based products obsessed with the customer experience. We’ve shaped our team and process around this; we know that constant iteration and experimentation produce the best results.For more information on engineering at Root see root.engineeringWe divide the areas of responsibility for engineers into three major areas:Technical: The skills and knowledge that make up an engineer’s basic problem-solving toolbox.Planning and Execution: The ability to plan and execute assigned work beyond basic technical solutions.Working with Others: The ability to work effectively with other engineers and people in other functions.Technical SkillsWhat we look for in a Software Engineer I:Excellent command of basic programming skillsSolid knowledge of 1 to 2 languages; familiar with othersExperienced with at least one common programming paradigmBasic understanding of client-server architecture and web technologiesFluent usage of version control toolsBasic knowledge of databases and SQLPlanning and ExecutionWrites clean, functional, well-tested codeCompletes medium pre-planned tasks in an efficient manner, making changes that touch multiple aspects of the applicationFollows existing patterns and aims for consistency with the rest of the codeAble to take on small unplanned feature work and bugfixesStarts understanding and taking business goals into account when making implementation decisionsWorking With OthersProvides good feedback on other teammates’ work in code reviewsWorks with the engineering lead and teammates to answer questions about their workUnderstands and implements feedback from peers into own work",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-16T03:52:56.000Z"
    },
    "company": {
        "name": "Root Inc.",
        "link": "https://www.linkedin.com/company/rootinsurance"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Columbus",
        "region": "OH",
        "postal_code": "43272",
        "street_address": null,
        "latitude": 39.96276,
        "longitude": -82.99629
    }
}