{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Health, Wellness and Fitness",
        "description": "Position Summary :This Machine Learning position lies within the newly formed Data Science Optimization team. DSO’s mission is to accelerate the scientific, engineering, and commercial efforts of the 800+ data scientists and engineers in the Analytics & Behavior Change organization through data-driven solution development. You will be working cross-functionally with a diverse multi-disciplinary team of data scientists, data engineers, and machine learning engineers. Each project is ambitious and far reaching, with the potential to become a new internal standard, open source software, and/or differentiating intellectual property. Whether you’re developing a niche package/library to enhance the data science workflow or engineering a highly generalizable machine learning system for the enterprise, know that there are millions of members, customers, and users being directly and indirectly affected by this work.The role requires a keen sense of ownership, scrappiness, and initiative. If you have an insatiable curiosity for how things work, enjoy building things, are obsessed with measuring, and are energized by tackling complex problems, then we’d love to work with you.Required Qualifications :• Excellent analytical and problem-solving skills.• Highly proficient in Python, SQL, shell scripting, Git.• Substantive experience working with peta-scale data in a cloud environment (GCP, AWS, Azure).• Thorough understanding of machine learning engineering principles such as distributed/parallel computing paradigms and advanced data structures.• Experience building machine learning and ETL/ELT pipelines (Airflow, Kubeflow, Prefect) and deploying them to the cloud.• Thorough understanding of and appreciation for data unit testing.• Experience working with a cloud data warehouse such as BigQuery, Snowflake, or Redshift.• Familiarity with modern libraries for scaling up workloads such as Dask, PyArrow, and Rapids.• Strong collaboration and communication skills within and across teams.• Bachelor's degree or equivalent work experience in Computer Science, Engineering, or related discipline.Preferred Qualifications :• Experience developing real-time/streaming data pipelines.• Familiarity with Fivetran, Stitch, DBT, or Dataflow.• Proficiency in C++ or Java.• Interested in mentoring junior team members.• Strong organizational, management, and leadership skills.• Ability to communicate technical ideas and results to non-technical clients in written and verbal form.• Master’s degree or PhD in Computer Science, Engineering, or related discipline.Education :Master’s degree or PhD preferred.Bachelor's degree or equivalent work experience in Computer Science, Engineering, Machine Learning, or related discipline.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-15T20:03:44.000Z"
    },
    "company": {
        "name": "CVS Health",
        "link": "https://www.linkedin.com/company/cvs-health"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}