{"location": {"country": "US", "locality": "United States", "region": "United States", "postal_code": "99999", "street_address": null, "latitude": 39.50355, "longitude": -99.0183}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Software Engineer II", "industry": "Information Technology and Services,Computer Software", "description": "SilkRoad Technology is the world’s leader in strategic onboarding for global workforce readiness and transformation. We help organizations prepare their people for change by designing intentional, personalized journeys to increase retention and maximize agility throughout their careers. SilkRoad combines our leading strategic onboarding capabilities with world-class consulting services to deliver highly scalable, personalized experiences that engage employees and drive long-term business performance such as productivity, profitability, growth and agility.\nOur Software Development Team is seek a\nSoftware Engineer II\nto be part of a team responsible for the development and deployment of SilkRoad products and services. As part of the Development team, the Software Engineer II will be involved in design, coding, unit testing, code review, and automating build/deployment of our services and applications.\nThis position can be located anywhere in the continental United States but may require periodic travel for in-person team meetings.\nYour Contributions To SilkRoad Will Include:\nOwning a functional area.\nBreaking large stories down into sub-tasks, giving higher-level status updates.\nWriting test plans.\nTaking operational responsibility.\nSetting measurable goals and meeting them.\nReviewing code changes.\nHelping mentor new hires.\nRequired Skills:\nProficient with cloud software development and agile development practices.\nGood hands-on knowledge of Configuration Management and Deployment tools.\nProficient with build and deployment automation in a cloud environment.\nProficient with git and git workflows.\nKnowledge of cloud platforms.\nExperience with a variety of technology areas.\nAbility to work independently between periodic check-ins.\nEstimates timelines effectively; identifies and communicates roadblocks in timely manner; takes operational excellence seriously.\nRequired Experience:\nBachelor's degree in Computer Science or other technical discipline, or equivalent work experience.\nMinimum of 5 years of experience developing commercial software, preferably in a cloud environment.\nExperience with modern Microsoft stack (C#, SQL Server,.NET Core), UI frameworks (React, material-ui) is preferable.\nMinimum of 3 years of experience developing Continuous Integration and Continuous Deployment pipelines using modern tools such as Jenkins and goCD.\nMinimum of 3 years of experience with Git and Git workflows.\nExperience with C++, ColdFusion is a plus.", "employment_type": "FULL_TIME", "date_posted": "2021-07-14T17:02:17.000Z"}, "company": {"name": "SilkRoad Technology", "link": "https://www.linkedin.com/company/silkroad"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}