{
    "job": {
        "title": "Software Engineer I",
        "industry": "Hospital & Health Care",
        "description": "Abbott is a global healthcare leader that helps people live more fully at all stages of life. Our portfolio of life-changing technologies spans the spectrum of healthcare, with leading businesses and products in diagnostics, medical devices, nutritionals, and branded generic medicines. Our 109,000 colleagues serve people in more than 160 countries.Software Engineer I â St Paul (Little Canada) Tech CenterJoin a dynamic and motivated team at Abbott Electrophysiology (EP), developing medical products that set the bar for clinical excellence and efficient workflow. Our products provide cutting edge, advanced software to enable 3D cardiac models which help in diagnosing and treating cardiac disease. As a member of the software development team you will help take these products to the next level and reduce cost, improve quality, increase access. The Software Engineer I contributes to all phases of the software lifecycle, including concept development, requirements, design, implementation, and testing.Primary Duties And ResponsibilitiesWrite well-designed, testable codeDevelop Machine learning capabilities for recognizing and analyzing cardiac imagesWork closely with cross-functional teams in Systems and hardware/firmware to develop optimal solutions combining software and embedded software on FPGAâsIntegrate software components into functional software systemDevelop graphical user interface componentsDevelop manual and automated tests for software verification as neededDevelop and maintain documentation to identify design, requirements, and solutionsUtilize your familiarity with all aspects of Software Development Life Cycle and methodologiesCommunicate effectively both within immediate team and across the program and business leadership teamRequired QualificationsB.S. in Computer Engineering, Computer Science, Electrical Engineering, Computer Systems Engineering, Software Engineering, or related discipline.Excellent C++/C#/Java knowledgePreferredMasterâs Degree in Engineering (Computer, Electrical, Computer Systems, or Software), Computer Science, or related discipline / Advanced degree may substitute for up years of experience2+ months of software engineering design.Excellent documentation skillsStrong understanding of the hardware/software interfaceExperience working in a Linux environmentExperience working in a regulated environment (preferably medical)Strong oral and written communication skillsStrong interpersonal skillsSoftware development tool experience such as Perforce, Jira, JenkinsWhat We OfferAt Abbott, you can have a good job that can grow into a great career. We offer:Training and career development, with onboarding programs for new employees and tuition assistance and student loan repayment programStudent Loan Repayment AssistanceFinancial security through competitive compensation, incentives, and retirement plans Health care and well-being programs including medical, dental, vision, wellness and occupational health programs Paid time off 401(k) retirement savings with a generous company match The stability of a company with a record of strong financial performance and history of being actively involved in local communities Learn more about our benefits that add real value to your life to help you live fully:â¯ www.abbottbenefits.comFollow your career aspirations to Abbott for diverse opportunities with a company that provides the growth and strength to build your future. Abbott is an Equal Opportunity Employer, committed to employee diversity.Connect with us at www.abbott.com, on Facebook at www.facebook.com/Abbott and on Twitter @AbbottNews and @AbbottGlobal.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-14T00:00:00.000Z"
    },
    "company": {
        "name": "Abbott",
        "link": "https://www.linkedin.com/company/abbott-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Minneapolis–Saint Paul",
        "region": "MN",
        "postal_code": "56304",
        "street_address": null,
        "latitude": 44.95,
        "longitude": -93.2
    }
}