{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "What you’ll do:Design, build, and maintain features and services across mabl’s entire product surfaceWork as part of a small, self-directed team to define, implement, test, and support solutions to high level product challengesCollaborate closely with other engineers, product managers, and designersTake responsibility for the quality and impact of your own contributions and those of your teammatesDebug production issues across services and multiple levels of the stackContinually seek out and incorporate customer feedback into your work, including regularly joining customer callsParticipate in our on-call rotationWhat you’ll bring to the table:You have experience as a developer working on the critical path of applications with meaningful production trafficYou have a high bar for quality of code and quality of user experienceYou constantly learn, challenge assumptions, and ensure your work is providing high customer valueYou are an effective communicator; we are a small team, and you will be involved in every aspectYou are happy to branch out and contribute wherever needed—within your technical wheelhouse or otherwiseEngineering at mabl:The Engineering team is driven by mabl’s core values: drive, insight, support, and authenticity. Working closely with our users and the rest of the product team, the Engineering team builds and supports the cloud-native service that enables our customers to create, manage, and run end-to-end tests running on a scalable infrastructure. We value small, self-organizing teams that are empowered to make decisions and quickly solve problems. We strive to deliver the best experience to our customers and prospects. While our primary job is to build quality software through rigorous engineering practice, mabl engineers engage in all phases of product development.Here is a sample of the technologies and toolsets that we use:LanguagesTypeScript, Java, JavaScript, Python, Node.jsFront endReact + ReduxCloud PlatformGoogleMachine LearningTensorflow, ML EngineData AnalysisBigQuery, DataFlow, SpannerComputeContainer Engine, Cloud Functions, App Engine, Cloud RunSource ControlGitHubContinuous IntegrationGitHub Actions ",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-11T15:19:41.000Z"
    },
    "company": {
        "name": "mabl",
        "link": "https://www.linkedin.com/company/mabl"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Greater Boston",
        "region": null,
        "postal_code": "02119",
        "street_address": null,
        "latitude": 42.36041,
        "longitude": -71.05798
    }
}