{
    "job": {
        "title": "Senior Site Reliability Engineer",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Primary Responsibilities     -  Develop automation to create and maintain systems in DC and cloud   \n  -  Manage access to systems like ipa, knowledge with okta asa will be prefer   \n  -  Design and develop tools for system management, monitoring, analysis, etc.   \n  -  Experience with monitoring and automation tools further help analyze real time issues.   \n  -  Familiar with system hardening and server security best practices   \n  -  Working with the Lead Engineer to understand application functionalities and verification requirements; working with Software Engineering to define a scalable real time testing and monitoring strategies   \n  -  Lead troubleshooting and monitoring efforts with production/non-production systems.      \nKnowledge/skills     -  Programming: Bash Scripting, Python   \n  -  Source Control: git   \n  -  Build: Jenkins, Pipeline   \n  -  OS hardening: cobbler,packer, kickstart   \n  -  Security: iptables, firewalld, SSH, TLS, IAM   \n  -  Network: tcpdump, ngrep, wireshark   \n  -  Systems: Linux: CentOS, Amazon linux   \n  -  Cloud skill: AWS, packer, terraform   \n  -  Monitoring: Zabbix, Prometheus, Grafana, ELK   \n  -  Configuration: Ansible, Terraform   \n  -  AWS Services: S3, DynamoDB, RDS, Route53, VPC, cloudfront, etc.   \n  -  Common Services: nginx,keepalived, Kubernetes, Bind dns,LVS, ntp,   \n  -  Virtualization: KVM      \nEnsuring a diverse and inclusive workplace where we learn from each other is core to Zoom’s values. We welcome people of different backgrounds, experiences, abilities and perspectives including qualified applicants with arrest and conviction records as well as any qualified applicants requiring reasonable accommodations in accordance with the law.      We believe that the unique contributions of all Zoomies is the driver of our success. To make sure that our products and culture continue to incorporate everyone's perspectives and experience we never discriminate on the basis of race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status.      All your information will be kept confidential according to EEO guidelines.      Explore Zoom     - Hear from our leadership team   \n  - Browse Awards and Employee Reviews on Comparably   \n  - Visit our Blog   \n  - Zoom with us!   \n  - Find us on social at the links below and on Instagram",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-13T15:18:15.000Z"
    },
    "company": {
        "name": "Zoom",
        "link": "https://www.linkedin.com/company/zoom-video-communications"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": "Senior"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}