{"location": {"country": "US", "locality": "Issaquah", "region": "Issaquah", "postal_code": "98029", "street_address": null, "latitude": 47.53007, "longitude": -122.032906}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Data Scientist - Data Analytics", "industry": "Retail", "description": "This is an environment\nunlike anything\nin the high-tech world\nand the secret of Costco’s success is its culture. The value Costco puts on its employees is well documented in articles from a variety of publishers including Bloomberg and Forbes. Our employees and our members come FIRST. Costco is well known for its generosity and community service and has won many awards for its philanthropy. The company joins with its employees to take an active role in volunteering by sponsoring many opportunities to help others. In 2018, Costco contributed over $39 million to organizations such as United Way and Children's Miracle Network Hospitals.\nCostco IT is responsible for the\ntechnical future of Costco Wholesale\n, the second largest retailer in the world with wholesale operations in twelve countries. Despite our size and explosive international expansion, we continue to provide a family, employee centric atmosphere in which our employees thrive and succeed. As proof, Costco consistently ranks in the\ntop five of Forbes “America’s Best Employers”\n.\nThe\nData Scientist - Data Analytics\nis responsible for\ngenerating insights and to augment decision making by the business\n. At Costco, we are on a mission to significantly leverage big data to provide better products and services for our members. This role is focused on advanced analytics, machine learning and data science delivery to support multiple business areas. This role will partner with Product Owner and business owners to build, test advanced analytics solutions and turn data into actionable insights. This is a senior role to enhance the maturity of advanced analytics methods and coach the team across multiple PODs. The Data Scientist is a knowledgeable leader with an ability to lead and is passionate about data and using machine learning to solve business problems. The right candidate will have\ndeep knowledge of applying data science for forecasting, customer analysis, item and inventory management\nand other areas of retail.\nWe are looking for a\nhighly motivated, customer focused professional\nwho wants to work in a fun and highly collaborative environment and willing to be the player as well as coach for the data science community at Costco.\nIf you want to be a part of one of the\nBEST “to work for” companies\nin the world\n, simply apply and let your career be reimagined.\nROLE\nLeads the analysis by applying statistics, machine learning and analytic approaches to predict and optimize business outcomes.\nDesigns and builds ML/DL models to solve business problems.\nCorrectly frames a problem and comes up with a hypothesis.\nAssesses the effectiveness and accuracy of models on an ongoing basis.\nIdentifies new data that could enhance the quality and accuracy of models to improve predictions.\nCommunicates results effectively with storytelling and visualization.\nCoaches the team in feature engineering using machine learning techniques.\nPerforms peer review for another Data Scientist’s work.\nProvides feedback to enhance the testing framework and MLOps.\nExtends beyond core data science work to perform data wrangling and data preparation as needed.\nREQUIRED\n5+ years’ experience in delivering business insights using advanced statistical and machine learning models and visualization.\nProficiency in working with diverse databases and other data sources.\nStrong proficiency in Machine Learning, Statistical and Reporting tools (Python, R, SQL, PowerBI).\nKnowledge of Deep Learning and Neural Networks, and its applications.\nStrong experience working in Cloud (AWS, Azure) based analytics platform.\nGraduate degree in Computer Science, Data Science, and Statistics/Mathematics or related field.\nRecommended\nKnowledge of Agile software development.\nExperience in software development.\nExposure to the retail industry.\nExperience leading team of data scientists.\nExcellent verbal and written communication skills.\nRequired Documents\nCover Letter\nResume\nCalifornia applicants, please click here to review the Costco Applicant Privacy Notice.\nApart from any religious or disability considerations, open availability is needed to meet the needs of the business. If hired, you will be required to provide proof of authorization to work in the United States. Applicants and employees for this position will not be sponsored for work authorization, including, but not limited to H1-B visas.", "employment_type": "FULL_TIME", "date_posted": "2021-08-04T20:23:32.000Z"}, "company": {"name": "Costco IT", "link": "https://www.linkedin.com/company/costco-weareit"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}