{
    "job": {
        "title": "Senior Data Scientist",
        "industry": "Financial Services",
        "description": "This Jobot Job is hosted by Kat SarinasAre you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.Salary $110,000 - $180,000 per yearA Bit About UsWe are a growing open-source platform for launching decentralized finance applications and enterprise blockchain deployments. We make it simple to launch finance applications using blockchain technology.Why join us?This remote role offers the opportunity to build the internet of finance. We are a collaborative and supportive team who empower people to build an open, simple, and democratic system.Job DetailsQualificationsBachelor’s degree in data science/analytics or related field3+ years of data analytics experienceBasic knowledge on computer science principles and architectureExperience in data mining, machine learning and with data visualizationExcellent organization, logic and experience with the experimental methodExperience reviewing and streamlining business processes, including gathering and documenting business requirements, developing and implementing new processes and proceduresAbility to accurately perform complex mathematical computationsAbility to manage multiple priorities, both large and complexBe able to collaborate and innovate as a means to create exceptional value for our members, our company, and our community.Strong analytical and problem-solving abilitiesAbility to break down and understand complex business problems, define a solution and implement it using advanced quantitative methodsRequired SkillsPythonSQL and/or NoSQL databasesRStrong communication skills with regard to analytical concepts and methodsA very high level of intellectual curiosityAWS or Google CloudInterested in hearing more? Easy Apply now by clicking the \"Apply\" button.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-19T00:00:00.000Z"
    },
    "company": {
        "name": "Jobot",
        "link": "https://www.linkedin.com/company/jobot"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}