{"location": {"country": "US", "locality": "Philadelphia", "region": "Philadelphia", "postal_code": "08051", "street_address": null, "latitude": 39.95106, "longitude": -75.16562}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Senior Site Reliability Engineer (SRE)", "industry": "Health, Wellness and Fitness", "description": "Quil, a digital health company, delivers actionable and personalized health itineraries for patients and caregivers, answering the question “What Happens Next?” in their healthcare journeys. We combine the powers of precision data, state-of-the-art technology, and security with unparalleled consumer reach to help individuals navigate today’s chaotic healthcare landscape. Headquartered in Philadelphia, PA, Quil is a joint venture of Comcast and Independence Health Group (Independence).\nWe are seeking an experienced Site Reliability Engineer to join our rapidly growing organization. In this role, the engineer will develop software solutions to operations problems, embedding in development teams, and perform operations work. The selected candidate will be responsible for building developer tooling, APIs, infrastructure, pipelines, testing, monitoring, and all other tooling necessary to ship high quality code in an Agile environment.\nAs a member of the Site Reliability Engineering team, you will:\nWrite software to automate the entire lifecycle of production microservices and the environments they run on\nTackle architectural challenges around highly available services and data\nEnsure our infrastructure and services are sufficiently observable\nContinue to learn and expand your knowledge and skill set\nYou have the skills to be successful in this role if you have:\nGenerally 5+ years of software development experience\nWriten code with empathy for the next person\nPrevious experience in operating production systems, ideally including node.js or JVM services\nBachelor of Science degree or greater in Computer Science, Electrical Engineering or another related field, or equivalent experience\nExperience in one or more of the following: node.js, Java, Python, Go, PHP or Ruby\nDesire to join a highly technical team in a fast-paced environment\nProven track record of ownership of maintainable, stable and scalable software\nExpertise managing AWS infrastructure\nGood understanding of continuous delivery\nGood understanding of Monitoring/Alerting tools and best practices\nIt is a plus if you have:\nRun Kubernetes in production\nFamiliarity with managing Kafka, Elastic Search, RDS, DynamoDB\nExperience with AWS Lambda\nContributed to existing open-source projects as well as your own\nExperience with Docker and/or Linux Containers\nExperience with Microservices/SOA\nExperience with HIPAA or SOC2\nPersonal Requirements:\nCuriosity and interest in investigating issues to reveal their root causes\nHave strong opinions that are loosely held\nWork constructively in a distributed team and collaborate effectively", "employment_type": "FULL_TIME", "date_posted": "2021-10-04T14:42:14.000Z"}, "company": {"name": "Quil", "link": "https://www.linkedin.com/company/quilhealth"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}