{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "EarlyBird OverviewEarlyBird is the simplest way for parents, family, and friends to collectively invest in a child’s financial future starting at the earliest age. Our focus is transforming financial gifting, making it personal, purposeful, and timeless, empowering future generations with financial freedom and the ability to change the world.IndustryFinancial TechnologyRobo-AdvisingJob Description 2 - 5 years industry experienceRequirements & TechnologiesAs a Software Developer at EarlyBird, you will have worked on projects that involve authentication, database design, and API integrations. Ideal candidates are comfortable touching various parts of a distributed system, as well as having intuition and opinions on how to improve and simplify a growing application.Build and promote high-quality, scalable, full-stack solutions in React NativeExperience with iOS and Android React Native applicationsDelight a diverse, global audience with elegant, intuitive experiences1-5 years of industry NodeJS experience in full time or internship rolesGraphQL and REST API's development experienceExperience with SQL databasesSome quantitative skills, knowledge or experience in finance is a plusYou are a self-starter, self-motivated, and able to work independentlySalary, Compensation, and BenefitsCompetitive compensation that includes equityFlexible time off policy to balance your work and lifeCompetitive medical, dental, and vision coverage for you and your dependentsCollaborative, transparent, and fun loving office cultureAn impactful organization with a purposeAbility to work from home and have flexible working hours.Please apply if you're excited about building a better financial future for the next generation and pushing our platform further. We look forward to seeing the unique perspective you will bring to our team!EarlyBird is an equal opportunity employer and values diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-18T14:03:58.000Z"
    },
    "company": {
        "name": "EarlyBird",
        "link": "https://www.linkedin.com/company/getearlybird"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "New York City Metropolitan Area",
        "region": null,
        "postal_code": "10021",
        "street_address": null,
        "latitude": 40.748295,
        "longitude": -73.98556
    }
}