{
    "job": {
        "title": "Data Center Engineer",
        "industry": "Staffing and Recruiting",
        "description": "Kelly IT is recruiting for a Data Center Engineer ( 6+ Months: Contract ) opportunity with a growing and dynamic company located in Montgomery, TX (On-site position – No remote)!  Requirements and Qualifications:Completed study (university) of electrical engineering or refrigeration engineering or constructional engineering or comparable education6 years of Data Center Engineering experienceMany years of professional experience or activity in the field of activity/area of responsibility also in an international or intercultural environmentMany years of consulting experience in strategic projects (e.g. in flexible organizations) and complex processesKnowledge in business administrationExperience in customer relationship managementExperience in the business processes of customersExperience in negotiations with customers at different management levelsExperience in technical managementCompetent knowledge in fields of high available power supply and secured cooling supply This position requires working on-site in Downers Grove, IL (no remote work) If you meet the qualifications please send your resume directly to: Miguel.Cruz@kellyit.com or, if you know of anyone who meets these qualifications and would like to take advantage of this great opportunity, please refer them to us!",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-09T20:19:58.000Z"
    },
    "company": {
        "name": "Kelly | IT Resources",
        "link": "https://www.linkedin.com/company/kelly-it-resources"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Montgomery",
        "region": "TX",
        "postal_code": "77356",
        "street_address": null,
        "latitude": 30.403498,
        "longitude": -95.677765
    }
}