{"location": {"country": "US", "locality": "New York", "region": "New York", "postal_code": "10132", "street_address": null, "latitude": 40.713047, "longitude": -74.00723}, "salary": {"currency": null, "min_value": null, "max_value": null, "unit": null}, "job": {"title": "Senior Software Engineer", "industry": "Information Technology and Services,Computer Software,Financial Services", "description": "At Northwestern Mutual, we are strong, innovative and growing. We invest in our people. We care and make a positive difference.\nNorthwestern Mutual is looking for an experienced engineer to help us build the next generation of financial planning tools for our clients. The role requires an agile engineering approach, the patience and persistence to tackle sophisticated problems, the ability to get things done quickly but thoughtfully, and outstanding technical skills.\nDo you enjoy reading tech blogs in your spare time? Is your meme game strong? Then we want to hear from you!\nWhat are we looking for?\n5+ years of professional experience\nExperience with Architecture Patterns and Engineering\nFamiliarity with DevOps, Automation, and Infrastructure\nEffective Communication: Easily explains concepts to both technical and non-technical audiences.\nTeamwork: Mentors fellow engineers and leads cross-team initiatives.\nAutonomy: Identifies problems and seeks solutions independently.\nOwnership: Takes pride in their craft and responsibility for issues that may arise.\nWhat would make you stand out?\nHands-on experience with JavaScript (Node, React), Java, or GraphQL\nExperience with Automation of CI/CD Pipelines\nFamiliarity with AWS (databases, storage, networking, CloudFront)\nAbility to Debug/Troubleshoot across Infrastructure as Code (Terraform)\nUnderstanding of Docker and Kubernetes\nKnowledge of Security Practices (Application Firewalls)\nWhy Northwestern Mutual?\nHighly competitive compensation, including annual bonus opportunities\nMedical/Dental/Vision plans, matching 401(k), pension programs\nTuition reimbursement, commuter plans, and paid time off\nExtensive professional training opportunities\nExcellent work/life balance\nHackathons/Commitment to innovation\nThis job is not covered by the existing Collective Bargaining Agreement.\nRequired Certifications\nGrow your career with a best-in-class company that puts our client’s interests at the center of all we do. Get started now!\nWe are an equal opportunity/affirmative action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender identity or expression, sexual orientation, national origin, disability, age or status as a protected veteran, or any other characteristic protected by law.\nFIND YOUR FUTURE\nWe’re excited about the potential people bring to Northwestern Mutual. You can grow your career here while enjoying first-class perks, benefits, and commitment to diversity and inclusion.", "employment_type": "FULL_TIME", "date_posted": "2021-07-31T07:13:59.000Z"}, "company": {"name": "Northwestern Mutual", "link": "https://www.linkedin.com/company/northwestern-mutual"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 60, "seniority_level": "Senior"}}