{
    "job": {
        "title": "Front-End Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Hospital &amp; Health Care",
        "description": "At ASM we build best-in-class products for health care administration and quality assurance. We use the latest technology to provide products to over 1,200 health care organizations worldwide. Founded in 1982 we have developed a great team to build great products.      What would I do at ASM?      Design with a fast, simple UI is one of the key selling points for our products. In this role, you will help build new features and products. You will primarily working in React building components for both our component library and user-facing applications. When necessary you will aid in designing and building APIs to connect to the front-end. You will need to rely on an understanding of visual design, UX, and front-end technologies to craft changes that have an impact.      Who is the ideal candidate?       You understand the importance of user experience and front-end technologies. You empathize with the struggles of end-users and advocate on their behalf. You get excited solving design challenges with other developers, building reusable components, and then continuing to improve those designs and components.      Responsibilities:     - Designing, implementing, and maintaining user interfaces for our web and mobile products from initial concepts through to the final product.   \n  - Conceptualize original ideas that bring simplicity and user friendliness to complex ideas   \n  - Improve and maintain our React and ASP.NET front-end components.   \n  - Connect our front-end components to the API and databases.         \nRequired Experience:     - Proficiency in HTML, CSS, and Javascript.   \n  - Experience with React JS   \n  - To care deeply about aesthetics and usability   \n  - A strong attention to detail   \n  - A solid understanding of layout, typography, color and other design principles         \nBonus experience:     - Familiarity with iOS and/or Android   \n  - Familiarity with GitHub and version control.   \n  - Familiarity with C# and/or ASP.NET   \n  - Familiarity with Angular JS   \n  - Healthcare Experience         \nWhy choose ASM?      We offer everything you'd expect from a successful and established software company.     - Every developer and designer has an SSD-enabled laptop, dual 24\" LED monitors, Sit/Stand Desks, Herman-Miller chairs.   \n  - Modern Technology - We stay up-to-date with the latest in our diverse technology stack.   \n  - Health, Dental, ,Vision, and 401k   \n  - Catered lunches on Friday.   \n  - Annual company Vegas trip.      \nPowered by JazzHR      MxhiLfqkRJ",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-17T07:00:23.000Z"
    },
    "company": {
        "name": "Applied Statistics &amp; Management Inc.",
        "link": "https://www.linkedin.com/company/applied-statistics-&amp;-management-inc."
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Temecula",
        "region": "CA",
        "postal_code": "92591",
        "street_address": null,
        "latitude": 33.4934,
        "longitude": -117.14879
    }
}