{"location": {"country": "US", "locality": "San Jose", "region": "San Jose", "postal_code": "95148", "street_address": null, "latitude": 37.334793, "longitude": -121.888145}, "salary": {"currency": "USD", "min_value": 120000, "max_value": 155000, "unit": "YEAR"}, "job": {"title": "Software Engineer", "industry": "Marketing and Advertising,Information Technology and Services,Computer Software", "description": "Our Company\nChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.\nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\nThe Opportunity\nDo you thrive on solving hard problems at scale? Do you want to build cloud-native systems that work seamlessly across devices? Are you interested in defining the future of marketing by making it fast, fun, and frictionless to create and deliver Marketing Campaigns? Most of all, are you passionate about helping enterprise improve user experience.\nWe are a team of passionate storytellers, technology innovators, and change agents. We build infrastructure to enable our clients in providing the best user experience to their customers. Building on success of Adobe Experience Platform, we provide solutions to build tools that allows them to reach and communicate with end-users\nWhat Will You Do\nBuild, Develop, Test & Deploy micro-services for Marketing tools\nDesign Services that scale horizontally, perform at high throughput and low latencies.\nParticipating in all aspects of software development activities, including design, coding, code review, unit/integration testing, bug fixing, and code/API documentation.\nWorking in cross-functional teams to ensure superb end-to-end user experience for customers.\nFast prototyping of ideas and concepts and researching latest industry trends.\nWhat You Need To Succeed\nBS + 4 yrs experience or MS + 2yrs experience in Computer Science or relevant field\nExperience building web services in Java/Scala, RESTful API's\nExperience in web server technologies: HTTP servers, .\nExperience working with streaming technologies like Kafka.\nExperience using NoSQL datastores, and data access patterns and strategies.\nExperience building highly scalable and performance focussed applications\nProven ability to develop robust, efficient, high-quality code.\nAbility to troubleshoot and resolve problems using appropriate tools and techniques.\nKnowledge of modern development patterns: Agile, CI/CD, Kubernetes, micro-services achitecture\nKnowledgeable of secure, scalable, and highly available service development practices.\nTeam player with a thirst to learn, sense of urgency, and ownership, and thrives in a fast-paced environment.\nExcellent written and verbal communication skills.\nAbility to learn quickly and adapt to changing priorities and requirements\nSelf-starter requiring minimal direction", "employment_type": "FULL_TIME", "date_posted": "2021-07-15T22:01:21.000Z"}, "company": {"name": "Adobe", "link": "https://www.linkedin.com/company/adobe"}, "education": {"required_credential": "bachelor degree"}, "experience": {"months_of_experience": 48, "seniority_level": "Mid-Level"}}