{
    "job": {
        "title": "Software Engineer ( C++ Developer)",
        "industry": "Internet",
        "description": "VISA SPONSORSHIP IS NOT AVAILABLEOur large, Fortune Technology client is ranked as one of the best companies to work with, in the world. The client fosters progressive culture, creativity, and a flexible work environment. They use cutting-edge technologies to keep themselves ahead of the curve. Diversity in all aspects is respected. Integrity, experience, honesty, people, humanity, and passion for excellence are some other adjectives that define this global technology leader.Remote role to start and once environment changes, the candidate will be located either in the Novi, MI office or the Provo, UT office.REQUIRED EDUCATION/EXPERIENCE5 to 7 years of software development experienceAbility to write professional code (clean &amp; good design)Strong experience with C++ language and related tooling (e.g. compilers, cross-platform, etc.)Experience working in an agile team, CI/CD with Jenkins and automated deploymentHigh attention to detailBS/MS in Computer Science/Engineering or a related fieldRESPONSIBILITIES:Design, build and maintain efficient, secure, reusable and reliable codeDevelop solutions that are portable across platformsApply continuous attention to technical excellence and good design, resulting in a straightforward solution and reducing complexityWrite test automation and help your team to deliver frequent incremental releases using CD pipelineHelp promote and drive sound engineering design, process and quality practicesTECHNOLOGIES WE USEC++, PythonWindows, Mac &amp; LinuxQTCMake, NugetJenkinsGit, GitHub, PerforceDESIRED QUALIFICATION:Experience with Python is a plusExperience building cross-platform Desktop/GUI applications on Windows/Linux/Mac (Example toolkits like Win32/MFC/.NET, Objective-C/Cocoa frameworks, Qt frameworks etc)",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-17T07:27:03.000Z"
    },
    "company": {
        "name": "Applicantz",
        "link": "https://www.linkedin.com/company/applicantz-ai"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "OccupationalExperienceRequirements"
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}