{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "JOB TYPE: Freelance, Contract Position - No agencies (See notes below)LOCATION: RemoteHOURLY RANGE: Our client is looking to pay $80 - $100 USD / HRESTIMATED DURATION: 40Hrs/Week - Long Term, 6-month projectHigh-level QualificationsMicroservicesUI DebuggingTroubleshooting VMAbout UsBraintrust (usebraintrust.com) is a user-controlled talent network, where you keep 100% of what you earn and actually get to own the platform. We've been onboarding some big clients and specifically need a SRE for our client.About Our ClientOur client is a leading global specialty retailer offering high-quality, on-trend clothing, accessories and personal care products at affordable prices. Our clients brand is built on more than 40 years of customer focus, dedication and innovation. Starting with one store in 1977, our brands have grown to more than 1,000 stores in the United States, Canada, Mexico, China and Hong Kong, and ship to over 80 countries worldwide through our websites and mobile applications. Our clients merchandise also is available at more than 200 international locations operated by licensees in 25 countries.The OpportunityProactively address potential stability / performance challenges that could impact site performanceServe as a primary point responsible for the overall health, performance, and capacity of services and infrastructure serving the website and Mobile appsOwn and run post SEV1 incident reviews and follow up fixes/changesSolve availability/performance problems and build software-based solutions to prevent re-occurrencesDesign and develop automation frameworks and test suites to enforce SRE techniques and toolsAnalyze and identify performance bottlenecks and make recommendationsImplement metrics, monitoring, incident response and capacity planning processesCollaborate closely with Developers/Solution Architects to ensure a designed solution responds to non-functional requirements such as availability, performance and maintainabilityCollaborate closely with Performance Engineering to review and understand Performance tests and resultsCollaborate closely with Monitoring and alerting teams to identify possible metrics within the application and ensure coverage acrossBuild Self-Service tools for the SRE and for other operations’ groups that automate the way out of manual toil of operationsBuild and maintain runbooks to troubleshoot applications, infrastructure and services that are in useDevelop tools to effectively monitor custom applications in a large-scale UNIX environmentTechnical Skills BS in Computer Science, Engineering, or related disciplineProven experience operating highly-automated, mission-critical 24/7 production systemsExperience understanding of full stack service/microservice based eCommerce applicationGood knowledge of client-side rendering, UI debugging tools, web performance measurementUnderstanding of an ecommerce framework/setupExperience troubleshooting VM issues (Node, Java) with the help of memory/heap dumpsExpertise in application, data and infrastructure architecture disciplinesFamiliarity with infrastructure components such as routers, load balancers, cloud products, container systems, compute, storage and networksStrong organizational, analytical and critical thinking skillsAbout The Hiring ProcessQualified candidates will be invited to do a screening interview with the Braintrust staff. We will answer your questions about the project, and our platform. If we determine it is the right fit for both parties, we'll invite you to join the platform and create a profile to apply directly for this project.C2C Candidates: This role is not available to C2C candidates working with an agency. If you are a professional contractor who has created an LLC/corp around their consulting practice, this is well aligned with Braintrust and we’d welcome your application.Braintrust values the multitude of talents and perspectives that a diverse workforce brings. All qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-16T16:58:13.000Z"
    },
    "company": {
        "name": "Braintrust",
        "link": "https://www.linkedin.com/company/usebraintrust"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}