{
    "job": {
        "title": "Software Escalation Engineer",
        "industry": "Computer Networking,Computer Software,Computer &amp; Network Security",
        "description": "DescriptionWhat We Do:Today the modern enterprise is an Enterprise of Things. We are on a mission to secure the Enterprise of Things with active defense by identifying, segmenting and enforcing compliance of every connected thing. In real time. And at scale. Our unified security platform enables enterprises and government agencies to focus on Zero Trust segmentation, IT/OT convergence and OT/ICS innovation, all supporting our mission and vision.Join us as we secure the world with our products. We are looking for resourceful and gritty individuals to collaborate as one team while ensuring a world-class customer experience. We are cyber-obsessed about addressing the world’s most challenging security problems. Innovation starts here, everyone’s ideas are valued, visionaries welcomed!What You Will DoIf you are a great developer with passion for security and technology, come join Forescout’s R&amp;D/Sustaining team of Software Engineers and take part in defining and driving the future world-wide market leading product suite consisting of: Network Access Control, Endpoint Compliance, Mobile Control, and Intrusion Prevention.Applications range from Client/Server applications to Web apps for a Network Access Control solution, running on both Windows and Linux systems.Duties involve analyzing customer escalation issues and to work with cross-functional teams (Development Engineering, Customer support and Account teams) to ensure smooth flow of information in resolving critical customer issuesProvide technical leadership on the team as neededDevelopment of new security features and maintenance of existing onesHandle the resolution of technical issues by doing the following:Analyze the available data to identify and narrow down root causeInvestigate the technical issueAttempt or drive reproduction of customer issue in houseDescribe in detail the issue to support engineers or customersIdentify and develop the software code changes to resolve it.Analyze and report defects on software to improve conformance, stability and supportabilityUnderstand customer network architecture and design and accordingly provide alternative solutions when applicable to achieve greater stability or performanceProvide technical leadership to internal teamsMentor other Engineers on techniques and methodologies of troubleshooting and supporting Forescout products and solutionsActively suggest and describe ways to improve the supportability of Forescout productsUse Kanban development methodology to deliver on tasksFamiliar with Atlassian tool set, including Jira, Confluence, etc.What You Bring To ForescoutMinimum of 5-10 years of experience in software development or sustaining engineering preferably in Network or Endpoint securityPast technical leadership experienceDeep knowledge of software engineering concepts and techniques.C/C++ experienceExperience in Java programmingPerl experienceLinux/Unix development experienceLinux system/environment experience (scripting languages, regular exp., awk, sed, etc.)Networking:Good understanding of TCP/IPKnowledge in protocols (DNS, SMTP, SNMP, DHCP, 802.1 x)Familiar with network equipment configuration (Switch, Router, Firewall)Windows-based networks, domain managementLow-level network monitoring and sniffing (Experience with sniffers)Personal SkillsStrong communication – both written and spokenAbility to easily learn and apply new technologiesPast technical leadership experienceExcels in team environmentsAbility/Experience in customer interactionsAbility to work independently when neededHighly motivated to succeed in current positionStrong sense of urgencyEducationBachelor’s degree in Computer Science or equivalent experienceWhat Forescout Offers YouCompetitive compensation and benefits – we cover 95% of employee and dependents’ benefits premiums (US only), 401K match, generous PTO policy, and much moreCollaborative and innovative environment – make an impact on worldwide security while working on the hottest technologyLeadership that supports and encourages professional growth and developmentWant a glimpse of Life @ Forescout? Check us out on Facebook and InstagramLearn more at: www.forescout.comForescout is proud to be an equal opportunity workplace dedicated to pursuing and hiring a diverse workforce.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T18:34:49.000Z"
    },
    "company": {
        "name": "Forescout Technologies Inc.",
        "link": "https://www.linkedin.com/company/forescout-technologies"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "OccupationalExperienceRequirements"
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Dallas",
        "region": "TX",
        "postal_code": "75342",
        "street_address": null,
        "latitude": 32.777977,
        "longitude": -96.79621
    }
}