{
    "job": {
        "title": "Clinical Trial Assistant",
        "industry": "Research",
        "description": "JOB DESCRIPTIONAs a Clinical Trial Assistant, you will be responsible for assisting Clinical Operations staff in the performance of their duties, and with administrative tasks related to the conduct and implementation of clinical trials.A DAY IN THE LIFEAdministrative tasksProviding assistance to CRAs, regulatory operations staff and/or CPMsUndergoing CRA training activitiesLogging, filing and copying of clinical regulatory and other documentsPreparing site initiation and monitoring materialsAssisting with maintenance of study tracking toolsAttendance at company meetings, completion of timesheets and documentation of trainingAssisting with other projects within the companyAdherence to Proxima or client Standard Operating Procedures (as applicable)Professionally represent Proxima in business interactionsMUST HAVE KNOWLEDGE AND SKILLSGood interpersonal skills.&nbsp;&nbsp;Good oral and written communication skills.&nbsp;&nbsp;Ability to articulate issues.&nbsp;&nbsp;Self-management skills, including the ability to multi-task.&nbsp;&nbsp;Attention to detail and accuracy in work.&nbsp;&nbsp;Keyboarding, word processing, and computer skills preferred.&nbsp;&nbsp;Ability to maintain confidentialityNICE TO HAVE KNOWLEDGE AND SKILLBA, BS or Associate’s degree or equivalent in a scientific or healthcare field preferred, but not required.&nbsp;&nbsp;Minimum high school degree required, relevant experience preferred.&nbsp;&nbsp;Familiarity with common medical terminology preferred.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:27:59.000Z"
    },
    "company": {
        "name": "Proxima Clinical Research, Inc.",
        "link": "https://www.linkedin.com/company/proxima-clinical-research"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Houston",
        "region": "TX",
        "postal_code": "77208",
        "street_address": null,
        "latitude": 29.760803,
        "longitude": -95.36951
    }
}