{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Services",
        "description": "&nbsp;Job Tittle:- Site Reliability EngineerJob Location:- Alpharetta, GA.Job Type: Long term&nbsp;Contract &nbsp;&nbsp;&nbsp;&nbsp;Responsibilities: &nbsp;&nbsp;&nbsp;• Run the production environment by monitoring availability and taking a holistic view of system health • Manage platform infrastructure and applications • Improve reliability, quality, and time-to-market of our suite of software solutions • Measure and optimize system performance. • Provide primary operational support and engineering for multiple large distributed software applications&nbsp;&nbsp;&nbsp;Requirements: &nbsp;&nbsp;&nbsp;• Deploy software artifacts to Development, QA, Integration, UAT, Staging, Load and Production environments • Configure and troubleshoot software runtime environment, provide development support and Incident support • Lead the rollout, enforcement and continuous improvement of team and enterprise standards • Configuring Continuous Integration and/or Continuous Delivery pipelines • Use continuous Integration tools: Jenkins, Sonar, Ant, Maven, Nexus, Rundeck, CHEF, Sonar • Use of code repository tools like GIT • Contribute to the design and implementation of our configuration management software architecture • Design and implementation of tools to streamline SCM, Integration and QA processes • Define, implement and champion policies to significantly increase the efficiency of our software development/delivery process • Ensure Continuous Integration and Delivery through SDLC. Work with Development, QA and Operations to guarantee prompt, accurate, and repeatable delivery of the builds • Provide up-to-date and accurate documentation on the SCM environment and Process Automation tools • Work closely with Development and Quality Engineering teams • Experience in one of the clouds (Azure/GCP/AWS). • Experience in Java based application deployment on application servers like WebSphere and tomcat. • Experience I vulnerability management and applying software patches • UAT/Production deployments • Experience with Agile practices § Good team player and coordination skills • Candidate should be a Green Card Holder or a US Citizen&nbsp;&nbsp;Regards&nbsp;Kajal&nbsp;IT Recruiter&nbsp;+1.307-316-7195 |Kajalsaini@noralogic.com|www.noralogic.com&nbsp;Noralogic&nbsp;| 109 E 17th&nbsp;St, Cheyenne WY 82001&nbsp;USA: WY, MD, NJ&nbsp;Mexico: Guadalajara, Monterrey&nbsp;India: Noida UP&nbsp;**WBE and MBE company**&nbsp;** ISO 9001:2015**&nbsp;**WY Top 50 Minority owned growing company**&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-17T19:18:15.000Z"
    },
    "company": {
        "name": "Noralogic Inc",
        "link": "https://sj.linkedin.com/company/noralogic-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Alpharetta",
        "region": "GA",
        "postal_code": "30022",
        "street_address": null,
        "latitude": 34.075615,
        "longitude": -84.29455
    }
}