{
    "job": {
        "title": "Sr. Software Engineer",
        "industry": "Pharmaceuticals,Biotechnology",
        "description": "2120- Certara is hiring an Product Manager to support our Software Division! This position can be based out of any of our US offices, or full time remote.At Certara, we accelerate medicines to patients by partnering with life science innovators. Our Integrated And Proprietary End-to-end Platform With Biosimulation, Regulatory Science, And Market Access Solutions Combined With Our Strong Team Of Scientists And Subject Matter Experts Enable Our Clients To HaveIn the past 6 years, over 90% of companies that received new drug approvals by the FDA used our software or services.informed decision-making &amp; reduced clinical trial burdenhigher R&amp;D productivityimproved patient outcomes &amp; increased patient access to medicinesaccelerated regulatory approvalCertara is a global team that fosters and nurtures a diverse and inclusive culture. We are proud to be an Equal Opportunity Employer. The collective sum of our individual differences, life experiences, knowledge, innovation, self-expression, and unique capabilities and talent represents a significant part of our culture, our reputation and our achievement.Together with our partners, we use biosimulation and technology-enabled services to transform drug discovery and development across all therapeutic areas and innovative therapies.ResponsibilitiesParticipate in the definition, design, coding, testing and debugging of software platform/products/toolkits, either new or existing.Support the implementation of new and improvements to current software development processes and technologies.Conduct feasibility of proposed designs to determine their ability to function as intended.Write and maintain documentation throughout all phases of software developmentContribute to software architecture designParticipate in code reviews, scrum-related meetings and standups on a daily basisInteract with development team members (both Certara employees and contractors) on project scope, activities, timeline and risks.Mentor and coach team members on software development best practices and standardsQualificationsEducation, Experience, Training, and Knowledge:BS or MS in Computer Science or similar engineering discipline, or equivalent experience.10+ years of software development experience, including software analysis, design, and delivery with a focus on Microsoft technologies, including desktop, web-based, and client-server applications5+ years w/ Relational Database Experience5+ year JavaScript5+ year Typescript5+ Year Angular 5 or greater, experience with the latest Angular versions Experience leading a team, on shore or off shore Experience with NPM and Angular CLI in building Angular applicationsExperience with Cloud TechnologiesExperience with Unit Test TechnologiesUnderstanding of SOLID PrinciplesRequires knowledge of and/or experience with Clean CodePreferable knowledge of and/or experience with Test Driven DevelopmentMust be self-thinker able to build solutions from general requirements without exacting specificationsProven knowledge and experience in agile development methodologies, techniques, and approachesExperience developing scientific/statistical software is preferredExcellent experience in SDLC Methodologies, Agile, SCRUM, SDLC / WaterfallSkills &amp; AbilitiesExcellent communication skills (written and verbal)Excellent analysis, trouble-shooting and debugging skillsStrong critical thinking, problem solving, planning and organizing, and decision-making skillsFamiliarity with reporting requirements for Clinical/Pre-Clinical Pharmacology, DMPK, or Clinical/Preclinical Pharmacokinetics departmentsFamiliarity with various operating systemsRequired:C#NET Core 2.0Relational Database Experience (Oracle, MS SQL Server, MySQL, etc)LINQRESTAngular 5+Angular CLITypescriptJavascriptHTML, CSS, (LESS, SASS)Karma/JasmineNPMNode.jsAWS Lambda functionsWriting Unit Tests (.NET &amp; angular or typescript)Visual StudioGIT (github)Nice to have:AWS Elastic BeanstalkAWS RDSAWS S3AWS EC2Docker (for local development)Docker (for production role out)Visual Studio CodeJenkinsPowershellSonarCubePerforceCertara bases all employment-related decision on merit, taking into consideration qualifications, skills, achievement, and performance. We treat all applicants and employees without regard to personal characteristics such as race, color, ethnicity, religion, sex, sexual orientation, age, nationality, marital status, pregnancy, physical or mental condition, genetic information, military service, or other characteristic protected by law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T05:37:29.000Z"
    },
    "company": {
        "name": "Certara",
        "link": "https://www.linkedin.com/company/certara"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": "OccupationalExperienceRequirements"
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Gaithersburg",
        "region": "MD",
        "postal_code": "20884",
        "street_address": null,
        "latitude": 39.142185,
        "longitude": -77.193405
    }
}