{
    "job": {
        "title": "UX Researcher",
        "industry": "Health, Wellness and Fitness",
        "description": "UX ResearcherPalo Alto, CA, United StatesAbout Yo Labs:Technology has changed daily life in a way no one could have imagined.&nbsp;It’s made us more productive, capable and connected.&nbsp;But it has come at a cost.&nbsp;We’re productive, but overwhelmed.&nbsp;Capable but paralyzed by too many choices.&nbsp;Connected, but only if social media counts.&nbsp;Living this way creates a void in our daily lives.&nbsp;Yo Labs is here to change that.&nbsp;Our team is committed to alleviating the mental load that our modern world has created by putting human connection back into technology and caretaking at the heart of everything we create.About the Role:As a UX Researcher, you will work closely with designers, engineers, and product managers to build new mobile apps and services. In this role, you will create understanding and empathy around user needs, stated and unstated. Your research will help us create useful, usable, and delightful new products and features for our users. This role will start out mainly focused on usability testing across multiple products with multiple user types, but there will be opportunities to take on different types of research projects and collaborate with more experienced UXRs.&nbsp;Responsibilities&nbsp;Support the evaluative research (i.e., usability testing, heuristic evaluations, etc.) needs of multiple product teamsWork with designers, engineers, and product managers to identify and prioritize research opportunities in a fast-paced, rapidly changing environmentPlan and execute research studies end-to-end, including designing the study, recruiting participants, moderating interviews, analyzing data, and reporting resultsAdvocate research findings to diverse audiences through written reports and in-person presentationsRequirementsBA/BS degree in Anthropology, Human-Computer Interaction (HCI), Human Factors, Psychology, Sociology, or a related field, or equivalent practical experiencePreferred, but not required: Master's degree in a related field1-3 years of relevant work experience in an applied research setting and/or product research and developmentExperience conducting evaluative research and ability to demonstrate the impact of their research insightsUnderstanding of UI/UX best practices and user-centered designUnderstanding of the strengths and shortcomings of different research methods, including when and how to apply them during the product development process&nbsp;Nice to haveDemonstrated experience with other research methods, including but not limited to ethnographic research, contextual inquiry, diary studies, surveys, etc.Familiarity with analytics, a/b tests, or statistical conceptsProficiency with FigmaWhat We Offer:Competitive compensation packageComprehensive benefitsPet InsurancePaid Parental Care LeaveEmployee Referral ProgramEducational AssistanceFlexible Work ProgramVolunteer time OffTotal Well Being Program",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-22T01:26:42.000Z"
    },
    "company": {
        "name": "Yo Labs",
        "link": "https://www.linkedin.com/company/yo-labs"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "OccupationalExperienceRequirements"
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Palo Alto",
        "region": "CA",
        "postal_code": "94310",
        "street_address": null,
        "latitude": 37.445103,
        "longitude": -122.16036
    }
}