{
    "job": {
        "title": "Software Engineer I",
        "industry": "Medical Devices,Hospital &amp; Health Care,Pharmaceuticals",
        "description": "Careers that Change LivesIn this exciting role you will provide services to support the Software Development and Information Technology Operations of safety critical software for medical devices which over 400,000 people depend on each day.A career at Medtronic is like no other. We’re purposeful. We’re committed. And we’re driven by our Mission to alleviate pain, restore health and extend life for millions of people worldwide.A Day in the LifePartners with development teams to establish the file structure of the project Source Control librariesEnsures all project source materials are maintained in the Source Control library including software source code and project documentationAdministers the Source Control tool providing maintenance and troubleshootingPartners with development teams and System Administrators in the establishment of project environments, including, define and document project environment requirements, project servers set up, and deployment of project &amp; 3rd party softwareDocument, schedule, and executes project software builds.Document SCM Plans, Release and Build ProceduresPrepares, reviews, submits, maintains and provides status on project/product documentationPerforms and documents software builds using existing build procedures and scripts Supports analysis of build data to report and communicate software build results (status, errors. etc.) Writes basic scripts (e.g., support build, test, static analysis) and maintain more complex scriptsPerforms validation activities of software development toolsGathers required metrics and generates/provides reports as directed Integrates verification tools into build process under direction of engineersResponsibilities may include the following and other duties may be assignedDesigns, develops, tests, debugs and implements operating systems components, software tools and utilities.Determines systems software design requirements.Ensures that system improvements are successfully implemented and monitored to increase efficiency.Generates systems software engineering policies, standards and procedures.Must Have: Minimum RequirementsBachelor’s degree in Engineering or Sciences Nice to HaveExperience on a variety of DevOps toolsets (IAR, Surround, GIT, Integrity PLM, etc)Strong knowledge of configuration management industry standards and best practicesKnowledge of Software Development Life Cycle (SDLC) Experience in specifying and implementing DevOps solutions with IT to support distributed software teamsSignificant experience and success in development of scripts and applications to facilitate automation of software builds and releases Expert knowledge of the underlying concepts of Branching, Merging, and Archiving software throughout the development lifecycleIn depth knowledge of software configuration management processes and practices. Applies knowledge of the software development environment (from end user perspective) to ensure usability of SCM processesExperience creating application specific documentation and ensure dependencies and compatibilities through appropriate verificationSolution orientated, generates multiple innovative solutions to complex or criticalAbout MedtronicTogether, we can change healthcare worldwide. At Medtronic, we push the limits of what technology, therapies and services can do to help alleviate pain, restore health and extend life. We challenge ourselves and each other to make tomorrow better than yesterday. It is what makes this an exciting and rewarding place to be.We want to accelerate and advance our ability to create meaningful innovations - but we will only succeed with the right people on our team. Let’s work together to address universal healthcare needs and improve patients’ lives. Help us shape the future.Physical Job RequirementsThe physical demands described within the Responsibilities section of this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. For Office Roles: While performing the duties of this job, the employee is regularly required to be independently mobile. The employee is also required to interact with a computer, and communicate with peers and co-workers. Contact your manager or local HR to understand the Work Conditions and Physical requirements that may be specific to each role. (ADA-United States of America)Additional Information Posting Date: Sep 2, 2021  Travel: No",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-03T14:40:36.000Z"
    },
    "company": {
        "name": "Medtronic",
        "link": "https://www.linkedin.com/company/medtronic"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Northridge",
        "region": "CA",
        "postal_code": "91330",
        "street_address": null,
        "latitude": 34.24326,
        "longitude": -118.532364
    }
}