{
    "job": {
        "title": "Software Engineer",
        "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
        "description": "Who We Are2K develops and publishes interactive entertainment globally for console systems, handheld gaming devices and personal computers, including smartphones and tablets. 2K is a leading publisher of today’s most popular gaming genres and most well-known for critically acclaimed game franchises like NBA 2K, WWE 2K, BioShock, Borderlands, Evolve, XCOM and the beloved Sid Meier’s Civilization.Mass Media is the premier engineering group for 2K Publishing’s Global Services. Since 1995, we’ve developed deep and multifaceted engineering expertise in video games. Whether it's platform optimization, multiplayer/networking, rendering, console certification, tools and pipelines – we’ve done it all!Because we're part of Global Services Technology, we're at the heart of all our games. We provide the engineering to support the matrix of platforms and storefronts of today, innovative technical solutions to the problems of tomorrow, and connective tissue across 2K's studios! In short, when some of the best studios in the world have needs, we can answer the call.What We NeedWe are looking for a passionate software engineer who has a high bar for the quality of their code as well as a desire to make outstanding games. In this role you will collaborate with fellow engineers and producers to address a wide variety of engineering challenges such as online multiplayer, performance optimization, and console porting. If you're looking to expand your skill set, push your limits in taking on the toughest problems that no one else wants to tackle, and get your hands on some exceptional IP, then this is right position for you.What You'll DoBe involved with multiple projects at the same timeCraft and develop data and code following mentorship from programming leadsWork independently to implement new in game functionality Quickly adapt to new coding environments and programming standardsCollaborate with other programmers to write code, fix bugs, and implement new featuresAnalyze game performance and implement optimizations in both high and low-level code to compensateDesign and build standalone tools as needed to assist project developmentHelp design and implement code for multi-processor environmentsWork with other team members to implement complex systemsWork with teams in other companies to help them deliver finished productsRequired Experience And Skills4+ years advanced programming in C/C++2+ years scripting languages (C#, Lua, Perl, Python)2+ years console development (Nintendo, Sony, Xbox) 3+ years analytics/debugging (PIX, RAD, Visual Studio)Shipped one or more AAA titles in a mid-level roleProven familiarity with 3D math, audio processing, graphics and physicsFamiliarity with AI, data manipulation, file systems, networking, streamingAbility to manage large codebases with multiple branchesAbility to quickly locate, replicate, and fix taxing bugsAbility to work well in limited resource environmentsAwesome communication, documentation, and organizational skillsBonus QualificationsPassionate video game enthusiastAudio experience (Fabric, FMOD, Wwise)Engine experience (CryEngine, Unity, Unreal Engine)Physics experience (Bullet, Havok, PhysX)Source control experience (GitHub, Perforce, SVN)Post-secondary degree/diploma in computer science2+ years professional development in a related field",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-13T15:57:26.000Z"
    },
    "company": {
        "name": "2K",
        "link": "https://www.linkedin.com/company/2k-games"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "OccupationalExperienceRequirements"
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Moorpark",
        "region": "CA",
        "postal_code": "93020",
        "street_address": null,
        "latitude": 34.285404,
        "longitude": -118.88088
    }
}