{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "The purpose&nbsp;&amp;&nbsp;responsibilities of the role&nbsp;include:&nbsp;Design, develop,&nbsp;debug,&nbsp;and maintain&nbsp;web-based&nbsp;applications written in Python.&nbsp;Be involved and participate in the overall application lifecycle for software applications&nbsp;supporting our Process Development department (including High-throughput screening, Analytics, Fermentation,&nbsp;Biocatalysis, and Downstream processing).&nbsp;Collaborate with&nbsp;scientists and front-end developers&nbsp;Discuss technical and design requirements with manager and end-users&nbsp;Provide training, help,&nbsp;and support to other team members&nbsp;Build high-quality reusable code that can be used in the future&nbsp;Troubleshoot and debug applications&nbsp;Learn about new&nbsp;technologies&nbsp;&nbsp;Requirements:&nbsp;Candidate should have&nbsp;at least&nbsp;a master's, preferably in Software Engineering, or a degree in a quantitative discipline such as computer science, mathematics, computational biology, electrical engineering, bioengineering or equivalent.&nbsp;Industry experience is a plus, but not required.&nbsp;Biology exposes a plus, but not required.&nbsp;Experience with programming best practices (unit testing, CI/CD, etc.) and version control while contributing to or maintaining large codebases&nbsp;Expertise with scripting programming languages (Python is&nbsp;strongly&nbsp;preferred)&nbsp;English (spoken, written) is required&nbsp;Chinese&nbsp;(spoken&nbsp;or&nbsp;written)&nbsp;is a plus&nbsp;Candidates must be willing to locate near our facilities in either Lafayette,&nbsp;California, or Hangzhou, China.&nbsp;We are open to a hybrid work model.&nbsp;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-29T18:47:03.000Z"
    },
    "company": {
        "name": "Bota Biosciences",
        "link": "https://www.linkedin.com/company/botabio"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Lafayette",
        "region": "CA",
        "postal_code": "94549",
        "street_address": null,
        "latitude": 37.890797,
        "longitude": -122.12747
    }
}