{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Health, Wellness and Fitness",
        "description": "Site Reliability Engineer (SRE)Palo Alto, CA, United StatesAbout Yo Labs:Technology has changed daily life in a way no one could have imagined.&nbsp;It’s made us more productive, capable and connected.&nbsp;But it has come at a cost.&nbsp;We’re productive, but overwhelmed.&nbsp;Capable but paralyzed by too many choices.&nbsp;Connected, but only if social media counts.&nbsp;Living this way creates a void in our daily lives.&nbsp;Yo Labs is here to change that.&nbsp;Our team is committed to alleviating the mental load that our modern world has created by putting human connection back into technology and care-taking at the heart of everything we create.As part of a growing team, you will work on various aspects of the tooling and infrastructure, including security and identity, kubernetes clusters, CI/CD systems, services federation, mesh technologies.&nbsp;Job Duties:Design and build tooling, automation, and services that enable productivity across the entire organization.&nbsp;Improve security posture of the organization by way of tooling, policy, example code, and publishing best practices.&nbsp;Design and automate lifecycle for cloud resources including EKS/Kubernetes, VMs, IoT Core, IAM users/roles, etc…&nbsp;Design and implement observability solution enabling developers self service debugging and alerting capabilities.&nbsp;Dive and support our IDP and SSO solution from corp network into cloud/production systems.&nbsp;Help to manage CI/CD systems, tooling, and general automation.&nbsp;Define, build, and evangelize best practices for a kubernetes based architecture.&nbsp;&nbsp;Qualifications:BA/BS degree or equivalent experience10+ or more years of system and site reliability engineering experienceKnowledge of the primary AWS services (EC2, ELB, RDS, Route53 &amp; S3)Knowledge of IDPs such as Google’s G-Suite and OktaFirst hand experience kubernetes running in AWSExperience deploying microservices using an envoy based meshLeading highly-available and fault-tolerant enterprise and web-scale software deploymentsInfrastructure automation through code and general scripting (E.g. go, bash, python)Configuration management using TerraformStrong practical Linux systems administration skills in a cloud and containerized environmentExperience managing cloud operations, including data assurance, monitoring, alerting and notificationsDemonstrated ability to think strategically about business, product, and technical challengesExperience leading discussions across teams regarding trade-offs, best practices, and risk mitigation.What We Offer:Competitive compensation packageComprehensive benefitsPet InsurancePaid Parental Care LeaveEmployee Referral ProgramEducational AssistanceFlexible Work ProgramVolunteer time OffTotal Well Being Program",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-04T06:20:37.000Z"
    },
    "company": {
        "name": "Yo Labs",
        "link": "https://www.linkedin.com/company/yo-labs"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Palo Alto",
        "region": "CA",
        "postal_code": "94310",
        "street_address": null,
        "latitude": 37.445103,
        "longitude": -122.16036
    }
}