{
    "job": {
        "title": "Data Scientist",
        "industry": "",
        "description": "Turnt Gaming&nbsp;is a technology company that is changing how the world plays games. Combining blockchain based gaming with live entertainment, we believe the combination of gaming and live interaction is the next entertainment revolution. &nbsp;As a company, we are looking for dreamers who think big. We want people passionate about blockchain and how it can affect gaming. We want people who are ambitious and want to build something meaningful and cutting edge.&nbsp;The ideal candidate's favorite words are learning, data, scale, and agility. You will leverage your strong collaboration skills and ability to extract valuable insights from highly complex data sets to ask the right questions and find the right answers.&nbsp;&nbsp;ResponsibilitiesAnalyze raw data: assessing quality, cleansing, structuring for downstream processingSpearhead the creation of game economy, leveling systems, game mechanics, and blockchain tokenomicsDesign accurate and scalable prediction algorithmsBuild machine learning/AI based data feeds for live prediction platformsCollaborate with engineering team to bring  prototypes to productionSetup up reporting tools and structure forGenerate actionable insights for business improvementsQualificationsBachelor's degree or equivalent experience in quantative field (Statistics, Mathematics, Computer Science, Engineering, etc.)At least 5 years' of experience in quantitative analytics or data modelingDeep understanding of predictive modeling, machine-learning, clustering and classification techniques, and algorithmsUnderstanding of decision tree modeling and game theory Fluency in a programming language (Python, C,C++, Java, SQL)Familiarity with Big Data frameworks and visualization toolsExperience with game economy or block chain economics preferred",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T06:25:30.000Z"
    },
    "company": {
        "name": "Turnt Gaming ",
        "link": "https://www.linkedin.com/company/turnt-gaming"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "OccupationalExperienceRequirements"
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Greater Seattle Area",
        "region": null,
        "postal_code": "98109",
        "street_address": null,
        "latitude": 47.591396,
        "longitude": -122.33279
    }
}