{
    "job": {
        "title": "Senior Software Engineer",
        "industry": "Staffing and Recruiting",
        "description": "Job DescriptionA leading loan provider and engineering distribution center in Florida is looking to scale up, these guys are on the cutting edge of loan distrubiton. More specifically, provide loan engineering systems for mortgage lenders.A strong engineer will have experience in C#, Asp.netCore, Web API, Restful web services, Javascript, angular2+ , React, Azure, and SQL. You will be working on a core usage, analytics, and loaning web application.Required Skills &amp; ExperienceC#Asp.netCore or MVCJavaScriptAzure or SQLDesired Skills &amp; ExperienceWeb API Building, not consumingRestful web servicesBS in CSAngular2+ or React What You Will Be DoingTech Breakdown0% Red Hat Linux100% Windows Server 2010Daily Responsibilities90% Hands On0% Management Duties10% Team CollaborationThe OfferCompetitive Salary: Up to $170K/year, DOEYou Will Receive The Following BenefitsMedical Insurance &amp; Health Savings Account (HSA)401(k)Paid Sick Time LeavePre-tax Commuter BenefitApplicants must be currently authorized to work in the United States on a full-time basis now and in the future.This position does not offer sponsorship.Jobspring Partners, part of the Motion Recruitment network, provides IT Staffing Solutions (Contract, Contract-to-Hire, and Direct Hire) across 10 major North American markets. Our unique expertise in today’s highest demand tech skill sets, paired with our deep networks and knowledge of our local technology markets, results in an exemplary track record with candidates and clients.Posted By: Brendan McLean",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-08T03:21:44.000Z"
    },
    "company": {
        "name": "Motion Recruitment",
        "link": "https://www.linkedin.com/company/motion-recruitment-partners"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Wildwood",
        "region": "FL",
        "postal_code": "34785",
        "street_address": null,
        "latitude": 28.8609,
        "longitude": -82.041794
    }
}