{
    "job": {
        "title": "Senior Software Engineer",
        "industry": "Maritime",
        "description": "Required SkillsBachelor's degree in Computer Science, Math, Physics, Engineering, or similar fieldProficiency and minimum 10 years of programming experience in C#. NET with WPF, must be recent experienceProficiency working with Visual Studio&nbsp;Proficiency working with both relational &amp; non-relational databases (SQL server and MongoDB)Proficiency with several development tool chains and Integrated Development EnvironmentsExperience interfacing with APIs (including REST)Proficiency using Windows operating systems and familiarity with embedded systemsExperience with Agile design process and using tools like JiraExperience with version control software (e.g. Bitbucket)Experience with test frameworks and continuous integration processes such as Jenkins and Circle CIStrong written and oral communication skillsOrganized, detail-oriented and pro-activeSelf-starter with previous engineering team experience, positive attitude who can work with little supervisionDesired SkillsPrevious development experience in industrial systems, autonomous control, automation or roboticsFront-end web/javascript/mobile experienceFront-end React Native, TypeScript experienceExperience with Nautical industry and chartingExperience with Linux systemsFamiliarity with basic electronicsOur client is a well-established startup, and the leader in pioneering autonomous control and advanced perception systems for the maritime industry. The company is looking to hire The Software Developer/Engineer to design, develop, test, and integrate software algorithms, applications, APIs, and graphical user interfaces for autonomous and unmanned surface vessel control &amp; monitoring systems.&nbsp;Few facts about our clientSpecializing in Autonomous control and Navigation Systems for boats and ships&nbsp;Raised $20M in funding in 2020Opened waterfront Boston; Hamburg, Germany; and Esbjerg, Denmark, officesReceived class and regulatory approval of wireless helm system for U.S. - flagged ATBsEstablished a global dealer program to sell productsJob DescriptionThe successful candidate will become a critical member of our technical team involved with all aspects of control system development for remotely operated and autonomous vessels. The software developer/engineer leads module-level design and development tasks with no supervision, conducts QA/QC testing at all phases of integration, and assists with system-level testing, trialing, and verification.This position reports to the User Interface Engineering Team Lead.ResponsibilitiesParticipate as a multidisciplinary engineering team memberDesign, develop, test, and integrate Microsoft Windows and web-based ApplicationsDesign, develop, test, and integrate graphical cross-platform user interface applicationsMaintain software documentation and assist in the development of user documentationParticipate in field testing on the boatsInterface with electrical engineers, control engineers, web engineers, and mechanical engineersThe candidate must be eligible to work in the United States – U.S. citizen or Green card holder.This position is based in Boston, MA. Occasional travel may be required to participate in cross-team design reviews and testing on the vessel.About Employa:Apply to this position with Employa and get brand new hiring experienceEmploya is a smart recruiting assistant that connects tech talents with the best employers to make the hiring process fast and easy for both sides. Employa AI driven engines eliminate biases and limitations of human-to-human interaction, so candidates can always make sure that their CVs will be delivered, considered and evaluated properly. It also enables candidates to track the hiring progress and improve their ranking for the position by answering additional questions from the potential employer.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T17:16:13.000Z"
    },
    "company": {
        "name": "Employa",
        "link": "https://www.linkedin.com/company/employa-llc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Massachusetts",
        "region": "United States",
        "postal_code": "01721",
        "street_address": null,
        "latitude": 42.172356,
        "longitude": -71.605
    }
}