{
    "job": {
        "title": "Machine Learning/Data Engineer-REMOTE",
        "industry": "Information Technology and Services,Computer Software",
        "description": "This AI Computer Software company located in Palo Alto, CA is looking to hire a sharp Machine Learning/Data Engineer to join their growing companyThis Jobot Job is hosted by Taylor BuckelewAre you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.Salary $135,000 - $170,000 per yearA Bit About UsLocated in the beautiful Palo Alto, CA we are the leading provider of AI- powered software products that transform healthcare claims and payment operations. Our platform has enabled us to develop and deploy, at high speed, industry-specific products.We are looking to hire a strong Machine Learning/Data Engineer to own out data ingestion and transformation process. You will ultimately own the data and make them available within the Data Science organization as well.Why join us?We offer a comprehensive compensation package including but not limited to A competitive base salary ranging from $135K-$165K (DOE) + EQUITY! 401kBenefits Health, Dental, VisionCollaborative teamTrainingsPaid time offParties and team building eventsJob DetailsYou will be responsible for and MUST have most or ALL of the followingHands-on experience with Machine Learning Data Engineering in either a lead developer or a management roleSQL proficiency is a MUSTExperience managing the delivery of complex dataExperience with cloud-based services and enterprise software environmentsStrong data technical backgroundFamiliarity with frameworks and protocols for data transfer, data consumption and data manipulationAbility to balance trade offs among multiple competing prioritiesExperience with Machine Learning pipelines, Big DataPLUS, not required if candidate has worked with medical records beforeIF INTERESTED, APPLY DIRECTLY HERE OR EMAIL ME A RESUME AT taylor.buckelew@jobot.comInterested in hearing more? Easy Apply now by clicking the \"Apply\" button.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T21:26:00.000Z"
    },
    "company": {
        "name": "Jobot",
        "link": "https://www.linkedin.com/company/jobot"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}