{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Staffing and Recruiting",
        "description": "Site Reliability Engineer IDR’s largest client is seeking a Site Reliability Engineer to join its growing team in the Atlanta, GA area! The Site Reliability Engineer will be responsible for improving the efficiency of the infrastructure and its associated applications.This person must be local to the Atlanta area.&nbsp;Responsibilities of the Site Reliability Engineer:Oversees the administration of business-critical cloud-delivered systems and servicesWorks with the systems and network administrators to develop, maintain, and improve the efficiency and reliability of infrastructure and applicationsUse configuration management tools to automate the deployment of new systemsIncrease the efficiency of existing applications, measure and optimize system performanceEnsure that requests and incidents are accurately documented, escalated, and resolvedCoach and lead Junior members of the team. Required Skills/Experience of the Site Reliability Engineer:Experience with container technology such as Docker, LXC, etc. (Must Have)Hands-on technical expertise with one or more cloud platforms is requiredExperience with shell scripting (BASH, PowerShell, etc.)Experience working with public and private cloud platforms (e.g., AWS, Google Cloud Platform, Microsoft Azure, Nutanix, etc.)Strong experience in at least one relational database platform such as MS SQL Server (preferred), MySQL, or OracleWhat’s In It for You?Join a flexible, friendly, laid-back work environmentEnjoy extremely competitive compensation and benefits packageEnjoy true work/life balanceJoin an extremely secure organization that offers job stabilityAdvance your career by joining an organization that believes in promoting from withinWhy IDR?20+ Years of Proven Industry Experience in 4 major marketsEmployee Stock Ownership ProgramDedicated Engagement Manager who is committed to you and your successMedical, Dental, Vision, and Life Insurance",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T12:18:28.000Z"
    },
    "company": {
        "name": "IDR, Inc.",
        "link": "https://www.linkedin.com/company/idr-inc-_2"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Atlanta",
        "region": "GA",
        "postal_code": "30355",
        "street_address": null,
        "latitude": 33.748547,
        "longitude": -84.3915
    }
}