{
    "job": {
        "title": "Junior Software Engineer",
        "industry": "",
        "description": "Brilliant Solutions is currently seeking a motivated and customer oriented Software Engineer to join our team in Springfield Virginia.The engineer will work on a team that provides research, technical guidance, testing, documenting and delivering unique solutions to meet the client's mission. You will have the opportunity to use your critical thinking skills to come up with intuitive designs and visualizations.Experience:&nbsp;Minimum 2+ years of&nbsp;knowledge and hands on.&nbsp;Positions Available:&nbsp;1&nbsp;Desired Certification:&nbsp;DoD 8570.1 IAT Level II&nbsp;&nbsp;Responsibilities:&nbsp;Must have&nbsp;Software Development hands on experience.&nbsp;Assist senior developer in the integration of existing software into new or modified systems or operating environments.&nbsp;Includes assistance on&nbsp;application development, code review and&nbsp;analysis&nbsp;security assessments of various COTS&nbsp;and&nbsp;GOTS&nbsp;applications.&nbsp;Implement automation tasks for server workloads such as writing back-end processes, ANSIBLE playbooks, BASH or PYTHON scripts.&nbsp;Opportunity to tackle complex infrastructure, security and development problem sets.&nbsp;Developing and automating repeatable tasks.&nbsp;Maintain system security and execute common practices/procedures; monitor usage statistics and logs; monitors and remedies&nbsp;attempt&nbsp;to penetrate or corrupt server files.&nbsp;Maintain baseline configurations and performs modification of configuration settings and automation solutions.&nbsp;Qualifications:&nbsp;Assist senior engineers in the design, implementation, and administration of platform tools&nbsp;&nbsp;Familiarity with software products with tools such as Ansible, Terraform etc.&nbsp;Experience with container configurations and services, especially Docker.&nbsp;Experience in collaborative software development using version control systems&nbsp;At least two years of professional experience in languages such&nbsp;Python, Rust and/or&nbsp;Go. Knowledge of web languages such as JavaScript are a plus but not required.&nbsp;Ability to&nbsp;write well-written code following best practices and design patterns.&nbsp;Familiar with Continuous Integration / Continuous Deployment (CI/CD) methodologies and products such as GitLab Pipelines, Jenkins, Travis CI, Circle,&nbsp;Github&nbsp;Actions, etc.&nbsp;Experienced&nbsp;with GIT&nbsp;repositories&nbsp;with hands on with&nbsp;tagging, releasing, and&nbsp;build processes&nbsp;(other repositories with&nbsp;similar code&nbsp;setup).&nbsp;Technical understanding of cybersecurity attack techniques and associated mitigations.&nbsp;Experience in UNIX/LINUX Server administration a plus.&nbsp;Experience with&nbsp;Cloud&nbsp;Storage and Virtualization solutions a plus.&nbsp;Experience in setup and maintenance of cloud infrastructure a plus.&nbsp;Android/mobile development knowledge is a plus.Core Competencies:&nbsp;Ability to review work of others and detect errors or needed modifications.&nbsp;Ability to work under direction of senior developers/engineers.&nbsp;Ability to&nbsp;determine and develop approach to solutions&nbsp;quickly.&nbsp;Ability to make recommendations to purchase hardware, software, and system\\application&nbsp;components.&nbsp;Strong communication&nbsp;skills,&nbsp;shows tact, effective listening skills and follow through.&nbsp;Innovation and&nbsp;Learning&nbsp;innovative technologies.&nbsp;&nbsp;Travel&nbsp;and alternate hours:&nbsp;Occasional travel to customer&nbsp;sites in&nbsp;support of troubleshooting, testing, and deployment activities.&nbsp;Ability to work after hours and weekends as needed.&nbsp;(outages/upgrades)&nbsp;If you are ready to join our energetic team apply below. The job requires a active TS/SCI clearance.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-29T22:49:58.000Z"
    },
    "company": {
        "name": "Brilliant Solutions Inc",
        "link": "https://www.linkedin.com/company/brilliant-solutions-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "OccupationalExperienceRequirements"
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Washington DC-Baltimore Area",
        "region": null,
        "postal_code": "21201",
        "street_address": null,
        "latitude": 38.873062,
        "longitude": -77.007385
    }
}