{
    "job": {
        "title": "Sr. Software Engineer",
        "industry": "Information Technology and Services",
        "description": "Parker + Lynch is assisting our client to hire a new Sr. Software Engineer to their permanent, growing team. The ideal candidate is a self-motivated, multi-tasker, and demonstrated team-player. You will be a Senior developer responsible for the development of new software products and enhancements to existing products, as well as mentorship of more junior developers on the team. You should excel in working with large-scale applications and frameworks and have outstanding communication and leadership skills.&nbsp;&nbsp; Responsibilities:&nbsp;&nbsp;Development of applications in a web services environment&nbsp;Writing clean, high-quality, high-performance, maintainable codeIntegration&nbsp;with 3rd&nbsp;party APIs&nbsp;System architecture and designUser interface design&nbsp;&nbsp;Web Service design and modeling&nbsp;&nbsp;Go-live planning and implementation&nbsp;Software maintenance&nbsp;Trouble shooting and resolving problems&nbsp;Enhancing application and system security&nbsp; &nbsp;Qualifications:&nbsp;&nbsp;7+ years of software development experience&nbsp;C#, .NET Core, or PERL&nbsp;&nbsp;Strong software development skills&nbsp;Strong OOP skills &amp;&nbsp;fluency in an OOP language&nbsp;Unix/Linux command line environment skills&nbsp;Experience with version control&nbsp;&nbsp;Agile methodologies (preferred)&nbsp;This is an immediate opportunity and will move fast. Please apply to this posting, or contact Julie Fanshier at 913-905-3273 for additional information. This is a direct hire position, will be BASED IN KANSAS CITY, and is NOT OFFERING SPONSORSHIP.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-21T02:16:54.000Z"
    },
    "company": {
        "name": "Parker and Lynch",
        "link": "https://www.linkedin.com/company/parker-and-lynch"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "OccupationalExperienceRequirements"
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Kansas City Metropolitan Area",
        "region": null,
        "postal_code": "64101",
        "street_address": null,
        "latitude": 39.051476,
        "longitude": -94.48047
    }
}