{
    "job": {
        "title": "Entry Level Software Developer/Engineer",
        "industry": "Information Technology and Services",
        "description": "Position Description:As a Software Engineer you will be trained to develop information systems by designing, developing, and installing software solutions to the world class clients we serve.&nbsp;Campus hires begin their careers with TCS in the Initial Learning Program.&nbsp;A fully paid training program designed to provide you with the information and training necessary to succeed at TCS and excel at client sites. However, the learning does not stop there! TCS is committed to the continuous growth of its associates, in line with the core value of Learning &amp; Sharing.&nbsp;We offer a Continuous Learning Program that spans technologies, domains, processes, and soft skills. In addition, TCS associates are encouraged to undertake certifications and accreditations in a wide range of subject areas. With clients located across the US and globe, TCS can offer great flexibility in work location, excellent career advancement, and a variety of opportunities. TCS’ mentoring, career development, and on-the-job training ensure a smooth transition into your professional life and orient you to our culture, values, vision, and mission.Responsibilities:&nbsp;Develop, create, and modify general computer application software or specialized programs&nbsp;Analyze user needs and develop software solutions&nbsp;Design or customize software for client use to optimize operational efficiency&nbsp;Improve existing systems by analyzing areas of modification&nbsp;Analyze and design databases with application areas&nbsp;Coordinate database development with a team or individually&nbsp;Maintain systems by monitoring, identifying, and correcting software defects&nbsp;Create technical specifications and test plans&nbsp;Update knowledge and skills regularly through in-house and external courses, manuals, and new applications&nbsp;Requirements:&nbsp;B.S. in Computer Science (CS), Information Technology (IT), Information Systems (IS), Electrical Engineering (EE), Computer Engineering (CE), Informatics, or Software Engineering (SE)Knowledge of basic computer science concepts, programming, and Information Systems&nbsp;Interest and willingness to travel and relocate&nbsp;Previous experience in Java/J2EE Development, C++/C#, Python, HTML, SQL and Database experience is preferred&nbsp;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-04T02:31:24.000Z"
    },
    "company": {
        "name": "Tata Consultancy Services",
        "link": "https://in.linkedin.com/company/tata-consultancy-services"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "USD",
        "min_value": 65900,
        "max_value": 78500,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Connecticut",
        "region": "United States",
        "postal_code": "06450",
        "street_address": null,
        "latitude": 41.575153,
        "longitude": -72.73828
    }
}