{
    "job": {
        "title": "Software Engineer for Construction Robotics – full stack",
        "industry": "",
        "description": "Come help us change the way we build our worldIf you are a software engineer curious about the physical world around you and interested in impacting one of the world’s largest industries with the digital tools you build, then Toggle may be the place for you.We are a construction robotics company building software and automation solutions for the world’s most ubiquitous building material: reinforced concrete. Our initial focus is on bringing automation systems to the fabrication and assembly of rebar (steel reinforcement). Rebar and reinforced concrete are the fundamental building blocks for cities and infrastructure. They are materials you’ll find on 100% of construction sites whether for housing, hospitals, bridges or power plants. As our world becomes increasingly urbanized (both at home and abroad) and we transition to renewable energy, the way we work with this critical building material needs to evolve to meet growing and increasingly complex construction demand.As a member of the software team you will work closely with our Director of Software Engineering, robotics and software engineers, to help architect and build the software platform that will power our factory and robotic systems. This is a unique opportunity to contribute to the development of new technology for the construction industry in the early stage (Series A) of an advanced manufacturing and robotics company. We are building a complete software workflow and physical manufacturing system to transform one of the most difficult materials in construction into a digitally fabricated product.What You’ll DoArchitect, design and develop internal and customer facing software tools that directly drive our businessHelp curate the software technology decisions for a business that will heavily rely on software to scale, operate, and growBuild the software systems that support:Intake and processing of architectural and engineering plans2D and 3D modeling of rebar assembliesRobotic motion planning and industrial machinery interfacingCommerce and logisticsUI/UX for all of these systemsIntegrate with third-party APIs and cloud-based servicesAbout You3-5 years of professional software development experience preferredSolid Computer Science and system design fundamentalsExperience architecting, writing and maintaining web applicationsYou thrive on being involved in all aspects of a feature development (backend and frontend)You're fluent with modern web development technologies and have a good feel for the strengths and weaknesses of different toolsYou value the craft of software engineering, while pragmatic and efficient when it comes to shipping featuresA proven record of development and ownership through the full product life cycleA product centric approach that prioritizes our customers’ experience in the design and development processA creative, collaborative and open minded team player with strong listening and communications skillsA bias toward simplicity and reliability in everything you buildNice to HavesExperience with GoExperience with relational databases: optimizations, trade-offs, design patternsExperience with TypescriptExperience with React or other frontend UI frameworksExperience with WebGLExperience with git (or other version control system) and CI/CD pipelinesExperience with robotics, manufacturing, enterprise commerce or logisticsCurrent Technology stackBackend: Go, Postgres, Redis, Docker, JSON-RPCFrontend: React &amp; TypeScript, TailwindCSS, Snowpack/WebpackToggle is a multidisciplinary company and we value diverse talent and perspectives.We believe our advantage comes from both the depth and breadth of experience and backgrounds of our team. We bring together industry veterans and outsiders, technicians and designers, and software with hardware trade craft and business. If you can add a new skill set, discipline, background or perspective to our team we are excited to hear from you!We are an equal-opportunity employer, and don’t discriminate based on gender, race, ethnicity, orientation, creed, or other trait. We support and encourage candidates of all backgrounds to apply.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T20:26:49.000Z"
    },
    "company": {
        "name": "Toggle Industries",
        "link": "https://www.linkedin.com/company/toggle-industries"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "OccupationalExperienceRequirements"
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}