{
    "job": {
        "title": "Software Engineer",
        "industry": "Financial Services,Investment Management,Banking",
        "description": "Job DescriptionImportant Note: During the application process, ensure your contact information (email and phone number) is up to date and upload your current resume when submitting your application for consideration. To participate in some selection activities you will need to respond to an invitation. The invitation can be sent by both email and text message. In order to receive text message invitations, your profile must include a mobile phone number designated as “Personal Cell” or “Cellular” in the contact information of your application.At Wells Fargo, we are looking for talented people who will put our customers at the center of everything we do. We are seeking candidates who embrace diversity, equity and inclusion in a workplace where everyone feels valued and inspired.Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.Technology sets IT strategy; enhances the design, development, and operations of our systems; optimizes the Wells Fargo infrastructure; provides information security; and enables Wells Fargo global customers to have 24 hours a day, 7 days a week banking access through in-branch, online, ATMs, and other channels.Our mission is to deliver stable, secure, scalable, and innovative services at speeds that delight and satisfy our customers and unleash the skills potential of our employees.Digital Teller &amp; ATM Technology (DTAT) supports two mission critical physical channels for Wells Fargo. On a daily basis, DTAT processes very high volume deposits and millions of dollars cash for Branch and ATM customers. We deliver world-class Digital Teller and ATM Technology and take pride in a continuous learning culture, collaboration, and individual accountability to provide the most secure, scalable and customer centric banking experience.In This Role, He/she Will Be Responsible ForDTAT is currently seeking qualified candidates for this Software Engineer position. The candidate will lead and mentor a mission critical application Teller platform along with strong technical leaders. Agile/DevOps adoption &amp; adherence Full stack technologies stack -SPRING on backend and Front end- Angular Development with new trends/technologies - Microservices, Mobile and Cloud Providing solid application architecture and design patterns experience across J2EE applications Ensuring security, risk &amp; compliance adherence without exceptions Development in Java/J2EE, SPRING, Microservices and Java multithreading Design and Development of PCF apps leveraging 12 factor principles Adopting micro services for scalability and speed Building out foundational capabilities for continuous delivery Development in NOSQL DB -MongoDBIn addition, this leader will also be responsible for team development &amp; training needs, vendor engagement management, and team communicationsRequired Qualifications5+ years of software engineering experience3+ years of Spring experience3+ years of Java experience3+ years of Oracle experience3+ years of DevOps experience3+ years of JavaScript framework experience (YUI, Angular, Node)Desired QualificationsAn industry-standard technology certificationStrong verbal, written, and interpersonal communication skills5+ years of RESTful or SOAP web servicesSplunk experience3+ years of JIRA experienceCloud computing experience1+ year of PL/SQL experienceAbility to take initiative, identify opportunities and implement changeKnowledge and understanding of Agile operational metrics such as: Velocity, Predictability, Sprint burn-downs, and etc.A BS/BA degree or higher in science or technologyGood communication skills and ability to articulate complex material to a diverse audienceJob ExpectationsAbility to work additional hours as neededAbility to work outside of regular business hoursSalary InformationThe salary range displayed below is based on a Full-time 40 hour a week schedule.AZ-Chandler:  Min: $84,000 Mid: $120,000CA-San Leandro:  Min: $100,800 Mid: $144,000Street AddressAZ-Chandler: 2600 S Price Rd - Chandler, AZCA-San Leandro: 794 Davis St - San Leandro, CADisclaimerAll offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act.Relevant military experience is considered for veterans and transitioning service men and women.Wells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation.BenefitsBenefits SummaryVisit https://www.wellsfargo.com/about/careers/benefits for benefits information.Reference Number5591534-1",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:05:30.000Z"
    },
    "company": {
        "name": "Wells Fargo",
        "link": "https://www.linkedin.com/company/wellsfargo"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "OccupationalExperienceRequirements"
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Chandler",
        "region": "AZ",
        "postal_code": "85226",
        "street_address": null,
        "latitude": 33.302284,
        "longitude": -111.8401
    }
}