{
    "job": {
        "title": "Data Scientist",
        "industry": "Marketing and Advertising,Internet,Financial Services",
        "description": "Join our team as a Data Scientist in Los Angeles, CA.Magnite (NASDAQ: MGNI) is the world’s largest independent sell-side advertising platform. Publishers use our technology to monetize their content across all screens and formats including CTV, online video, display, and audio. The world's leading agencies and brands trust our platform to access brand-safe, high-quality ad inventory and execute billions of advertising transactions each month. In April 2021 we acquired SpotX to further enhance our CTV business and better help our clients in this rapidly growing market. Anchored in sunny Los Angeles, bustling New York City, mile high Denver, historic London, and down under in Sydney, Magnite has offices across North America, EMEA, LATAM, and APAC.The RoleWe are looking for a highly talented and motivated Data Scientist. We are looking for someone who is versatile, methodical, excited by modern technology and enjoys focusing on tackling software challenges. Does that sound like you?What You Will Be DoingResearch and experiment with different machine learning algorithms and techniques for pattern analysis, statistical modeling, feature engineering and predictive model buildingPrototype and produce the developed Machine Learning solutionsWork with Engineers to make sure the models scale well on high volumes of dataUse Hive, Scala, Java or Python to utilize Hadoop/Spark to process large-scale datasetsAble to identify, analyze, and interpret trends or patterns in complex log-based data setsExplore and interpret data, analyze results using statistical techniquesUse big data skills to bring high volumes of data and data modeling togetherAwareness of priorities of client-driven and internal projectsPartner with Data Engineers to get projects into productionConduct and participate in design and code reviews for data science projectsWhat We Are Looking ForMasters or PhD degree in a quantitative field (e.g. mathematics, statistics, computer science or engineering)At least 1+ years’ experience working for a technology companyIn depth knowledge and experience with: Regression, Random Forests, Support Vector Machines, Bagging, Boosting, Decision Trees, Clustering, Optimization, Stochastic ProcessesSolid understanding of predictive analytics, statistical modeling, and data-mining (theory, algorithms, and application)Able to make intelligent approximations and design effective, practical, and scalable mathematical modelsAble to identify assumptions and the limitations of models/algorithms and the impact on reporting and decision-makingProficient in Python (required)Experience with Jupyter NotebooksExperience with Spark and \"Big-Data\" is desirableExperience with Version Control such as gitComfortable working in a Linux/Mac development environment When You Join Our Team, We OfferWe are an Equal Opportunity Employer and do not discriminate against applicants due to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, gender identity, sexual orientation or any other federal, state or local protected class.Perks/Benefits: Equity and Employee Stock Purchase Plan, Pension and Retirement Savings Plan in Several Countries, Comprehensive Healthcare Benefits for You and Your Family, Generous Time Off, Holiday Breaks and Summer Fridays, Family-Focused Leave Benefits, and Cell Phone SubsidyInvest in You: Performance Management, and Investment in Diversity Initiatives, Bonusly Peer-to-Peer Recognition Program, Turning Recognition into Tangible Perks and Magnite Swag, Community Service Events, Wellness Coach—Meditate and Recharge with an Unlimited User Account for You and a Plus OneCOVID-19 Precautions: remote interview process, virtual onboarding for new hires",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T00:00:00.000Z"
    },
    "company": {
        "name": "Magnite",
        "link": "https://www.linkedin.com/company/magnite"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "OccupationalExperienceRequirements"
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles",
        "region": "CA",
        "postal_code": "90101",
        "street_address": null,
        "latitude": 34.05224,
        "longitude": -118.24335
    }
}