{
    "job": {
        "title": "Computer Software Engineer",
        "industry": "",
        "description": "Computer Software Engineer – Virtual Internship&nbsp;Great opportunity to apply your skills &amp; talent in professional world at GAOTek Inc.&nbsp;This opportunity is for you to learn in a supportive environment and put your skills to use because our interns take up real tasks and responsibilities as they are thoroughly trained in our experienced teams. We welcome applicants who bring in the spirit of dedication and hard work. If this sounds like you then I would love to hear from you!Job Role:&nbsp;&nbsp;Computer Software Development [ Virtual Intern ]Location:&nbsp;Remote [ USA ]Experience:&nbsp;0 to 5 Years OnlyDay to Day ResponsibilitiesIdentifying areas for modification in existing programs and subsequently developing these modificationsWriting and implementing efficient codeDetermining operational practicalityDeveloping quality assurance procedures·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Maintaining and upgrading existing systems&nbsp;Benefits of this Internship&nbsp;Include:·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;You gain real-world work experience at GAO Tek Inc.·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Opportunity to learn real world people's skills, work ethics, negotiation, accountability, team spirit, multi- tasking and time management.·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Opportunity to grow your network with our 500+ colleagues worldwide.·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2 recommendations on the LinkedIn profile.·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Three certificates: One Certificate of Internship and two certificates related to their training at GAO Tek.·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Being virtual, this role allows you to work from anywhere at any time, that being said, you can commit yourself to everything you love to do!&nbsp;&nbsp;Please Note this an unpaid internship for the duration of 3 monthsInterested candidates cansend your resumes at&nbsp;\"hr-india-teami@gaotek.com\".",
        "employment_type": "INTERN",
        "date_posted": "2021-08-17T07:23:41.000Z"
    },
    "company": {
        "name": "GAOTek Inc.",
        "link": "https://www.linkedin.com/company/gao-tek-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": "no requirements"
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}