{
    "job": {
        "title": "Junior Software Engineer",
        "industry": "",
        "description": "Software Developer (Junior to Intermediate Level)Isoprime Corporation is a small software development and consulting firm based in Naperville, Illinois.&nbsp;&nbsp;We provide software technology consulting and packaged software products to serve the healthcare market – primarily hospital-based neonatal intensive care units. Job duties include software design, coding, testing, maintenance, and customer support.&nbsp;Being a small company, Isoprime offers the opportunity to experience all facets of software development and get extensive experience with a wide variety of tools.Our software products are built using Microsoft technology, including VB.Net and SQL Server, along with other supporting tools such as Crystal Reports.&nbsp;&nbsp;&nbsp;Job qualifications include classes, training, or experience with an object-oriented programming language such as VB.NET, C#, Java.&nbsp;Experience or extensive training in SQL is also required.&nbsp;&nbsp;Experience or training in Crystal Reports, OLE DB (ADO), and MS Access would be useful.&nbsp;Background in healthcare applications is a plus.&nbsp;Excellent English-language skills are required, and you must have the permanent legal right to work in the US without sponsorship.We are a small company looking for a developer who will take ownership of their work, is eager to learn and grow, and can work well as part of a small team of developers.ResponsibilitiesDesign, Develop and Test new features for our customersWork with customers on implementing and configuring our softwareAnswer support calls and emails to help customers troubleshoot problemsQualificationsExperience or training in .NET (or another object-oriented language)Knowledge and understanding of SQL and Database DesignComfortable working with customers to troubleshoot problems PreferredBS in Computer Science or related degreeVB .NET ExperienceCrystal Reports (or other reporting tools) experienceBenefitsCompetitive SalaryParticipation in all aspects of software development from design to rolloutRetirement PlanCompany holidays and paid time off",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T14:33:19.000Z"
    },
    "company": {
        "name": "Isoprime",
        "link": "https://www.linkedin.com/company/isoprime"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Naperville",
        "region": "IL",
        "postal_code": "60563",
        "street_address": null,
        "latitude": 41.771496,
        "longitude": -88.148
    }
}