{
    "job": {
        "title": "Recruiter/Sales Trainee",
        "industry": "Staffing and Recruiting,Consumer Services",
        "description": "Why Aston Carter?Aston Carter is a part of Allegis Group, the #1 Staffing Agency in the United States.&nbsp;We are a privately held organization with 250+ offices nationwide, and work with 95% of the Fortune 500 companies.&nbsp;Working at Aston Carter and why you will love it…We are a team of driven people who push ourselves and those around us to develop personally and professionally. At Aston Carter, you can expect a dynamic and competitive work environment. To ensure your success, you will take part in a comprehensive training program, surrounded by a positive and supportive culture that encourages everyone to help develop themselves and others.&nbsp;Aston Carter promotes exclusively from within; the majority of the people who start as a Recruiter advance into our sales career path.&nbsp;As a Recruiter you will impact both our candidates and customers by finding the right people for the right jobs. You will…Identify qualified candidates through various recruiting and sourcing toolsScreen and interview qualified candidatesPartner with your Account Manager to identify top accounts, target skill sets, and key market segmentsBuild and maintain relationships with industry contacts to gain&nbsp;knowledge and generate referrals and sales leadsPerform various customer service related activitiesGive back to your community by volunteering and partnering with various philanthropic organizationsLet’s talk money and perks!Aston Carter offers a base salary of $45,000 with unlimited earning potential through commissions after the hourly training period.&nbsp;Upon one year of employment, you will also receive a raise in your base salary.&nbsp;Additional benefits include (but not limited to):Healthcare benefitsDental, Vision &amp; 401(k)Paid time offEmployee discountsPerformance based incentives:Quarterly bonusesAll-expense paid tripCompany funded investment planDo you have the following?Bachelor’s Degree (preferred)Customer or sales focused experienceCollaborated in a team-oriented environment&nbsp;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:24:43.000Z"
    },
    "company": {
        "name": "Aston Carter",
        "link": "https://www.linkedin.com/company/aston-carter"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Cleveland",
        "region": "OH",
        "postal_code": "44144",
        "street_address": null,
        "latitude": 41.505547,
        "longitude": -81.6915
    }
}