{
    "job": {
        "title": "Embedded Software Engineer",
        "industry": "Computer Software",
        "description": "Embedded Software EngineerREQ-119091&nbsp;EngineeringPalo Alto, CA, United StatesAbout Yo Labs:Technology has changed daily life in a way no one could have imagined.&nbsp;It’s made us more productive, capable and connected.&nbsp;But it has come at a cost.&nbsp;We’re productive, but overwhelmed.&nbsp;Capable but paralyzed by too many choices.&nbsp;Connected, but only if social media counts.&nbsp;Living this way creates a void in our daily lives.&nbsp;Yo Labs is here to change that.&nbsp;Our team is committed to alleviating the mental load that our modern world has created by putting human connection back into technology and caretaking at the heart of everything we create.What You’ll Get to Do:You will work in a small team of device software engineers to build new IoT enabled devices. You are expected to be a hands-on tech lead with demonstrable experience in leading small teams (or large complexity components) who excel in a dynamic, fast-moving, and agile environment building high quality, high performance and scalable software. You will be expected to work equally between design, hands-on development, and providing mentorship to other developers within the organization. You should have experience leading the development of embedded device software on RTOS or Linux class devices. This engineer should have deep experience with all aspects of embedded platform software including boot loaders, kernels and several related device drivers. This engineering tech lead also requires a solid understanding of embedded security, IP networking protocols and will be expected to implement rapid prototypes on a variety of hardware. An understanding of factory processes and related security would be a plus. You should also have a demonstrable track record of working closely with mobile apps, services and PM teams with high quality products that have already launched.Build robust and scalable embedded device side software with trusted securityIndependently plan software milestones and release schedulesDesign, develop, test, deploy and maintain device IoT software in the fieldCollaborate with other engineering teams, PM and UX teamsTech Lead, may coordinate a small team of engineers while mentoring othersWhat You’ll Bring:Education &amp; Experience:Preferably &gt; 10 years experience building embedded software with C, C++, Java, PythonEvidence of architectural or design influence on embedded platform designDemonstrable, high quality, feature rich product launchesTrack record of working successfully with cross-functional teamsProven track record of shipping high quality products in volumeExcellent communication and collaboration skillsExcellent problem solving and analytical thinking skillsWhat We Offer:Competitive compensation packageComprehensive benefitsPet InsurancePaid Parental Care LeaveFlexible Work ProgramVolunteer time OffTotal Well Being Program",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-22T01:38:26.000Z"
    },
    "company": {
        "name": "Yo Labs",
        "link": "https://www.linkedin.com/company/yo-labs"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": "OccupationalExperienceRequirements"
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Palo Alto",
        "region": "CA",
        "postal_code": "94310",
        "street_address": null,
        "latitude": 37.445103,
        "longitude": -122.16036
    }
}