{
    "job": {
        "title": "Data Scientist, Advanced Analytics",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "GoHealth is looking for a Data Scientist to join its Advanced Analytics and Operations Research team. You will be responsible for using a combination of business intuition and advanced analytic techniques including statistics and optimization to develop models, products and technologies that create value across all aspects of our diverse business. Some current and recent projects include the modeling of customer retention, lifetime values of Medicare Advantage policies and detection of anomalies in commission payments. This role will directly report to our VP of Advanced Analytics.Frequently cited statistics show that women and underrepresented groups apply to jobs only if they meet 100% of the qualifications. GoHealth encourages you to break that statistic and to apply. No one ever meets 100% of the qualifications. We look forward to your application.ResponsibilitiesUnderstand GoHealth’s business processes, including the role each business unit plays in supporting the company’s ultimate objectivesLead quantitative analyses, working with product management, business stakeholders, and data engineers to identify and solve business problemsProvide new and creative insights through a combination of descriptive and diagnostic analyticsTest hypotheses across functions using measurable, statistically-significant methods to evaluate best performing strategiesStay current with data analytics tools and techniques and methods for data science, statistics and optimizationSkills And ExperienceBS or BA degree in quantitative discipline such as Mathematics, Statistics, Operations Research, Computer Science, Economics or EngineeringMastery of statistics including regression, estimation and hypothesis testingExperience with a data and analytics programming language such as Python, R, or MATLABExperience with Python packages NumPy, SciPy, pandas and scikit-learnFamiliarity with probabilistic modeling, including Poisson processes and renewal processesFamiliarity with optimization techniques including linear optimization, nonlinear optimization and/or network optimizationSQL experience in writing, editing and modifying complex, efficient SQL scriptsExperience implementing algorithms or models into a productExperience guiding decision-making in a business context through a combination of descriptive and diagnostic analyticsProven ability to take insights and turn them into models and products can drive business valueAbility to communicate complex concepts verbally and in writing to colleagues with varying degrees of analytical knowledge and understandingExperience extracting and standardizing inconsistent data from disparate data sourcesBenefits &amp; PerksOpen vacation policy because work life balance is important401k program with company matchEmployee Stock Purchase ProgramMedical, dental, vision, and life insurance benefitsPaid maternity and paternity leaveProfessional growth opportunitiesGenerous employee referral bonusesEmployee Resource GroupsWork from Home StipendGoHealth is an Equal Opportunity EmployerDue to the unprecedented situation of COVID-19, GoHealth has decided to protect our current and future employees by managing our business remotely. This is inclusive of interviewing, on-boarding and each role day-to-day. Please consider that our roles will not be remote long-term and will return to an office setting once we're safe to do so following the guidance of local health authorities’ and the CDC.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-12T22:15:21.000Z"
    },
    "company": {
        "name": "GoHealth",
        "link": "https://www.linkedin.com/company/gohealth"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Illinois",
        "region": "United States",
        "postal_code": "61709",
        "street_address": null,
        "latitude": 40.12414,
        "longitude": -89.14863
    }
}